[
  [
    "A Guide to the Bodhisattva's Way of Life",
    "In the Sanskrit language of India, this text is titled 'Bodhisattvacaryāvatāra' [Entering the Bodhisattva's Way of Life].",
    "In English: 'Engaging in the Bodhisattva's Way of Life'",
    "Homage to all Buddhas and Bodhisattvas.",
    "With deep reverence, I bow to all the Blissfully Gone Ones who possess the Dharma Body, together with their spiritual children, and to all worthy of veneration. I shall now concisely explain, in accordance with traditional teachings, the path of entering the discipline of the Blissfully Gone Ones' children.",
    "I have nothing new to say here that has not been said before, nor do I possess any skill in the art of composition. Therefore, I did not write this with the intention of benefiting others. I composed this work solely to cultivate and familiarize these teachings in my own mind.",
    "Through these words, my own momentum of faith grows for now, as I cultivate virtue. And should others who share my spiritual capacity happen to see these verses, they too will find meaning in them.\n\nMy enthusiasm for practicing virtue increases through composing this text. For the time being, these words strengthen my own faith, but there is a broader purpose: if others who are on a similar spiritual path as myself should encounter these teachings, then this composition will have fulfilled its purpose for them as well.",
    "This human life with its freedoms and advantages is extremely difficult to obtain. Having acquired this foundation capable of fulfilling life's true purpose, if we fail to accomplish what is beneficial in this present opportunity, how could we possibly expect to attain such perfect conditions again in the future?",
    "Just as lightning momentarily illuminates the darkness on a cloudy night, revealing what was hidden, so too—through the power of the Buddha—does the inclination toward virtue briefly arise in the minds of worldly beings, though only rarely.\n\nLike a flash of lightning that briefly brightens the pitch-black darkness amid dense night clouds, allowing a momentary glimpse of what lies hidden, in the same way, through the Buddha's spiritual influence, only occasionally—once in a great while—does the wisdom to pursue virtuous and meritorious actions briefly awaken in the minds of beings in this world.",
    "Therefore, virtue is perpetually feeble and weak, while negative actions are powerfully overwhelming and utterly unbearable. What virtue other than the mind of perfect enlightenment could possibly overcome such powerful negativity? Nothing else could.",
    "After contemplating for countless eons, the Lords of Sages perceived this alone as truly beneficial: through this practice, immeasurable multitudes of beings can easily attain supreme bliss.",
    "For those who wish to overcome the hundreds of sufferings of cyclic existence,\nFor those who desire to remove the unhappiness of all sentient beings,\nAnd for those who wish to experience the many hundreds of joys,\nNever abandon bodhicitta, the awakening mind, at any time.",
    "In the moment when the awakening mind arises, those wretched beings who were imprisoned in the cycle of existence instantly become known as children of the Buddhas. They transform into persons worthy of reverence from everyone in the world, including both gods and humans.",
    "Like the supreme form of the alchemical elixir that transforms base metals into gold, when you take this impure body and transform it into the precious, priceless form of the Victorious One (Buddha), you should firmly grasp what is called the awakening mind.",
    "The Buddha, the singular guide of all beings, with immeasurable wisdom, has thoroughly examined and found this to be supremely precious. Therefore, those who wish to escape from the realms of suffering should firmly hold onto the precious jewel of bodhicitta—the mind of enlightenment.",
    "All other virtuous deeds are like plantain trees—they bear fruit once and then are exhausted. But the tree of the awakening mind is different: it continually produces fruit without ever becoming depleted, and instead grows ever more abundant.\n\nJust as plantain trees wither away after bearing their single harvest, likewise all virtuous actions not embraced by the awakening mind will eventually be consumed after yielding their results. In contrast, the tree of bodhicitta—the mind aspiring to enlightenment for the benefit of all beings—constantly bears fruit that never diminishes. Rather than becoming exhausted, its beneficial results perpetually increase and multiply.",
    "Even if one has committed the most terrible negative actions,\nLike a person who gains protection from great dangers by relying on a brave protector,\nBy relying on bodhicitta, one can be swiftly liberated in an instant.\nSo why would conscientious people not rely on this?",
    "Like the apocalyptic fire at the end of time,\nThis [bodhicitta] completely consumes great negativities in a single instant.\nThe immeasurable benefits of this \nWere explained by the wise protector Maitreya to Noble Sudhana.\n\n---\n\n**Modern English Translation:**\n\nLike the cosmic fire that consumes everything at the end of an era, bodhicitta instantly and completely burns away even the most severe negative karma. The wise and compassionate protector Maitreya thoroughly explained the countless benefits of this bodhicitta to the noble seeker Sudhana.",
    "This awakened mind, bodhicitta, should be understood in brief as having two fundamental aspects: the aspirational mind of enlightenment and the engaged mind of enlightenment.",
    "Just as we understand the distinction between wanting to go somewhere and actually going there, in the same way, the wise should understand the sequential difference between these two aspects [of awakening mind].",
    "Though the mind that aspires to awakening produces\nGreat results during one's time in the cycle of existence,\nUnlike the mind that actively engages,\nIt does not generate a continuous stream of merit.",
    "From the moment one genuinely takes up this mind with unwavering resolve for the purpose of completely liberating the limitless realm of sentient beings—this marks the beginning of engagement bodhichitta.\n\nIn more natural English:\n\nFrom the moment one genuinely adopts this mind with an irreversible determination to free the infinite realm of sentient beings from suffering, a profound transformation occurs. This decisive commitment marks the transition from merely aspiring toward enlightenment to actively engaging in the bodhisattva path with unwavering dedication to liberate all beings without exception.",
    "From this moment onward, even when one is asleep or becomes heedless, multiple streams of merit will flow forth continuously, equal in measure to the vastness of space itself.",
    "This teaching on bodhicitta, along with its logical reasoning, was taught by the Tathagata himself in the Sūtra Requested by Subāhu. The Buddha personally delivered these teachings for the benefit of beings with lesser spiritual inclinations.",
    "Even if one merely thinks, 'I will relieve the headaches of sentient beings,' such an intention to benefit others already yields immeasurable merit.",
    "What need is there to mention the immeasurable merit that comes from wishing to remove the countless sufferings of each and every sentient being, and from desiring to establish each one in boundless excellent qualities?",
    "What father or mother possesses such benevolence as this?\nWho harbors such profound altruistic intention?\nNot even the gods nor the truth-speaking sages,\nNor does even Brahma himself possess such a mind.",
    "These very beings have never before\nEven for their own sake conceived such an altruistic intention,\nNot even in their dreams.\nHow then could such a mind possibly arise for the benefit of others?\n\n---\n\nIn modern prose:\n\nThese beings—such as parents, deities, and sages—have never before cultivated this type of altruistic intention even for their own spiritual benefit. Such a mind that aspires to complete awakening has never appeared for them, not even in their dreams where anything might be possible. Since they have never experienced this kind of aspiration even for themselves, how could such a mind that seeks to benefit others possibly arise in them? The intention to achieve awakening for the sake of all beings is unprecedented and extraordinary, even among those we most respect.",
    "A remarkable and unprecedented jewel of mind has arisen—this intention that contemplates the welfare of all beings, which does not occur in others even for their own benefit.",
    "The source of joy for all beings in the world,\nThe medicine that heals all creatures' suffering,\nThe merit of this precious, jewel-like mind—\nHow could anyone possibly measure its extent?\n\nIn modern English prose:\n\nThis precious awakening mind is the source of happiness for all beings throughout the world. It serves as a healing elixir for the suffering of all sentient creatures. How could anyone possibly calculate or measure the merit generated by such a precious mind? Its benefits are truly immeasurable.",
    "If merely wishing to benefit others\nSurpasses making offerings to the Buddhas,\nWhat need is there to mention the excellence\nOf striving for the happiness of all sentient beings without exception?",
    "Though people wish to escape suffering,  \nThey actively rush toward the very causes of suffering.  \nThough they desire happiness, in their confusion,  \nThey destroy their own happiness as if it were an enemy.",
    "For those deprived of happiness and overwhelmed by many sufferings, may I bring complete contentment with every form of joy and cut away all their suffering at its root.",
    "It dispels the darkness of ignorance,\nSo where could one find virtue equal to this?\nWhere could one find such a beneficial friend?\nAnd where could one find merit comparable to this?",
    "Even one who repays kindness received is certainly praiseworthy. But what need is there to speak of bodhisattvas who do good without being asked?",
    "Those who provide regular meals to just a small number of beings, who give no more than a momentary meal, or who feed others for merely half a day with disrespect—even such people are honored by others as 'doers of virtuous deeds.'",
    "What need is there to mention the continuous act of giving that fulfills all wishes? A gift that is inexhaustible like space itself, offered to limitless numbers of sentient beings over an immeasurable duration of time—the supreme bliss of the Buddhas that completely satisfies every aspiration in the minds of all beings.",
    "If someone generates ill will toward a Bodhisattva who is a benefactor of such noble character, that person will dwell in the hell realms for as many eons as the number of moments they harbored those negative thoughts.",
    " Translation of Verse 35\n\nHowever, if someone regards the bodhisattvas with a mind of pure devotion,\nThe fruits of such faith will multiply far beyond measure.\nFor these children of the Victorious Ones, even under great duress,\nNo negativity arises in them—virtue naturally flourishes instead.\n\n---\n\n Prose Translation\n\nHowever, for anyone who develops genuine devotion and faith toward the bodhisattvas, the resulting benefits will grow far more abundantly than any negative consequences previously mentioned. When someone looks upon these spiritual warriors with sincere reverence, the positive karmic fruits of such devotion will multiply exponentially, lasting for countless ages beyond the brief moments that generated them.\n\nFor these noble children of the Buddha, even when facing tremendous hardships and challenges, negativity does not arise in their minds. Under the most severe conditions—whether lacking necessities, suffering personal loss, or enduring attacks from enemies—their virtue naturally increases rather than diminishes. Unlike ordinary beings who may falter under adversity, these bodhisattvas transform obstacles into opportunities for spiritual growth, their positive qualities of compassion, patience, and loving-kindness spontaneously flourishing even in the most difficult circumstances.",
    "I bow down to the physical forms of those in whom the supreme precious mind of awakening has arisen. I take refuge in those who are sources of happiness—those remarkable beings who, even when harmed, respond by connecting the harm-doer with joy.",
    "This concludes the first chapter, entitled 'Explanation of the Benefits of the Awakening Mind,' from 'The Introduction to the Bodhisattva's Way of Life.'"
  ],
  [
    "To firmly grasp this precious mind of awakening, I make excellent offerings to the Tathagatas—those who have thus gone—and to the sublime, immaculate Dharma treasure, as well as to the Buddha's children who are oceans of noble qualities.",
    "I offer all the myriad flowers and fruits that exist,\nEvery type of healing medicine found throughout the world,\nAll precious substances and jewels that exist in the universe,\nAnd all pure, delightful waters wherever they may be.",
    "Mountains of precious jewels stand majestic, alongside secluded forest glades that inspire peaceful contemplation. Trees adorned with brilliant flowers display their natural ornaments, while others bow their branches, heavy with delicious fruits.\n\nIn this world-realm, mountains made of precious substances—like the golden Mount Meru and those formed of silver and other treasures—rise from the earth. Forest clearings and remote places offer delightful sanctuaries, undisturbed by travelers and free from noise, creating perfect spaces for reflection. Trees embellish the landscape with their colorful blossoms arranged in beautiful patterns, while fruit-bearing trees bend humbly under the weight of their perfect, ripened bounty.",
    "In the realms of gods and other beings, there are exquisite fragrances and incense, wish-fulfilling trees and trees made of precious materials. There are crops that grow naturally without needing to be cultivated or planted. Beyond these, there are countless other ornaments worthy of offering—beautiful lakes adorned with lotus flowers, ponds with delightful swans whose calls are exceptionally melodious, and various other splendid adornments suitable for veneration.",
    "I offer the lakes and ponds adorned with lotuses, inhabited by swans with their delightful, melodious calls. All these unowned treasures extend to the farthest reaches of the vast expanse of space.",
    "With my mind, I gather countless offerings and respectfully present them to the supreme Sage, the Buddha, together with all his spiritual heirs. May these holy recipients, possessing great compassion, look upon me with loving care and accept these offerings of mine.",
    "I am impoverished and lacking in merit; I possess nothing else to offer as worship. Therefore, O Protectors who think only of others' welfare, please accept this through your own power, for my benefit.",
    "I completely offer myself to the Victorious Buddhas and their spiritual heirs. I permanently dedicate my entire being to them without reservation.\n\nSupreme Bodhisattvas, please accept me fully as your own. With deep reverence, I come before you to become your faithful servant.",
    "With your complete acceptance of me as your own, I will fearlessly work for the benefit of all beings while in this world. I will thoroughly overcome all my previous negative actions, and I will not commit any further harmful deeds in the future.\n\nIn accepting your embrace, I find the courage to remain in the cycle of existence without fear, dedicating myself to the welfare of all sentient beings. I will purify myself of all past negative karma through proper confession, and I make a solemn commitment to refrain from creating any further negative actions henceforth, even at the cost of my life.",
    "In these bathing chambers filled with exquisite fragrance,\nwith crystal floors gleaming and radiantly clear,\nadorned with captivating pillars of blazing jewels,\nand crowned with canopies of luminous pearls and their hanging ornaments.",
    "To the Enlightened Ones and their spiritual heirs, I offer the sacred bath. With numerous precious vessels filled with fragrant, pleasing water, accompanied by melodious songs and beautiful music, I perform this ritual ablution for the Realized Ones and their noble disciples.\n\nIn this ceremony, I present many exquisite vessels crafted from precious materials, perfectly filled with delightful scented waters. As I bathe these awakened beings, heavenly music plays and divine songs resound, creating a complete sensory offering worthy of those who have realized the true nature of reality and those who follow in their path.",
    "I dry their sacred bodies with incomparable garments—\nClean cloths infused with exquisite fragrance.\nThen I offer them excellent robes,\nBeautifully dyed and supremely perfumed.",
    "With exquisite garments that are fine, soft, and wonderfully diverse, and with hundreds of supreme ornaments of various kinds, I adorn the noble Samantabhadra, gentle-voiced Manjushri, Avalokiteshvara (Lord of the World), and other exalted beings.",
    "With fragrances whose sweet scents pervade the entire vast universe, I anoint the bodies of all the Enlightened Sages. Their forms—radiant and blazing with light—shine like perfectly refined gold that has been thoroughly polished. With these most excellent perfumes, I respectfully apply fragrant ointments to their luminous bodies.\n\n*[This verse describes making offerings of the finest fragrances to anoint the bodies of all Buddhas throughout the cosmos. Their bodies are compared to purified gold that gleams brilliantly, and the act of anointing is performed as a gesture of profound reverence.]*",
    "I make offerings to the Supreme Lords of Sages, the most worthy objects of reverence, with all manner of delightful and fragrant flowers: celestial mandārava blossoms, lotus flowers, blue utpala lotuses, and every kind of sweet-scented bloom. I present these alongside beautifully arranged, pleasing garlands skillfully strung together in captivating designs.",
    "I offer clouds of supreme incense, whose captivating fragrance pervades the air. The wafting scent is enchanting to the mind and spreads in all directions.\n\nI also present divine food with various delicacies and drinks. These exquisite offerings, worthy of deities, I respectfully offer to them.",
    "I offer rows of gleaming golden lotuses,\nUpon which I present jeweled lamps.\nOn ground spread with fragrant perfumes,\nI scatter pleasing flower petals.",
    "I offer to those of compassionate nature the celestial palaces beyond measure, filled with enchanting hymns of praise, adorned with hanging ornaments of pearls and precious gems that radiate with dazzling beauty. These magnificent structures serve as limitless ornaments throughout the vast expanse of space.",
    "Beautiful jeweled parasols with golden handles,\nAdorned around their edges with pleasing ornamental designs,\nExquisitely shaped and delightful to behold, raised high—\nI continuously offer these to the mighty sages.",
    "Beyond these offerings, may magnificent clouds of worship manifest distinctly, each in its proper place—enchanting musical melodies with sweet harmonies that soothe the suffering of all sentient beings. May these cloud-like offerings pervade space, bringing joy and relief wherever they resound.",
    "May an unceasing rain of precious jewels, flowers, and other offerings continually shower down upon all the sacred treasures of the true Dharma, upon all stupas, and upon all sacred images.",
    "Just as Manjushri and other great bodhisattvas make offerings to the Victorious Buddhas, I too shall make offerings to the Tathagatas, those protectors, together with their spiritual heirs.",
    "I praise the oceans of excellent qualities with vast oceans of melodious expressions of praise. May clouds of sweet, melodious praise definitely arise everywhere and continually in their presence.",
    "I prostrate to all the Buddhas of the three times—past, present, and future—along with the sublime Dharma teachings and the supreme spiritual community. With bodies as numerous as all the particles in every realm, I bow down in reverence and pay homage.",
    "I bow to all foundations of the awakening mind,\nAnd I pay homage to all sacred monuments.\nI likewise honor the preceptors and spiritual teachers,\nAnd prostrate to those of supreme disciplined conduct.",
    "Until I reach the essence of enlightenment,\nI take refuge in all the Buddhas.\nLikewise, I take refuge in the Dharma\nAnd in the assembly of Bodhisattvas.",
    "With palms joined in reverence, I make my supplication to the perfectly awakened Buddhas who dwell in all directions, and to the bodhisattvas who possess great compassion.",
    "From the beginningless cycle of existence, whether in this present life or in other previous lives, I have committed harmful actions without proper understanding, or have caused others to commit such actions.",
    "Whatever deeds I have rejoiced in due to the confusion of ignorance—having recognized these mistakes, I now confess them to the Protector with utmost sincerity.",
    "I confess whatever harm I have done to the Three Precious Jewels, to my parents or other spiritual teachers, through actions motivated by afflictive emotions. Whether through physical actions, harmful speech, or negative thoughts, I acknowledge all the harm I have committed.",
    "I confess to all the guides: I, a sinner corrupted by many faults, have committed utterly unbearable negative deeds, all of which I now acknowledge.",
    "Before my negative actions are purified,  \nDeath may suddenly claim me.  \nHow can I surely be freed from these misdeeds?  \nI beg you—protect me with utmost urgency!",
    "The Lord of Death cannot be trusted—\nHe does not wait for tasks completed or unfinished.\nTherefore, whether sick or healthy,\nNo one should trust in the certainty of life.",
    "I must ultimately abandon everything and depart alone, but not having truly understood this reality, I have committed various kinds of harmful actions for the sake of those I love and those I dislike.",
    "Enemies will cease to exist,\nAnd friends will fade away as well.\nI myself will also cease to be,\nAnd likewise, everything will come to nothing.",
    "Just as with experiences in a dream,\nWhatever objects we have encountered and engaged with\nBecome merely things we remember.\nAll that has passed cannot be seen again.",
    " Translation from Tibetan Buddhist Text\n\nEven in this very life, while you still exist, \nMany friends and enemies have already passed away.\nYet the unbearable negative karma created for their sake\nRemains directly before you.\n\n---\n\nIn modern prose:\n\nEven in this present lifetime, while you are still alive, many people you once loved and disliked have already died. Though these relationships have ended, the severe negative karma you accumulated by performing harmful actions for their benefit or due to aversion toward them still remains directly before you, awaiting its inevitable ripening.",
    "Thus, not having realized that I am but a temporary visitor in this world, I have committed numerous harmful actions through delusion, attachment, and aversion.",
    "Day and night pass without pause, as this life constantly diminishes. Since no additional time comes from elsewhere, how could I possibly avoid death?",
    "Though I may lie on my deathbed surrounded entirely by family and friends, the painful sensations of my life force ebbing away must be experienced by me alone.",
    "When seized by the messengers of the Lord of Death,\nWhat help can relatives offer? What good are friends?\nAt that moment, only spiritual merit serves as protection—\nYet even this, I have failed to cultivate.\n\nIn clearer modern English:\n\nWhen I am captured by the messengers of death, neither family nor friends will be able to help me. At that critical moment, the only true protection would be the merit I've accumulated through virtuous actions—yet I have neglected to build up even this essential refuge.",
    "Protector, in my negligence, I did not recognize these terrors. For the sake of this impermanent life, I have committed many harmful deeds.",
    "When a person is led to the place of execution for the cutting off of limbs today, they become utterly terrified. With parched mouth and pitiful, bloodshot eyes, they appear completely transformed from their former self.",
    "What need is there to describe the extreme suffering of one who is seized by the messengers of the Lord of Death with their terrifying appearances, and who is afflicted by the great disease of terror?",
    "With terror-stricken eyes wide open, I desperately search in all four directions for protection, thinking: 'Who will properly save me from this great fear?'",
    "Seeing that there is no refuge in any direction,\nI will then fall into complete despair.\nIn that dreadful place where no protection exists,\nWhat shall I do at that time?",
    "From this very day I take refuge in the Victorious Ones, the protectors of all beings, who diligently strive for the purpose of safeguarding wandering beings, who possess great strength and dispel all fears.",
    "I also take genuine refuge in the Dharma that the awakened ones have fully realized—the teaching that dispels all fears of the cycle of suffering—and likewise, I sincerely take refuge in the assembly of bodhisattvas.",
    "Overwhelmed with terror, I offer my entire being to Samantabhadra. By my own volition, I also surrender this body of mine to Mañjuśrī.",
    "To that Guardian Avalokiteśvara, whose compassionate activity never errs,\nI cry out with the desperate wail of one in utter distress.\nPlease protect me, though I am burdened with misdeeds.",
    "To the noble Space Essence Bodhisattva and the Earth Essence Bodhisattva, as well as to all great compassionate protectors, I seek refuge and cry out in anguish from the depths of my heart.",
    "When the messengers of death and all malevolent beings\nBecome terrified at the mere sight of him\nAnd flee scattered in all four directions,\nIn that Wielder of the Vajra, I take refuge.",
    "Having previously disregarded your teachings,\nNow, seeing the great terrors before me,\nI come to you for refuge in my fear.\nPlease swiftly dispel these frightening dangers.\n\nIn more natural prose:\n\nI confess that I have previously transgressed your sacred instructions. Now, having recognized the great dangers that await me as consequences of my actions, I turn to you for protection in my fear. I humbly request that you quickly remove these terrors that threaten me.",
    "If one fears even ordinary illness\nAnd must follow a physician's instructions,\nWhat need is there to mention those constantly afflicted\nBy the hundred ailments of desire and other faults?",
    "If even a single affliction can destroy all people dwelling in this world, and no medicine to heal these afflictions can be found in any direction, [then the Dharma's value is immeasurable].\n\nIn more natural English:\n\nWhen a single mental affliction has the power to destroy all human beings living in this world, and when no remedy that could heal these afflictions can be found anywhere in the universe, [we must recognize the Buddha's teachings as the only true medicine].",
    "In this world, the Buddha—the omniscient physician who removes all thorns of suffering—has given us teachings. To contemplate disobeying these instructions is utterly foolish and deserving of reproach.",
    "If I must remain vigilant even at ordinary small precipices,\nHow much more careful should I be regarding the abyss\nWhere one falls a thousand leagues\nFor an extremely long time?",
    "To think 'I certainly will not die today' and remain comfortably at ease is inappropriate. The time when I will cease to exist will inevitably arrive.",
    "Who has granted me freedom from fear? How shall I escape this fate with certainty? Since I will inevitably cease to exist, how can my mind remain so complacently at ease?",
    "From all those pleasures I've experienced and lost in the past, what of substance truly remains for me? Yet I became so fixated on these things that I violated the instructions of my spiritual teachers.",
    "Having abandoned this present life along with all relatives and friends, I must journey alone to an unknown destination. Of what use then are all those I love or dislike?",
    "From non-virtuous actions comes inevitable suffering. How can I be definitively liberated from this cycle? This is the singular contemplation worthy of my constant attention.",
    "Due to my ignorance and delusion, I have committed various wrongful actions—whether those that are inherently wrong by their very nature, or those that are wrong because they violate specific precepts I have undertaken. Whatever negative deeds I have committed among these categories, I acknowledge them all.",
    "Standing directly before the Protectors, with palms joined together and a heart fearful of suffering, I prostrate again and again, and openly confess all these misdeeds.",
    "O guides, I ask you to recognize my misdeeds as true transgressions. \nThis conduct was not virtuous, and henceforth I shall never commit such actions again.",
    "Thus concludes the second chapter, 'Confession of Negativities,' from The Introduction to the Bodhisattva's Way of Life."
  ],
  [
    "I rejoice wholeheartedly in all virtuous actions that provide relief from the sufferings of lower realms for all sentient beings. With genuine delight, I celebrate when those experiencing suffering find happiness and well-being.",
    "I rejoice in the virtuous deeds accumulated as causes for enlightenment.\nI rejoice in the definite liberation of embodied beings from the sufferings of cyclic existence.",
    "I rejoice in the enlightenment of the protectors, and likewise in the attainments of the bodhisattvas on their spiritual grounds. With joy, I celebrate the vast ocean of virtuous intentions that bring happiness to all sentient beings. I wholeheartedly rejoice in those who work for the benefit of all living beings.",
    "With palms joined in reverence, I make this supplication to all the Buddhas throughout every direction: Please kindle the lamp of Dharma for sentient beings who are bewildered in the darkness of suffering.",
    " Translation\n\nTo those Enlightened Ones who intend to pass into nirvana, I join my palms in respectful supplication: Please do not leave this world in darkness; I request that you remain for countless eons.\n\n Expanded Translation\n\nWith palms pressed together in reverence, I make this heartfelt request to all the Enlightened Conquerors who show the intention to enter final peace: Please do not abandon this world's beings to wander in blindness, unable to discern right from wrong. Instead, I implore you to remain present in this world for immeasurable eons, illuminating the path for all.",
    "Having performed all these practices, I dedicate whatever virtue I have accumulated. Through this merit, may all the sufferings of all sentient beings be completely dispelled.",
    "For as long as beings are afflicted with illness, until they fully recover their health, may I become their medicine, their physician, and also their caretaker serving their needs.",
    "I shall bring down showers of food and drink to relieve the suffering of hunger and thirst. During the intermediate kalpa of famine, may I myself become food and drink for all beings.",
    "For all beings who are impoverished and destitute, may I become an inexhaustible treasure. May I remain readily available before them as various necessities and requisites of all kinds that they might need.",
    "My body, along with all possessions and enjoyments, as well as every virtue I have accumulated throughout past, present, and future times—I give all these away without reservation or hesitation for the sole purpose of fulfilling the needs of all sentient beings.",
    "Complete renunciation leads to liberation,\nAnd my mind aspires to achieve this freedom.\nSince I must eventually relinquish everything,\nThe supreme approach is to give it all to sentient beings.",
    "Since I have already freely given this body to all sentient beings, it is now theirs to use as they wish. Therefore, whether they choose to kill me, criticize me, beat me, or use me in any way that pleases them—this is entirely their right.",
    "Let them play with my body, mock me, or make it an object of ridicule. I have already given this body away to them, so why should I concern myself with how they treat it?",
    "Let them engage in whatever actions that bring them happiness. May no one ever experience anything meaningless or purposeless as a result of their connection with me.\n\nIn more detailed prose:\n\nI allow others to engage in whatever beneficial actions that will not cause them harm. May I never become the cause for any being to experience meaningless suffering or purposelessness when they direct their attention toward me. May all who connect with me always find meaningful benefit from that interaction, and may none of their actions toward me ever be wasted or fruitless.",
    "Whenever anyone's mind focuses on me and experiences either anger or devotion, may that very mental state always become the cause for fulfilling all their aims.\n\nIf others direct their attention toward me—whether with hostility or with faith—may that very interaction, whatever its nature, invariably serve as a catalyst for the complete achievement of their goals, both immediate and ultimate.",
    "Those who speak ill of me,\nThose who cause me harm,\nAnd likewise those who mock or ridicule me—\nMay all of them share in the fortune of enlightenment.\n\n Modern English Translation (Prose)\n\nMay all those who verbally criticize or slander me to my face, those who inflict physical harm upon me or damage my possessions, and likewise those who ridicule me or spread malicious gossip behind my back—may every single one of these beings be blessed with the good fortune that leads to enlightenment.",
    "I am the protector for those without protection, the guide for those who journey on the path. For those who wish to cross over, I have become their boat, their vessel, and their bridge.",
    "May I become an island for those seeking refuge, a lamp for those desiring illumination, and a comfortable dwelling place for those needing shelter. For all embodied beings who need assistance, may I become a servant to them all.",
    " Translation of Buddhist Aspiration Verse\n\nMay I become like a wish-fulfilling jewel for all beings, granting whatever they desire. Like a perfect treasure vase from which all necessities flow abundantly. Like a powerful mantra of accomplished wisdom that transforms those it touches. Like a supreme healing medicine that cures all afflictions and suffering. Like the wish-fulfilling trees that produce whatever one imagines. And like the miraculous wish-granting cow that provides endless nourishment for all living creatures.\n\nIn this way, may I become the complete source of fulfillment for all embodied beings, satisfying their every need and desire.",
    "Like the great elements of earth and the others, may I too constantly become the foundation for the diverse sustenance of immeasurable sentient beings, just as space accommodates all.",
    "Just as sentient beings pervade the entire reaches of space, may I become a source of sustenance for them in every possible way until all have attained liberation beyond suffering.",
    "Just as the Buddhas of the past, those who have gone to bliss, first generated the mind of enlightenment, and then progressively trained in the practices of bodhisattvas, I too will follow this same sequential path.",
    " Translation of the Bodhicitta Commitment Verse\n\nJust as those before me have done, I generate the awakening mind for the benefit of all beings. Likewise, I will train systematically in the disciplines, progressing step by step along the path.\n\n---\n\n Detailed Translation\n\nIn the same way as the enlightened ones who came before me, I now generate bodhicitta—the mind of awakening—for the welfare and benefit of all living beings. Similarly, I commit to train in the various disciplines of the bodhisattva path, following them in their proper sequence according to my capacity.\n\nThis verse represents the practitioner's formal commitment to generate bodhicitta (the altruistic intention to attain enlightenment for the sake of all beings) and to undertake the progressive training in the bodhisattva practices. It establishes both the aspiration to benefit others and the practical commitment to engage in the necessary training to fulfill that aspiration.",
    "Thus, once an intelligent person has genuinely embraced the awakening mind with deep faith, they should uplift and encourage their mind in this manner to ensure its continued development and expansion.",
    "Today my life has become meaningful,\nAnd I have fully realized the potential of human existence.\nToday I have been born into the Buddha's family,\nAnd now I have become a child of the Buddhas.\n\n Modern English Translation\n\nToday my life has truly become fruitful and meaningful. I have genuinely fulfilled the purpose of this human existence that I have so fortunately obtained. On this day, I have been born into the family of the Buddhas, and I have now become a true child of the Awakened Ones.",
    "Now I must commit to actions that befit my lineage, ensuring that I do not tarnish this pure and noble heritage with any stain of misconduct.\n\nI must act in complete harmony with the Buddha's family line that I have entered, conscientiously performing deeds that reflect its values. This flawless and venerable lineage—passed down from the Buddha through countless realized masters to my own teachers—must remain unsullied by my actions. I shall conduct myself in such a way that no impurity or defilement arises through my behavior, preserving the integrity that has characterized this tradition throughout its beginning, middle, and end.",
    "Like a blind person who unexpectedly discovers a precious jewel within a pile of discarded rubbish, somehow, by a remarkable confluence of circumstances, this awakening mind has miraculously arisen within me.",
    "This is the supreme elixir \nthat conquers death for all beings.\nThis is also the inexhaustible treasure\nthat dispels the poverty of all beings.",
    "This is the supreme medicine that brings complete healing to the ailments of all beings. It is a tree of rest providing relief to those who have grown weary from wandering the paths of existence.",
    "This bodhicitta is a universal bridge that liberates all beings from the lower realms. It serves as a common foundation for all spiritual travelers. Like the moon rising in the mind, it dispels the burning torment of worldly afflictions.",
    "Bodhicitta is the great sun that completely dispels the cataracts of ignorance afflicting all beings. It is the essential butter that emerges when the milk of the sacred Dharma is thoroughly churned.",
    "For wandering beings who journey along the paths of existence, guests desiring to experience pleasant enjoyments, this generation of bodhicitta stands ready as the supreme source of happiness, satisfying the great multitude of sentient beings who arrive as visitors.",
    "Today, in the presence of all the Protectors, I have invited all beings to attain the state of perfect enlightenment, and in the meantime, to experience happiness along the way. May all gods, demigods, and all other beings rejoice in this invitation.",
    "This concludes the third chapter, entitled 'Thoroughly Embracing the Awakening Mind,' from 'Entering the Way of the Bodhisattva.'"
  ],
  [
    "Once having firmly established bodhicitta, children of the Victorious Ones should constantly strive with unwavering diligence never to transgress the trainings.\n\n---\n\nIn more natural contemporary English:\n\nHaving firmly established the awakening mind, those who follow the path of the enlightened ones should continually strive, without negligence, never to violate their spiritual commitments.",
    "For actions undertaken rashly or impulsively, or those not properly examined beforehand, it is appropriate to reconsider whether to proceed or abandon them, even after making a commitment.\n\nIn more detail: When you have hastily begun something without forethought, or when you have not thoroughly investigated the full implications of an action, it remains reasonable—even after having made a promise to complete it—to carefully examine whether you should continue with it or let it go. Such reconsideration is not only permissible but proper.",
    "What the Buddhas and their spiritual heirs have examined with their great wisdom, and what I myself have also thoroughly investigated—what reason could there be to delay embarking on this path?",
    "If, having made such solemn vows, I fail to fulfill them through concrete action, I will have deceived all these sentient beings. What then would become of my future rebirth?",
    "If a person merely thinks of giving away even the most insignificant item, but then fails to actually give it, it is taught that they will be reborn as a hungry ghost.",
    "If I earnestly seek the supreme bliss of enlightenment with utmost sincerity and heartfelt commitment, yet then deceive all living beings by abandoning this pledge, how could I possibly find my way to higher realms?",
    "Only the Omniscient One truly understands the inconceivable workings of karma: how even those who have abandoned the mind of enlightenment may still attain liberation.",
    "For a bodhisattva, this constitutes the most grievous of all downfalls. When this transgression occurs, one's capacity to benefit all sentient beings becomes diminished.",
    "Whoever, even for a single moment, obstructs or interferes with the virtuous deeds of a bodhisattva, diminishes the welfare of sentient beings by doing so. For such a person, there will be no end to their suffering in the lower realms.",
    "If I destroy even a single sentient being's happiness,\nI myself will deteriorate and fall.\nWhat need is there to mention the consequences\nOf destroying the happiness of all embodied beings\nWho fill the entirety of limitless space?",
    "Thus, if one vacillates between the power of transgressions and the power of the awakening mind, alternating between them while wandering in cyclic existence, there will be a long delay in attaining the spiritual grounds.",
    "Therefore, I must respectfully fulfill what I have promised. If I fail to make diligent effort from this day forward, I will sink lower and lower into suffering.\n\n---\n\nTherefore, I must diligently fulfill the commitments I have made with proper respect and care. If starting today I fail to apply myself with genuine effort, I will descend further and further downward into increasingly difficult states of existence.",
    "Though countless Buddhas have passed beyond—\nThose who worked solely for the benefit of all sentient beings—\nI, due to my own faults,\nHave not become a recipient of their healing care.",
    "If I continue to act in the same harmful way as before, I will repeatedly experience the same consequences—rebirth in lower realms, disease, bondage, being cut and dismembered, and similar sufferings.",
    "When will I obtain such rare and precious opportunities: the appearance of an Awakened One in the world, faith in their teachings, this human form, and the capacity to cultivate virtue?",
    "This day free from illness is precious,\nThough we have food and are safe from harm,\nLife itself is momentary and deceptive,\nAnd this body is merely borrowed for a brief time.",
    "With behavior such as mine, I will not even obtain a human body again. And if I fail to secure a human form, there will be only wrongdoing and no opportunity for virtue.",
    "When, despite having the capacity for virtue, I fail to perform good deeds, what will I do when I am completely bewildered by the sufferings of the lower realms?\n\nEven though I now possess the fortunate opportunity to engage in virtuous actions, if I neglect to create this goodness, what recourse will I have later when I'm overwhelmed by the agonies of unfortunate rebirths and utterly confused about how to free myself?",
    "When one fails to engage in virtuous actions and instead accumulates harmful deeds, even the mere mention of fortunate rebirth will not be heard for hundreds of millions of eons.",
    "For this very reason, the Blessed One taught:\n\n'Attaining human birth is extremely rare—like a blind turtle in a vast ocean, surfacing only once every hundred years, by chance putting its neck through a small hole in a wooden yoke tossed about by the waves.'",
    "By a single moment's negative action,\nOne remains in the Avīci hell for an entire eon.\nGiven the harmful deeds accumulated since beginningless time,\nIs it even necessary to mention one will not reach the higher realms?",
    "Merely experiencing suffering alone does not bring liberation. Indeed, while enduring the consequences of past harmful actions, one generates yet more negativity.",
    "Having obtained this rare and precious human life with all its freedoms and opportunities, if I fail to cultivate virtue, there is no greater self-deception than this, nor is there any greater delusion.",
    "If, having understood these truths, I later become discouraged through delusion, then at the time when death approaches, overwhelming sorrow will arise within me.",
    "The unbearable fires of hell will burn my body for an immeasurably long time. And without doubt, my mind will be tormented by the blazing flames of unbearable regret.",
    "Having somehow obtained this extremely rare human existence that serves as a basis for achieving benefit—a foundation so difficult to find—if I, despite possessing awareness and understanding, allow myself to be led back to those very hell realms again, it would be as if I had lost all reason.",
    "Like someone enchanted by magical spells, I find myself here utterly mindless. I don't even understand what has bewildered me. What dwells within me that causes this?",
    "These enemies of mine—hatred, craving, and other afflictions—possess no legs, arms, or physical form. They are neither brave warriors nor intelligent strategists. Yet somehow, they have enslaved me completely, treating me as their servant.",
    " Translation\n\nWhile residing within my own mind,\nthese afflictions happily inflict harm upon me.\nIf I remain patient with them and do not become angry,\nsuch misplaced patience is worthy of reproach.\n\nIn modern prose:\n\nThese mental afflictions, while dwelling within my very own mind, gleefully and contentedly cause me harm. If I practice patience toward these afflictions and refrain from rightful anger against them, such misapplied patience is inappropriate and deserves condemnation. One should not tolerate what is actually harmful to oneself—this kind of misguided forbearance is truly blameworthy.",
    "Even if all the gods and demigods \nWere to rise up against me as enemies,\nEven they would not have the power\nTo lead me into and cast me into the fires of the Avīci hell.",
    "When these powerful enemies—my own mental afflictions—\nEncounter something, they are so destructive\nThat even Mount Meru would be completely annihilated, \nLeaving not even ashes behind.\nInto such devastation, they cast me in a single instant.\n\n Modern English Translation\n\nThese formidable enemies—my own mental afflictions like attachment and hatred—possess a destructive power beyond compare. When unleashed, their force is so overwhelming that they could completely consume even Mount Meru, the mightiest mountain in the cosmos, leaving not even a trace of ash behind. In just a single moment, these inner adversaries can cast me into such terrible destruction. No external enemy could ever pose such a threat to my wellbeing as these afflictions that dwell within my own mind.",
    "No worldly enemies, no matter how long-lived, can persist as my afflictive emotions have. These inner foes have endured without beginning or end, spanning an immense duration that no ordinary adversary could match.\n\nThe afflictions that trouble my mind—anger, attachment, ignorance, and the rest—have been my enemies from beginningless time. Unlike ordinary adversaries who might threaten me for a season or a lifetime, these inner enemies have pursued me without respite through countless rebirths. No external foe—no matter how determined—can sustain such relentless opposition across the vast expanses of time that my mental afflictions have endured.",
    "When we serve others with respect and in harmony,\nEveryone becomes a source of benefit and happiness.\nBut when we indulge and serve our mental afflictions,\nThey only return to cause us greater suffering and harm.",
    "How could I possibly feel fearless joy in the cycle of existence when these enemies—who have continuously been my adversaries for ages, who are the single source from which floods of suffering arise, and who definitely make their home in my heart?",
    "These wardens of the prison of cyclic existence, who in the hells and other lower realms have become executioners and tormentors—if they remain in the abode of my mind, caught in the net of attachment, how could I possibly find any happiness?",
    "Therefore, I will not abandon my effort here until I have definitively conquered these enemies face to face. Even those filled with pride and overtaken by anger will not sleep until they have defeated someone who has caused them only minor harm.",
    "If warriors who face enemies on the battlefield—enemies who naturally suffer and will eventually die anyway—do not retreat until they have accomplished their purpose, enduring the pain of being struck by arrows, spears, and weapons, then how much more should we persevere when confronting our mental afflictions?\n\nWhen these afflictions arise in direct confrontation, though we may wish to forcefully defeat them, we should never turn back without accomplishing our goal, even while bearing the suffering they inflict. Just as soldiers withstand physical wounds to defeat temporary foes, we must remain steadfast in our battle against the afflictions that cause endless suffering, never retreating until we have achieved victory over them.",
    "When I am dedicated to defeating these inherent enemies—the certain causes of all suffering throughout time—why would I ever become disheartened or discouraged, even if this effort leads to hundreds of adversities? It goes without saying that I will remain steadfast.",
    "If I can proudly display wounds inflicted by enemies without purpose as if they were ornaments adorning my body, then why should I consider suffering harmful when I am diligently striving toward a truly meaningful goal?",
    "Even fishermen, outcasts, and farmers, whose minds are focused solely on their own livelihood, endure the hardships of cold, heat, and other adversities. How much more, then, should I bear such difficulties when working for the happiness of all beings?",
    "Having pledged to liberate beings from afflictions\nThroughout the ten directions to the furthest reaches of space,\nI myself remain ensnared by these very same afflictions.",
    "Without knowing the true measure of my own capabilities, how is it not madness to make such declarations? Therefore, I shall remain forever unwavering in my commitment to defeat the afflictions.\n\n*Alternative rendering with slightly more natural phrasing:*\n\nIt would be madness to make grand declarations without understanding my own limitations. Therefore, I will remain steadfast and never turn back from my commitment to overcome the mental afflictions.",
    "I will take a stand against these afflictions, harbor enmity toward them, and engage them in battle. These specific forms of attachment and hostility—directed at destroying afflictions—are exceptions to what must be abandoned.",
    "Even if I am burned alive and killed,\nOr even if my head is cut off—that would be preferable.\nBut under no circumstances\nWill I bow down to the enemy of afflictions.",
    "Unlike an ordinary enemy who, when expelled from a territory, may dwell in another region and establish a foothold there, gathering strength before returning to fight again, the enemy of mental afflictions is fundamentally different. When mental afflictions are truly vanquished through spiritual practice, they cannot simply relocate elsewhere, accumulate power, and return to harm you. Once properly uprooted, these inner adversaries—such as attachment, aversion, and ignorance—have nowhere to retreat, no place to regroup, and no means to launch a counterattack.",
    "These mental afflictions must be dispelled by the eye of wisdom.\nOnce removed from my mind, where would they go?\nWhere could they possibly dwell, only to return and harm me again?\nThe truth is, I—with my weak resolve—have simply failed to make proper effort.",
    " The Nature of Afflictions\n\nAfflictive emotions do not reside in external objects, nor in the collection of senses, nor in the space between them. If they exist neither there nor elsewhere, where do these afflictions dwell that torment the entire world?\n\nThey are like illusions. Therefore, release the fear from your heart and cultivate diligence to develop wisdom. Why needlessly subject yourself to the torments of hell realms and other sufferings?\n\n---\n\n Expanded Translation\n\nAfflictive emotions—such as attachment and aversion—do not truly exist within external objects, nor within our sense faculties, nor even in the space between perceiver and perceived. Yet if they exist nowhere else either, we must ask: where exactly do these afflictions reside that cause suffering to all beings?\n\nThe truth is that these afflictions are like magical illusions—appearing vividly yet lacking inherent existence. Understanding this, free your heart from the fear that you cannot overcome them. Instead, apply yourself diligently to developing the wisdom that recognizes their empty nature.\n\nWhy would you pointlessly allow yourself to suffer the agonies of hell realms and other miserable states? You have the capacity to free yourself—it makes no sense to continue harming yourself unnecessarily.",
    "Having carefully reflected on these teachings of mindfulness, I will strive diligently to practice the training as explained. For how can patients who need treatment ever be cured if they do not listen to their physician's instructions and take the prescribed medicine?",
    "This concludes the fourth chapter entitled 'Teaching on Vigilance' from 'Entering the Bodhisattva's Way of Life.'"
  ],
  [
    "For those who wish to safeguard their spiritual training, guarding the mind with utmost diligence is essential. If one fails to protect this mind, it will be completely impossible to maintain one's spiritual discipline.",
    "The harm inflicted by an untamed, intoxicated elephant in this world does not compare to the torment caused by the wild elephant of one's own mind. When the elephant of the mind is left unrestrained, it creates suffering comparable to the agonies of the most terrible hell realms.",
    "When the elephant of the mind is firmly bound\nWith the rope of constant mindfulness,\nAll fears will completely disappear,\nAnd every virtue will come readily to hand.",
    "Tigers, lions, elephants, bears,\nSnakes and all enemies;\nThe guardians of the hell realms,\nAnd likewise witches and demons.",
    "By binding this single mind alone,\nAll sources of harm are likewise bound.\nBy taming this single mind alone,\nAll threats are similarly tamed.",
    "All fears and immeasurable sufferings arise from the mind alone—this is what the One who speaks the truth has taught us.",
    "Who has deliberately fashioned the weapons in the hell realms?\nWho has created the burning iron ground?\nFrom what have those hosts of women appeared?",
    "The Sage has taught that all these various fearsome things\nArise from the sinful mind.\nThus, in all three worlds,\nThere exists no fear other than the mind.",
    "If the perfection of generosity means making all beings free from poverty, yet there are still destitute beings in the world today, how could the previous protectors have perfected the paramita of giving?",
    "The perfection of giving is defined as having the generous intention to offer all one's possessions—along with the fruits or benefits that come from them—to all beings without exception. Therefore, this perfection is essentially a state of mind itself.",
    "Where could I possibly send fish and other creatures so they would never be killed? There is no such place. Rather, the perfection of ethical discipline comes from attaining a mind of renunciation.\n\nWhen one develops the mental state that completely renounces harmful intentions, this is what is meant by the perfection of ethical discipline. True ethical discipline arises not from the absence of beings to harm or from physically protecting all creatures, but from one's internal commitment to never cause harm.",
    "The unruly sentient beings are as vast as space—\nIt would be impossible to overcome them all.\nYet if you vanquish this single angry mind,\nIt is as though you have defeated all enemies.",
    "How could one possibly find enough leather to cover the entire surface of the earth? It would be impossible to gather sufficient hide for such a vast undertaking. However, with just enough leather to make a pair of shoe soles, it is as if the whole earth has been covered for you.",
    "Just as I cannot possibly prevent \nor turn back external circumstances,\nI will instead restrain my own mind.\nWhat need is there to restrain other things?",
    "Even with body and speech in action, without a powerful mind, one cannot attain the fruits that come from a single moment of clear mental focus—fruits such as rebirth in the Brahma realms. When the mind's engagement is weak, the results will not be the same, despite the many potential benefits of physical and verbal efforts.",
    "Even if you practice recitations and austerities for a very long time, when performed with a distracted and unfocused mind, the Buddha—who knows the true nature of all things—declares them to be entirely pointless.",
    "Those who do not understand this secret of the mind—the supreme essence of all spiritual teachings—will wander aimlessly without purpose, even though they desire to attain happiness and overcome suffering.",
    "Therefore, I must firmly secure and diligently protect this mind of mine. Beyond the discipline of guarding the mind, what purpose do numerous other religious observances serve?",
    "Just as a person with a wound must be vigilant and take special care when among unruly people, similarly, when dwelling among negative or harmful individuals, one must constantly protect the wounded nature of one's mind.",
    " Translation\n\nIf we are frightened by even minor suffering from a physical wound\nAnd take care to protect that wound with attention,\nWhy then wouldn't we guard the wound of our mind,\nWhen we fear the crushing mountains that will destroy us?\n\n Explanatory Translation\n\nIf we become alarmed by even the small suffering that comes from a physical wound and diligently protect that wound, then why wouldn't we protect the wound of our mind, especially when we fear the terrible consequences—like being crushed between mountains in the hell realms—that come from leaving our minds unguarded? \n\nThe verse presents a simple but powerful argument: we instinctively protect physical wounds that cause only minor suffering, yet we often neglect to guard our minds, despite the fact that mental afflictions lead to far more devastating consequences. Just as we carefully tend to bodily injuries to prevent infection or increased pain, we should be even more vigilant in protecting our minds from harmful thoughts and emotions that can lead to tremendous suffering both now and in future lives.",
    "When one maintains this way of practice, even while dwelling among harmful people or residing in the company of women, a practitioner who is steadfast in their vows will not falter in their discipline.",
    " Translation\n\nLet my gains, tokens of respect,\nMy body, and even my livelihood be lost.\nLet other virtuous deeds decline if they must,\nBut I shall never allow my mind to deteriorate.\n\n---\n\n**Modern English Translation:**\n\nI would rather lose all my material possessions, honors, and recognition than compromise my mind's integrity. Even if my physical body wastes away and my very livelihood disappears, I can accept that loss. Indeed, I would sooner let other virtuous actions diminish than allow my mind to deteriorate in any way. While external things may come and go, I must never, under any circumstances, allow my mindful awareness to decline.",
    "To those who wish to guard their minds, I join my palms together in respect and earnestly implore:\n\n'Protect mindfulness and introspective awareness with all your effort and diligence.'",
    "Just as people afflicted by illness are incapable of performing any tasks, similarly, a mind disturbed by confusion is incapable of engaging in any worthwhile activities.",
    "Without vigilant awareness, all knowledge gained through hearing teachings, contemplation, and meditation is like water in a cracked vessel—it will not remain in memory.",
    "Many who possess extensive learning, who are filled with faith, and who diligently apply effort—nonetheless become stained with moral downfalls due to the fault of lacking introspective awareness.",
    "When mindfulness is lost, the thieves of unawareness follow closely behind. Even though you may have accumulated merit and virtuous deeds, they are stolen away like possessions seized by a bandit, causing you to descend into unfortunate realms of existence.",
    "This band of mental afflictions acts like robbers and thieves,\nAlways searching for opportunities to attack.\nWhen they find an opening, they steal away our virtue\nAnd destroy even our chance for a fortunate rebirth.",
    "Therefore, never allow mindfulness to stray from the doorway of your mind. Even if it has wandered away, bring it back by recalling the sufferings of lower rebirths that will result.\n\nIn more natural contemporary English:\n\nTherefore, never let your mindfulness drift away from guarding the entrance to your mind. If you find that your attention has wandered, immediately bring it back by remembering the painful consequences of negative rebirths that such carelessness will bring.",
    "For those who approach their practice with reverence—whether motivated by their association with a spiritual teacher, through the guidance of their preceptor, or out of a mindful fear of missteps—mindfulness arises naturally and with ease. The fortunate ones who maintain respect for their training, guided by their teachers' instructions, find that attentive awareness develops effortlessly in their minds.",
    "The Buddhas and Bodhisattvas possess unhindered vision in all directions. I am constantly present before all of them, and they are always in my presence.",
    " Translation\n\nAfter contemplating in this way, one should remain mindful with a sense of shame, respect, and appropriate fear. Through this practice, the recollection of the Buddha will naturally arise within one again and again.\n\n Expanded Translation\n\nHaving reflected deeply on the fact that the Buddhas and Bodhisattvas are constantly observing us with their unhindered vision, one should maintain three essential qualities: a sense of shame that prevents wrongdoing based on one's own integrity, deep respect for the teachings and the Teacher, and a healthy awareness of the consequences of one's actions. Abiding in this mindful state, the practitioner will find that the remembrance of the Buddha spontaneously arises in their mind repeatedly, without forced effort. This natural recollection extends to the Dharma and Sangha as well, establishing a firm foundation in the Three Jewels that strengthens one's entire spiritual practice.",
    "When mindfulness stands guard at the doorway of the mind for the purpose of protection, clear awareness then naturally arises. And even if this awareness departs, it will return again.",
    "First, I must vigilantly examine this mind of mine. Having recognized when it contains flaws or negative qualities, I should then remain like a piece of wood—steady and unmoved—maintaining firm control over myself.",
    "I will never engage in purposeless, wandering gazes. Instead, I shall always maintain a contemplative awareness, looking downward with mindful attention.",
    "To rest your gaze when it becomes fatigued, occasionally look around in different directions. If someone happens to appear in your field of vision, look at them and say, 'Welcome, it's good that you have come.'",
    "When traveling on roads or in potentially dangerous places, repeatedly scan all four directions to detect possible threats. Look carefully to each side after pausing to rest. Then turn around completely to examine what lies behind you.",
    "After carefully examining what lies ahead and behind,\nOne should decide whether to proceed or return.\nThus, in all circumstances of life,\nOne should act only after understanding the purpose.\n\n---\n\n**Modern English Translation:**\n\nOne should carefully examine what lies ahead and what remains behind before deciding whether to go forward or turn back. Similarly, in every situation one encounters, one should act only after clearly understanding the purpose of one's actions. This mindful approach should guide all activities, ensuring that one proceeds with awareness and proper discernment in everything one does.",
    "Having established the intention, 'I will position my body in this way,' and having restrained unnecessary physical activities, one should periodically examine: 'How exactly is my body positioned right now?'",
    " Translation of 'Taming the Mind-Elephant'\n\nWith utmost effort, one should ensure that the wild elephant of the mind remains securely bound to the great pillar of Dharma contemplation, never breaking free from its tether.\n\n---\n\n**Modern English Translation with Contextual Clarity:**\n\nThe intoxicated elephant of our mind must be carefully restrained. Through all possible efforts, ensure that this powerful but wild mental force remains firmly tethered to the strong pillar of Dharma contemplation. Just as one would secure a dangerous elephant so that it cannot escape and cause harm, likewise bind your mind to spiritual practice with such steadfastness that it cannot stray toward distractions or destructive impulses.",
    "I should constantly examine my mind, asking myself, 'Where is my mind wandering?' in such a way that I never let go of the purpose of concentration, not even for a single moment.\n\n---\n\n*Alternative rendering with more natural flow:*\n\nOne should continually ask: 'Where is my mind operating right now?' Through such mindful self-examination, never abandon the commitment to concentration, not even for an instant.",
    "When faced with dangers, festivals, or similar circumstances, if you cannot maintain all precepts, do what is appropriate for the situation. This is because it is taught that during times of giving, certain aspects of moral discipline may be temporarily set aside with equanimity.",
    "When you have considered a task and begun to undertake it, do not let your mind wander to other matters. With your attention firmly directed toward that purpose, first complete that very task before moving on.",
    "When following this approach, everything becomes well accomplished. Otherwise, neither aspect will be fulfilled. In this way, the secondary affliction of non-vigilance will not increase or proliferate.",
    "When various types of idle gossip arise,\nAnd many kinds of fascinating spectacles appear,\nIf you find yourself drawn to engage with all these things,\nYou should abandon your attachment to them.",
    "If you find yourself carelessly digging in the earth, cutting grass, drawing patterns on the ground, or engaging in other such purposeless activities, immediately recall the training precepts established by the Buddha. Then, with a healthy concern for the consequences, abandon such actions at once.",
    "When you feel the urge to move\nOr wish to speak words to others,\nFirst examine your own mind carefully,\nThen act with steady awareness and reason.",
    "When you notice your mind becoming attached to things or filled with anger, at such times, do not act upon these feelings, do not speak words driven by them, but remain still like a piece of wood.\n\nIn more detail: Whenever you observe your own mind becoming attracted to something desirable or wishing to express anger toward something unpleasant, that is precisely when you should refrain from taking any action based on these emotions. Do not allow your body to engage in activities motivated by attachment or aversion. Similarly, do not speak words that would give voice to or strengthen these afflictive states. Instead, maintain complete stillness—like a tree or piece of wood—unmoved and unswayed by the fluctuations of desire and hatred.",
    "When the mind becomes wild and prone to mockery, filled with pride and arrogance, or harbors the intention to expose others' faults—or when it seeks to reopen settled disputes or harbors deceitful thoughts—",
    "When you find yourself eager to praise your own qualities,\nOr when you are inclined to criticize others,\nOr when you engage in harsh speech and heated arguments—\nIn such moments, remain still like a piece of wood.",
    "If I find myself desiring wealth, honors, or fame, or if I seek to have an entourage of attendants, or if my mind longs for personal service and care from others—in all these cases, I should remain still like a piece of wood.",
    "When thoughts arise in my mind wishing to neglect others' welfare, or seeking only my own benefit, or desiring to speak unnecessarily, I should remain still like a piece of wood.\n\nWhen I notice my mind wanting to disregard the welfare of others, becoming preoccupied with my own interests, or feeling the urge to speak merely to gain attention or engage in idle talk, at that moment I should become like a log—completely still and restrained in body and speech—rather than acting on these self-centered impulses.",
    "When impatience arises in my mind, or when I feel lazy or afraid;\nWhen I'm inclined toward impulsive behavior or meaningless chatter;\nWhen attachment to my own side emerges in my thoughts—\nAt such times, I should remain still like a log.",
    "When you detect a mind thoroughly afflicted by disturbing emotions, or one engaged in meaningless pursuits, at that moment, like a warrior, you should firmly restrain it through the appropriate antidotes.",
    "With unwavering certainty and profound faith,\nWith steadfastness and respectful reverence,\nWith a sense of shame and healthy caution,\nWith peaceful demeanor and dedication to others' happiness.",
    "When confronted with the contradictory desires of childish beings, I will not become discouraged. Understanding that their minds are under the influence of afflictions, I will respond with compassion, thinking: 'This is simply how their minds have become.'",
    "In all blameless actions, I shall maintain this mind continuously—acting for the sake of myself and all sentient beings while remaining free from self-importance, like a magical emanation.",
    "After a long time, I have finally obtained this supreme opportunity, this precious moment of leisure. Repeatedly bringing this to mind again and again, I shall hold my consciousness unwavering like Mount Meru.",
    "When vultures, consumed by their craving for flesh, pull and drag this body in all directions, your mind feels no displeasure toward them. So why now do you fuss over and take such care of this body?",
    "Having claimed this body as your own, \nwhy do you, mind, strive to protect it?\nIf you and this body are truly separate entities,\nwhat purpose does it really serve for you?\n\nIn more natural English:\n\nWhy do you, mind, work so hard to protect this body after claiming it as your own? Since you and this body are fundamentally separate from each other, what real purpose does this body serve for you?",
    "O deluded mind, why do you not grasp at a clean wooden figure,\nYet protect this machine made of impurities,\nThis decaying apparatus—\nWhat purpose does guarding such rottenness serve?",
    "First, with your own discerning intelligence, separate this layer of skin as distinct from the rest of the body. Then, using the weapon of wisdom, carefully separate the flesh from the network of bones.",
    "Separate the bones into individual parts and examine them down to the marrow within. Ask yourself, 'What essence is there to be found in this?' Investigate this matter thoroughly for yourself.",
    "Having searched so diligently in this way, if you have found no essence within this body, why do you still continue to protect this body with such attachment?",
    "You should not consume the impurity of this body,\nNor is it proper to drink its blood.\nIf even the entrails are not to be sucked,\nWhat purpose does this body serve you?",
    "If this body must be protected, let it be reasonable—as future food for foxes and vultures. This human form has only one proper purpose: to be employed in service of virtue.",
    "Even though you diligently protect this body, when the merciless Lord of Death snatches it away and gives it to vultures and dogs, what will you be able to do then?\n\n*Alternative rendering with slightly more contemporary phrasing:*\n\nDespite how carefully you guard this body, when death—showing no mercy—seizes it from you and offers it to scavengers, what power will you have in that moment?",
    "If you wouldn't provide clothing and other necessities to a servant who cannot properly serve you, then why do you exhaust yourself caring for this body? After all, even though you nourish it, this body will eventually depart elsewhere when death comes.",
    "Having provided this body with its wages, now let it serve your own purpose. Do not give everything to it without receiving benefit in return.",
    "Regarding your body as nothing but a boat for traveling to and fro, transform it into a wish-fulfilling vessel to accomplish the welfare of all sentient beings.",
    "Having gained control over yourself in this way, always maintain a smiling countenance. Completely abandon frowning and contracted facial expressions. Be friendly and straightforward with all beings, speaking to them first.",
    "Do not carelessly drop chairs and other furniture with a loud noise. Do not forcefully fling open doors. Always take delight in humble, subdued conduct.",
    "Like the heron, the cat, and the thief, who move silently and stealthily to accomplish their desired aims, so should the sage consistently conduct themselves.\n\nIn more natural English:\n\nJust as the heron, cat, and thief move silently and stealthily to achieve their goals, so too should spiritual practitioners always conduct themselves. These creatures accomplish what they set out to do precisely because they move quietly and carefully, without disturbing their surroundings. Similarly, those who have taken the bodhisattva path should maintain mindful, gentle conduct in all their actions—moving with peaceful deportment, speaking softly, and behaving with humble consideration that brings comfort to others rather than disturbance. Through such mindful behavior in even the smallest actions, practitioners effectively accomplish beneficial purposes for themselves and others.",
    "When people are skilled at giving advice and admonishment, and offer helpful words without being asked, receive their guidance respectfully with your head bowed. Always position yourself as a student to everyone.",
    "When anyone speaks words of wisdom, one should readily express appreciation, saying, 'Well spoken!' Upon seeing someone performing meritorious actions, one should inspire them with genuine praise and encouragement.",
    "Speak about others' virtues when they are not present, and when someone praises another's good qualities, join in that praise with appreciation. When your own qualities are being discussed, recognize that the speaker possesses discernment of virtues.",
    "All endeavors are undertaken for the sake of happiness, yet such happiness is rare even when one tries to purchase it with wealth. Therefore, I should take delight in the virtuous qualities achieved by others, enjoying the bliss that comes from such appreciation.",
    "In cultivating joy for others' happiness, I incur no loss in this present life, while securing great happiness in the life to come. Conversely, negative emotions like jealousy and aversion bring unhappiness and suffering now, and lead to great suffering in future existences.",
    "When speaking, one should:\n\nSpeak in a manner that puts others at ease, with a natural flow and logical connection between ideas, so that your words are perceived as trustworthy and coherent.\n\nExpress yourself with clarity and precision, making your meaning readily apparent and pleasant to hear, which allows others to understand without doubt or confusion.\n\nSpeak free from the influences of attachment and aversion, avoiding partiality toward your own views or hostility toward opposing perspectives.\n\nCommunicate with gentleness and appropriate restraint, using a soft tone and speaking neither excessively nor insufficiently according to what the situation requires.",
    "When gazing upon sentient beings with your eyes, look at them with a straightforward and loving manner. Think to yourself: 'It is by relying upon these very beings that I will attain Buddhahood.' Look at them as if drinking them in with your eyes, with directness and loving kindness.",
    "Virtuous actions become greatly meritorious under four conditions: when performed consistently with unwavering dedication; when motivated by counteracting opposing tendencies; when directed toward those endowed with excellent qualities or those who have benefited you; and when offered to those who are suffering. \n\nIn more detail: Great virtue arises when actions are undertaken with steady, continuous commitment rather than occasionally; when they specifically counteract negative tendencies (like giving away what you most cherish to overcome attachment); when they benefit fields of excellence such as the Three Jewels or those who have helped you, like your parents; and when they alleviate the suffering of those in distress, such as the sick or impoverished.",
    "With skillfulness and enthusiasm, I should always personally perform all activities. In all my endeavors, I should never depend on others to do what I can do myself.",
    "The perfections, beginning with generosity, should be practiced with progressive refinement, each one becoming more excellent than the last. Do not abandon a greater virtue for the sake of a lesser one. Above all, consider the welfare of others.\n\n---\n\nIn clear prose:\n\nPractice the perfections—beginning with generosity and continuing through moral discipline and the others—with increasing excellence, recognizing that each subsequent perfection is more refined and profound than those preceding it. As a general principle, do not forsake a higher virtue to fulfill a lower one when you must choose between them. However, the paramount consideration should always be the welfare of others. In your spiritual practice, prioritize whatever brings the greatest benefit to sentient beings, as this is the essence of the bodhisattva path.",
    "Having understood these principles, one should remain constantly diligent in working for the welfare of others. For the compassionate one who sees far into the future, even actions that are normally prohibited become permitted when done for others' benefit.\n\nNatural English rendering:\n\nWith this understanding firmly established, one should always remain devoted to helping others with unwavering effort. The Buddha, with his great compassion and far-reaching wisdom, permits even normally forbidden actions when they are performed solely for the benefit of others. Alternatively, for bodhisattvas themselves who possess compassion and far-sighted wisdom, actions typically prohibited may be allowed when done exclusively to benefit sentient beings.",
    "Share your alms with those who have fallen into unfortunate states, those who lack protection, and those who maintain ascetic disciplines. Eat only in moderation, consuming just enough. Beyond the three essential Dharma robes, give away all other possessions.",
    "Do not harm your body, which is the vessel for practicing the sublime Dharma, for trivial purposes. If you care for your body in this way, you will quickly fulfill the aspirations of all sentient beings.",
    "One should not surrender this body when one's compassionate motivation is still impure. However, by all means, one should give it—both in this life and in future lives—as a cause for accomplishing great purposes.",
    "Do not teach the Dharma to those who show disrespect. Do not teach to someone who, while not ill, has wrapped their head in a turban, carries an umbrella, holds a walking stick, bears weapons, or has covered their head.",
    "Do not teach profound and expansive teachings to those of limited capacity,\nAnd do not instruct women without men present.\nApproach all teachings, whether seemingly lesser or superior,\nWith equal reverence in all your practices.",
    "One should not guide a person who is a vessel for the profound Dharma toward lesser teachings. The essential practices should never be abandoned, nor should one mislead others by suggesting that merely reciting sūtras and mantras is sufficient for spiritual development.\n\nThose who have the capacity to understand the vast and profound teachings should not be directed toward spiritual paths of lesser scope. While engaging with the deepest aspects of the teachings, one must not forsake proper ethical conduct that forms the foundation of all practice. Furthermore, one should never deceive practitioners by implying that liberation can be achieved through the simple recitation of texts or mantras while neglecting comprehensive spiritual training and ethical behavior.",
    "When disposing of tooth-cleaning sticks and spittle, one should cover them properly. It is condemned to discard urine and other bodily waste in water that people use or on pathways that people traverse.",
    "When eating, do not overfill your mouth or make noises while chewing. Do not eat with your mouth gaping open. Avoid sitting with your legs stretched out in front of you, and do not rub both hands together simultaneously when washing them.",
    "One should never share a vehicle, sleeping place, or seat alone with another's wife or woman. Through direct observation and inquiry, avoid all actions that would cause worldly people to lose faith or become displeased.\n\n---\n\n Clear Modern English Translation\n\nWhen traveling in vehicles, resting in beds, sitting on seats, or staying in dwellings, one should never be alone with women who are not one's relatives. Through careful observation and by asking those who know better, one should recognize and avoid all behaviors that might cause ordinary people to lose faith or respect. Be mindful of how your conduct appears to others and abandon any actions that could diminish their trust in the teachings.",
    "One should not give directions by pointing with a finger. Rather, with a respectful attitude, use the entire right hand to indicate the way forward or provide any similar guidance.",
    "Do not use exaggerated hand movements. When making slight movements, signal your intention with an audible sound such as a finger snap or similar gesture. Otherwise, you will become unrestrained in your conduct.",
    "Like the Protector in his final rest, one should lie down in one's preferred direction. With clear awareness, hold the intention to rise quickly, firmly establishing this thought from the very beginning.",
    "Though the conduct of bodhisattvas is taught to be immeasurable, one should definitely engage in the practices that purify the mind for as long as necessary.",
    "Three times during the day and three times at night, one should recite the three-section practice. By relying on the Buddhas and the mind of enlightenment, the remaining transgressions will be pacified.",
    "Whether by your own choice or compelled by external circumstances, regardless of the situation you find yourself in or the activities you engage in, diligently train in whatever practices have been taught for that particular circumstance.",
    "There is nothing whatsoever that the children of the Conquerors should not learn. For the wise one who abides in this way, there is no action that does not become meritorious.",
    "Whether directly or indirectly, engage only in activities that benefit sentient beings and nothing else. For the sole purpose of helping these beings, dedicate all your efforts toward complete enlightenment.",
    "Never abandon a virtuous spiritual guide—one who is skilled in the teachings of the Great Vehicle and who embodies the supreme ethical conduct of a bodhisattva—even at the cost of your own life.",
    "From the life story of Glorious Śrīsaṃbhava, learn how to properly serve the spiritual teacher. This instruction, along with other teachings given by the Buddha, should be thoroughly understood by reading the sūtras.",
    " Translation from Tibetan\n\nThe teachings are revealed in the sutras; therefore, one should read the sutras. In particular, one should first examine the Space Essence Sutra, which clearly explains the root downfalls.\n\n---\n\n Translation from Sanskrit\n\nThe trainings are seen in the sutras; therefore, one should study the sutras. And in the Space Essence Sutra, one should examine the root downfalls.\n\n---\n\n Modern English Translation\n\nThe trainings of the bodhisattva path are clearly presented in the sutras, so one should diligently read and study these sacred texts. Among them, the Space Essence Sutra (Ākāśagarbha Sūtra) should be examined first, as it provides essential guidance on the fundamental ethical violations that practitioners must avoid.",
    "Since the Compendium of Training thoroughly explains the practices to be followed at all times, you should definitely study it again and again. \n\n*Alternative rendering:*\n\nYou should definitely read the Compendium of Training repeatedly, as it provides a comprehensive explanation of the conduct that should be constantly practiced.",
    "Alternatively, for now, one should study the Collection of Sūtras, a concise anthology compiled from all the sūtras. One should also make diligent effort to study the two works composed by the noble Nāgārjuna.",
    "Whatever is not prohibited by the teachings should be embraced as proper practice. Having understood the training, one should engage in it correctly to protect the minds of ordinary people in the world.",
    "The defining characteristic of introspective awareness, in essence, is this: repeatedly examining the states of both body and mind.",
    "I must practice these teachings with my body;\nWhat can be accomplished by merely speaking words?\nWill the sick be healed\nSimply by reading medical texts?",
    "This concludes the fifth chapter of The Introduction to the Bodhisattva's Way of Life, entitled 'Guarding Awareness.'"
  ],
  [
    "All the virtuous deeds one might accumulate over a thousand eons—acts of generosity, offerings to the Buddhas, and other good actions—can be destroyed by a single moment of anger.",
    "There is no evil as great as hatred,\nAnd no spiritual practice as powerful as patience.\nTherefore, one should diligently cultivate patience\nThrough various methods and approaches.",
    "When the thorn of hatred pierces the heart, the mind cannot find peace. One experiences neither joy nor happiness, cannot sleep, and loses all stability.",
    " Modern English Translation\n\nEven those who have received wealth and honors from a master, those who depend upon the master's kindness and generosity, will turn against and attempt to kill this same master when he becomes consumed by hatred and anger. \n\nThose who once benefited from their lord's patronage and relied on his favor will not hesitate to attack him when his nature becomes poisoned by wrath, forgetting all the kindness they've received. The master who indulges in anger, despite having shown generosity, transforms loyal subjects into enemies who seek his destruction.",
    "Even close friends become weary of an angry person. Though they may be attracted by gifts and generosity, they will not remain in their company. In short, there is absolutely no one who can dwell in happiness while harboring anger.",
    "The enemy of anger brings about these and other sufferings. \nWhoever diligently overcomes anger \nWill find happiness both in this life and the next.",
    "When others harm me by doing what I don't want and obstruct what I desire, my mind becomes unhappy. Fed by this mental distress, anger grows powerful and ultimately destroys me.",
    "Therefore, I will thoroughly destroy the nourishment of this enemy. After all, this adversary—anger—has no other purpose than to harm me.",
    "Whatever circumstances may arise, I will not disturb my joyful mind. Even if I become unhappy, my wishes will not be fulfilled through that unhappiness, and instead, my virtuous qualities will deteriorate.",
    "If a situation can be remedied,\nWhy feel distressed about it?\nIf a situation cannot be remedied,\nWhat use is there in being upset about it?\n\nIn more natural English prose:\n\nIf a problem has a solution, why waste energy feeling distressed about it? There's no reason for displeasure when the issue can be fixed. And if a problem has no solution and cannot be changed, what purpose does your unhappiness serve? Being upset about something immutable brings no benefit whatsoever.",
    "For myself and those I hold dear, I do not desire suffering, contempt, harsh words, or an unfavorable reputation. Yet for my enemies, I wish the opposite.",
    "Happiness arises from causes that occur only occasionally, while the causes of suffering are exceedingly numerous. Without experiencing suffering, there can be no genuine renunciation from the cycle of existence. Therefore, my mind, resolve to be steadfast.",
    "When devotees of Uma and people of Karnataka endure the painful sensations of burning and cutting their flesh without meaningful purpose, why should I be fearful? If they willingly accept such suffering for pointless aims, how much more should I be patient in pursuing the supreme goal of liberation? I should not be timid when my hardships serve the ultimate purpose of enlightenment.",
    "There is no phenomenon whatsoever that cannot become easier through practice. Therefore, by becoming accustomed to small hardships, learn to endure even great suffering.",
    "Why do you not perceive the pointless suffering caused by snake bites, fly stings, and mosquitoes, the discomfort of hunger and thirst, and the great distress of itching and similar afflictions?",
    "When confronted with heat and cold, rain and wind,\nIllness, imprisonment, and acts of violence,\nI should not be overly sensitive or delicate.\nFor if I respond this way, my suffering will only increase.",
    "Some people, upon seeing their own blood,\nDevelop even greater courage and steadfastness.\nWhile others, upon merely seeing another's blood,\nBecome frightened and may even faint.\n\n---\n\nIn more natural modern English:\n\nSome individuals become even braver and more resolute when they see their own blood flowing from wounds. In contrast, others become terrified and may completely lose consciousness at the mere sight of someone else's blood. This difference reveals how our reactions stem not from external circumstances but from our mental disposition and inner strength.",
    "This difference arises from the steadiness or timidity of the mind. Therefore, learn to disregard harm and remain unaffected by suffering.\n\nSuch contrasting reactions stem entirely from whether one's mind is firm and steadfast or fearful and hesitant. For this reason, train yourself to treat harmful situations with indifference and to become impervious to suffering of all kinds.",
    "The wise, even when suffering arises,\nShould not disturb the clarity and serenity of their mind.\nFor in the battle against mental afflictions,\nMany wounds are sustained during combat.\n\nIn more natural contemporary English:\n\nEven when faced with suffering, those who are wise maintain their mental clarity and inner peace. They recognize that the struggle against negative emotions and afflictions is a genuine battle, and in such spiritual combat, one will inevitably experience many difficulties and pains. Just as a warrior expects wounds in battle, the spiritual practitioner accepts challenges as part of the path to overcoming inner obstacles.",
    "Those who endure all suffering and overcome enemies such as anger and other negative emotions—these are the true conquering heroes. All others merely kill what is already destined to die.",
    "Another virtue of suffering is that it dispels pride and arrogance through disillusionment. When we truly experience suffering, it naturally humbles us and removes our conceit. \n\nFurthermore, suffering awakens compassion for those trapped in the cycle of existence. When we face our own pain, we naturally develop empathy for others experiencing similar struggles.\n\nSuffering also instills caution regarding harmful actions. Recognizing the relationship between negative deeds and painful consequences, we become more vigilant about avoiding misconduct.\n\nFinally, suffering nurtures joy in virtue. Understanding that happiness arises from positive actions, we develop genuine delight in creating goodness and following the path of righteousness.",
    "I do not show anger toward bile and similar things,\nWhich are great sources of suffering,\nSo why be angry at beings with minds?\nThey too are all driven by conditions.",
    "Just as an illness arises\nEven against our wishes,\nSimilarly, despite our resistance,\nNegative emotions forcefully emerge.\n\n---\n\n Plain English Translation\n\nJust as diseases arise in our bodies against our will and despite our wishes, in the same way, afflictive emotions like anger emerge forcefully within our minds even when we don't want them to appear. Both illness and emotional afflictions come upon us involuntarily, driven by their own causes and conditions, regardless of our desire to avoid them.",
    "People become angry spontaneously, even without thinking 'I will become angry.' Similarly, anger arises naturally, even though no one consciously decides to generate it.",
    "Whatever faults may exist and the various kinds of harmful actions—all of these arise from the power of causes and conditions. They do not exist through their own independent nature.",
    "When various causes and conditions come together, they do not possess the thought, 'I shall produce an effect.' Likewise, that which is produced by these causes and conditions does not possess the thought, 'I have been produced by these causes.'",
    "That which some traditions acclaim as the primordial nature, and that which others conceptualize as the permanent self—neither of these could possibly arise with the deliberate thought, 'I shall come into being.' Such purposeful thinking cannot precede existence itself.",
    "If something truly has never arisen, then it does not exist at all—so who would desire for such a non-existent thing to come into being? Furthermore, if a permanent entity like the self were constantly engaged with objects of experience, it could never possibly cease its activity.",
    "If the self were permanent, \nit would clearly be devoid of any activity, just like space.\nEven when encountering various conditions,\nwhat function could something unchanging possibly perform?",
    "\nIf at the time of action something remains exactly as it was before, what effect has the action actually had upon it? How could one meaningfully declare, 'This is its action,' and what possible connection could exist between them? \n\nIn other words, if an entity (like a supposedly permanent self) remains completely unchanged even when acted upon, then no action has truly affected it. This calls into question any claim of relationship between such an unchangeable entity and the actions supposedly connected to it. What basis could there be for asserting that any particular action belongs to or affects something that remains perpetually the same?\n",
    "Everything is under the control of other factors;\nThose controlling factors themselves have no independent control.\nHaving understood this, one does not become angry\nAt any phenomenon, recognizing them all as being like magical emanations.",
    "If you object: 'Who is eliminating what? The very act of elimination is not reasonable,' I would reply: There is nothing unreasonable in accepting that suffering comes to an end by relying on antidotes.",
    "Therefore, whether you see an enemy or a friend acting improperly, think to yourself: 'This has arisen from such causes and conditions,' and with this balanced understanding, remain at ease.\n\n*Alternative rendering:*\n\nTherefore, when you observe either an enemy or a friend engaging in wrongful actions, reflect: 'This behavior stems from specific conditions acting upon them.' Contemplating in this way, maintain your equanimity and inner peace.",
    "If accomplishments were achieved merely through one's own wishes, then since no one desires suffering, not a single embodied being would ever experience any suffering whatsoever.",
    "Through heedlessness, people harm themselves with thorns and similar things. To obtain women and other desired objects, they become aggressive and even subject themselves to fasting and other austerities.",
    " Translation of Verse 36\n\nSome people harm themselves by hanging themselves or jumping from cliffs. Others consume poison or eat unwholesome food that damages their health. Many inflict harm upon themselves through non-virtuous conduct.\n\n Expanded Translation\n\nSome people, overcome by afflictive emotions, inflict harm upon themselves in various ways. Some resort to hanging themselves or leaping from precipices to end their lives. Others deliberately consume poison or eat food that is harmful to their health and well-being. Beyond these direct physical harms, many people damage themselves through non-virtuous actions and behaviors that, while seemingly beneficial in the moment, create suffering for themselves both in this life and in future lives.",
    "When people fall under the control of their disturbing emotions,\nThey will even harm and destroy themselves, whom they cherish.\nHow then could we expect such people\nTo refrain from harming the bodies of others?\n\nIn clearer prose:\n\nWhen people are completely dominated by disturbing emotions and afflictions, they will even harm and kill themselves—the very self they cherish and hold dear. If they are capable of such self-destruction, how could we possibly expect them to refrain from causing harm to others? Such harm to others is inevitable from those so overwhelmed by afflictions.",
    "When people are driven by afflictive emotions and engage in harmful activities such as hurting themselves, if I fail to generate compassion toward them, what possible justification could there be for becoming angry instead?\n\nIf someone is acting under the influence of mental afflictions, behaving like a person possessed, how can I reasonably respond with anger rather than compassion? Those overcome by negative emotions lack self-control when they harm themselves and others. If I cannot feel compassion for their condition, becoming angry with them is completely inappropriate and makes no sense at all.",
    "If it is in the very nature of childish people to harm others, then my anger toward them is inappropriate—just as it would be absurd to resent fire for its inherent nature to burn.",
    "Though these faults are temporary and adventitious,\nAnd sentient beings are gentle by their very nature,\nIt is still unreasonable to respond with anger—\nLike resenting the sky when smoke briefly pollutes it.",
    "If I become angry at the one who directs a stick or similar weapon against me, I should remember that this person too is driven by anger. Therefore, it is more reasonable for me to direct my anger toward anger itself.",
    "In previous lifetimes, I myself have inflicted this very same kind of harm upon other sentient beings. Therefore, it is only fitting that I now experience such suffering at the hands of those who harm sentient beings.",
    "Both the weapon of my attacker and my own body are equally causes of suffering. If that person draws their weapon against my body, at whom should I direct my anger?",
    "This body of mine, resembling a human form yet like a boil, \nIs exquisitely sensitive and filled with suffering.\nIf I, blinded by craving, have grasped onto it,\nAt whom should I be angry when it experiences harm?",
    "Foolish people do not want suffering, yet they eagerly pursue the very causes of suffering. When they experience harm due to their own mistakes, what sense is there in blaming others?",
    "Just as the guardians of hell realms and forests with razor-sharp leaves are manifestations of karma, so too are the harms that befall me created by my own actions. At whom, then, should I direct my anger?",
    "Provoked by my own karmic actions, those who harm me come into being. If by their harmful deeds these beings will descend to the hell realms, have I not essentially destroyed them myself?",
    "By relying upon these people who harm me, my many negative actions are purified through my patience. Yet because of their actions toward me, these same people will go to the hell realms where they will experience suffering for a very long time.",
    "I am the one who causes harm to others, while they actually bestow benefits upon me. Why then, corrupt mind, do you become angry in this completely backward way?",
    "If my mind possesses the qualities of patience,\nI will not descend into hell realms.\nIf I have protected myself through such practice,\nWhat benefit has this brought to those who harmed me?",
    "If I were to retaliate with harm in return, \nThose harmful people would remain unprotected,\nAnd my own spiritual conduct would deteriorate.\nThus, my practice of austerity would be destroyed.",
    "The mind, being formless, cannot be destroyed by anyone, anywhere. However, because of our intense attachment to the body, we experience suffering when our physical form is harmed.",
    "When others show contempt, speak harsh words,\nOr utter unpleasant remarks against you—\nIf these cause no harm to your physical body,\nWhy, mind, do you become so intensely angry?",
    "If others are displeased with me,\nBut their displeasure causes me no harm\nEither in this life or in future lives,\nWhy should I object to their attitude?",
    "If others obstruct my material gains through their disrespect, and I become angry about this, I should consider: even if I dislike this treatment, whatever possessions I might acquire will be abandoned here in this world when I die, while the negative karma from my anger will remain firmly established. \n\nIf I become angry when others undermine my reputation and cause me to lose material benefits, I must remember that all worldly possessions—however valuable—are temporary. At death, I will leave behind everything I've acquired, empty-handed. However, the harmful effects of any anger I generate will persist in my mindstream, following me beyond death until their consequences fully manifest. Therefore, it is far better to accept the loss of material gains than to harbor anger that creates lasting negative karma.",
    "Better for me to die today than to sustain a long life through dishonest means. Even if I were to live for many years, I would still face that same suffering of death in the end.",
    "One person dreams of experiencing happiness for a hundred years before awakening. Another experiences happiness for just a moment before awakening. \n\nWhen both awaken, their experiences are the same: the dream happiness, whether long or brief, has vanished completely. Neither the century of joy nor the momentary pleasure remains. Both dreamers face the same reality upon waking.",
    "For those who have awakened from sleep, \nThe happiness experienced does not return.\nSimilarly, for both the long-lived and short-lived,\nAt the moment of death, all ends the same way.",
    "Though I may acquire abundant wealth and enjoy pleasures for a long time, just like someone robbed by thieves, I will depart naked with empty hands.",
    " Translation\n\nIf I were to acquire wealth and sustain my life,\nI might think, 'I can purify my negative karma and create merit.'\nBut if I become angry in my pursuit of material gain,\nWouldn't my merit be exhausted and negativity increase instead?\n\n---\n\n Prose Translation\n\nIf I were to sustain my life through acquiring wealth, I might justify this by thinking, 'With these resources, I can purify my past negative actions and accumulate merit through virtuous deeds.' However, if I become angry at others who obstruct my pursuit of these material gains, wouldn't this anger actually deplete whatever merit I've accumulated and generate new negative karma? This reveals the self-defeating nature of becoming attached to wealth acquisition, even when justified with spiritual intentions.",
    "If the very purpose for which I live should deteriorate, what use is such a life that produces nothing but negativity?",
    "If you become angry at those who speak unpleasantly about you because they harm sentient beings by doing so, then why don't you similarly become angry at those who speak unpleasantly about others?",
    "If you can be patient with those who lack faith—since their lack of faith depends on external factors—then why not be equally patient with those who speak harshly to you? Their unpleasant speech likewise depends on afflictive emotions that have arisen within them and over which they have little control.",
    "Even toward those who mock and destroy Buddha images, stupas, and sacred texts, it is inappropriate for me to feel anger, because the Buddha and other awakened beings cannot truly be harmed.\n\nI should not harbor hatred toward those who disrespect or damage sacred representations of the enlightened path. These physical forms—statues, memorial structures, and dharma teachings—may be desecrated, but the actual Buddha and enlightened beings remain beyond the reach of any harm. Understanding this truth, I should respond with compassion rather than anger when witnessing such actions.",
    "When those who harm your spiritual teachers, relatives, and loved ones, as well as friends, provoke your anger, recognize that they too are transformed by conditions, just as explained previously. Seeing this causal process at work, dispel your anger toward them.",
    "When embodied beings experience harm, it comes from both conscious beings and unconscious objects. If both can cause suffering, why single out and blame only those with consciousness? Therefore, practice patience toward all forms of harm.",
    "Some commit wrongs out of delusion,\nWhile others, equally confused, respond with anger.\nWho among them could be called blameless?\nAnd who should bear the fault?",
    "Why did I previously create the karma that now causes others to harm me?\nIf everything depends on the effects of our actions,\nWhy should I harbor resentment toward those who harm me?",
    "Having seen this truth clearly, I will diligently apply myself to meritorious actions, so that all beings may develop loving hearts toward one another.\n\n*Alternative rendering:*\n\nWith this understanding firmly in mind, I will strive earnestly in virtuous deeds, working toward the goal that everyone might cultivate mutual loving-kindness between themselves.",
    "Just as when a fire that has burned one house\nThen travels to another dwelling,\nWhere it spreads to grass and other materials—\nThese should be removed and discarded.",
    "Similarly, when your mind becomes attached to someone and the fire of anger flares up because of this attachment, immediately abandon that attachment out of concern that your accumulated merit will be burned away.",
    "If a person condemned to death has their hand cut off but is then set free, is this not beneficial? Similarly, if through human sufferings one is freed from the torments of hell, is this not advantageous?",
    "If I cannot endure even this much suffering in the present moment, then why do I not restrain my anger, which is the cause of the unbearable torments of hell?\n\nIn more natural contemporary English:\n\nIf I find it impossible to bear even this much pain right now, why then don't I make an effort to restrain my anger—the very thing that causes the far worse sufferings of hell realms?",
    "For the sake of desires, I have experienced being burned and suffering countless torments in the hell realms thousands of times. Yet through all this, I have neither accomplished my own purpose nor brought any benefit to others.",
    "This suffering is not that severe, and it will accomplish great purposes. Regarding the suffering that removes the harms of all beings, it is appropriate here to feel only joy.\n\nThis suffering is not so harmful, and it will accomplish significant aims. Therefore, when it comes to the suffering that relieves the afflictions of all beings, it is fitting to respond only with genuine delight.",
    "If others gain joy and happiness from praising someone with good qualities, why doesn't your mind also rejoice in the same way when you praise them?",
    "This joy and happiness you experience from praising others is a genuine source of bliss without any fault. It is approved by those who possess noble qualities, and stands as the supreme method for attracting others to the spiritual path.",
    "Furthermore, if you think, 'This will bring happiness to others,' yet do not desire such happiness for them—by refusing to pay wages, give rewards, and similar acts of generosity—you will lose both visible and invisible benefits.",
    "When your own good qualities are being praised,\nYou wish for others to feel happiness too.\nYet when others' good qualities are being praised,\nYou don't even wish happiness for yourself.",
    "Having generated the mind of enlightenment with the wish for all sentient beings to find happiness, why would you now become angry when these same beings experience happiness through their own means?",
    "You claim to desire that sentient beings attain Buddhahood, a state worthy of veneration throughout the three realms. Yet when you witness these same beings receiving even modest offerings or respect, why do you burn with jealousy toward them?\n\nIf you truly aspire for all beings to reach the enlightened state that deserves universal reverence, then how can you become tormented with envy when seeing them receive even the smallest honors? Such a reaction contradicts your own stated aspiration and vow.",
    "When someone you are obligated to support manages to support themselves, they are actually giving you the gift of relief from that duty. Yet when your dependent relative finds their own livelihood, instead of rejoicing, do you become angry?",
    "How can one who claims to desire enlightenment for sentient beings not wish for their basic welfare? If someone becomes angry seeing others' prosperity, how could they possibly possess the awakening mind?",
    "Whether someone else has obtained those possessions from the donor,\nOr those things have simply remained in the benefactor's home—\nIf in either case you yourself do not possess them,\nWhat difference does it make to you whether they were given or not?",
    "Why would you discard the sources of your good fortune—the merit you have accumulated, the faith others have in you, or your own positive qualities? Tell me, why would you not be angry at yourself when you fail to grasp the acquisitions that come your way?",
    "Not only do you fail to feel remorse for the harmful actions you yourself have committed, but you even desire to compete with others who have created merit. \n\n[End of the second volume.]",
    "Even if your enemy is unhappy,\nWhat pleasure should that bring you?\nYour mere wish for their suffering\nWill not become a cause of harm to them.",
    "Even if you achieve the suffering you desire for your enemy, what joy does it really bring you? And if you claim, 'It fulfills my wishes and brings satisfaction,' what could be more destructive than harboring such hostility?",
    "This hook of unbearable malice, cast by the fishermen of afflictive emotions, is truly terrible. When caught by it, I will be seized by the guardians of hell who will boil me in their cauldrons.",
    "Praise, fame, and honors bestowed upon me \nWill not generate spiritual merit, nor lengthen my life.\nThey will not increase my strength, nor prevent illness,\nNor will they bring comfort or pleasure to my body.\n\n---\n\n*Prose translation:*\n\nNeither praise, fame, nor reverence directed toward me produces any spiritual merit or extends my lifespan. Such recognition does not increase my physical strength, protect me from illness, or bring any physical comfort or well-being to my body. These forms of worldly acknowledgment are ultimately without substantial benefit.",
    "If I truly understood what benefits me,\nWhat real advantage would I find in such things?\nIf all I desire is mere mental pleasure,\nThen I might as well indulge in gambling, alcohol, and the like.",
    "For the sake of fame, they squander their wealth and even destroy themselves. What purpose do such words of praise serve? When one is dead, who can find happiness in such acclaim?",
    "When a sand castle collapses,\nChildren cry out in distress.\nSimilarly, when praise and fame diminish,\nOne's mind behaves just like a child.",
    "Sound itself has no mind, and therefore cannot possibly think, 'I shall praise this person.' When people say, 'Others are pleased with me,' is that truly a cause for one's own joy?",
    "Whether the praise is directed toward others or toward myself, what benefit do I actually gain from someone else's joy? Their happiness and delight belong entirely to them alone. I cannot obtain even the slightest portion of that joy.",
    "If I find joy in their happiness,\nThen shouldn't I feel the same for all beings?\nWhy then, when others receive praise\nAnd become happy, am I not happy as well?",
    "Therefore, when you think 'I am being praised' and feel joy arise within yourself, this reaction, upon examination, is completely irrational—it is nothing more than childish behavior.",
    "Praise and flattery lead me into distraction,\nAnd destroy any sense of disillusionment with worldly existence.\nThey breed jealousy toward those who possess genuine qualities,\nAnd ultimately destroy my own prosperity and excellence.",
    "Therefore, those who stand ready to destroy my praise and honors—are they not actually engaged in protecting me from falling into the lower realms?",
    "As one who seeks liberation, I have no need for the fetters of material gain and honor. How could I feel anger toward those who free me from such bondage?\n\nMore fully expressed: Since I am earnestly seeking spiritual freedom, the chains of wealth, fame, and reverence are unnecessary burdens for me. When others deprive me of these things—which are actually impediments to my spiritual goal—they are in fact liberating me from bindings. Therefore, how could I reasonably harbor anger toward them? They are inadvertently helping me achieve the very freedom I seek.",
    "When I desire to enter into suffering, those who become like doorways blocking my entry—just as if they were divinely appointed by the Buddha's blessing—how could I possibly be angry with them?",
    "If someone creates obstacles to my virtuous deeds,' it is inappropriate to become angry with them. Is there any spiritual practice equal to patience? Should I not, therefore, abide in patience at this very moment?",
    "If I, due to my own faults, fail to practice patience in this situation, I am merely creating an obstacle for myself when the cause of merit stands directly before me.",
    "If something cannot arise without a particular condition, and comes into existence when that condition is present, then that condition itself is its cause. How, then, could we call that condition an obstacle?",
    "A beggar who arrives at the proper time for giving \nDoes not create an obstacle to generosity.\nSimilarly, one who conducts an ordination\nShould not be considered an obstacle to entering the monastic life.",
    "In this world, those who ask for help are common,  \nBut those who cause harm are rare indeed.  \nFor if one has done no harm to others,  \nGenerally no one will cause harm in return.",
    "Like a treasure that has appeared in my home without any labor or effort on my part, my enemies serve as companions on my journey toward awakening. Therefore, I should rejoice in them.",
    "Since both this adversary and I have jointly accomplished this spiritual work, the fruits of patience that result should first be offered to them. This is entirely appropriate, as they are the primary cause of my patience.",
    "If you object, 'Since the enemy has no intention to help me develop patience, they are not worthy of veneration,' then consider this: why do we venerate the sublime Dharma? The Dharma serves as a cause for spiritual accomplishment, yet it too has no mind or intention.",
    "If I object, 'An enemy with harmful intentions should not be venerated,' then how could I develop patience? For if I only respect those who strive to help me, like a physician, how would my patience ever be cultivated?",
    "Therefore, since patience arises in dependence upon those with hostile intentions, those very enemies who provoke anger are the causes of patience. For this reason, they deserve to be honored just as one would honor the sublime Dharma.",
    "Therefore, the Sage taught that there are two fields: the field of sentient beings and the field of the Victorious Ones (Buddhas). By pleasing these two fields, many practitioners have reached the far shore of perfection.",
    "From both sentient beings and the Conquerors, \nThe qualities of Buddhahood are equally accomplished.\nWhy then do we show reverence to the Conquerors\nBut not likewise to sentient beings? What kind of approach is this?",
    "The greatness of intention is not measured by the intention itself, but rather by the results it produces. In this same way, sentient beings possess a comparable greatness. Therefore, they are equal to the Buddhas.",
    "The merit of honoring those who possess loving-kindness\nReflects the true greatness of sentient beings themselves.\nLikewise, the merit arising from devotion to the Buddha\nIs a manifestation of the Buddha's own greatness.",
    "All sentient beings possess the aspect of Buddha-dharma that can be accomplished;\nTherefore, in this respect, they are considered equal to the Victorious Ones.\nYet none can equal the Buddhas with their limitless oceans of qualities.",
    "When even a small fraction of qualities appears in someone who possesses just a portion of the unique collection of supreme qualities, offering the entire three realms to such a person for the purpose of veneration would still be considered insufficient.",
    "The seed of the supreme Buddha-dharma—the potential for awakening—exists within all sentient beings. For this reason alone, in proportion to this shared potential, sentient beings are worthy of veneration. \n\nSince all beings possess a portion of what gives rise to the highest qualities of enlightenment, they deserve the same reverence we offer to the Buddha. Though their qualities may not yet equal those of a Buddha, this fundamental potential for awakening makes them proper objects of respect and honor, just as the Buddha is honored.",
    "Furthermore, how can we ever repay those who have genuinely become our unwavering friends, those who have performed immeasurable acts of kindness for us? What higher recompense could there be apart from bringing joy to sentient beings?",
    "For their sake, the Enlightened One is willing to sacrifice his body and enter the unbearable Avīci hell. Since helping these beings is how we repay the kindness shown to us, even if these same beings cause us great harm, we should respond only with excellent and beneficial actions toward them.",
    "My own masters themselves, for the sake of others, remain utterly unconcerned even with their own bodies. Considering this, how could I, in my confusion, act with pride toward those same beings rather than adopting the role of a servant?\n\nEven the Buddha and bodhisattvas, who have become my true lords and guides, disregard their very bodies for the benefit of sentient beings. They serve selflessly without concern for their own well-being. Given this profound example, how inappropriate it would be for me—still deluded and confused—to feel superior toward the very beings that my masters cherish so deeply. Instead of maintaining such arrogance, I should fulfill the duties of a servant, humbly serving all beings just as my masters do.",
    "When sentient beings experience happiness, the great sages are delighted; when these beings suffer harm, the sages become displeased. By bringing joy to these beings, one pleases all the Lords of Sages. Conversely, to harm these beings is to harm the sages themselves.\n\nIn expanded prose:\n\nThe Buddhas and great sages find delight when sentient beings experience happiness and well-being. Conversely, when these same beings suffer harm or distress, the sages' hearts become troubled with concern. Therefore, by bringing joy and benefit to sentient beings, one effectively pleases all the Lords of Sages—this becomes the supreme offering to the Buddhas. However, if one causes harm to these beings, it is exactly equivalent to causing harm to the great sages themselves, as though directly obstructing their deepest wishes.",
    "Just as a person whose body is completely engulfed in flames\nCannot find any mental happiness even when offered all desirable objects,\nSimilarly, when sentient beings are harmed,\nThere is absolutely no means by which those of great compassion can be pleased.",
    "Therefore, I now openly confess each and every harmful action I have committed against living beings, actions which have displeased all the greatly compassionate ones. For whatever displeasure I have caused, I humbly request the forbearance of the Sage Buddhas.\n\nIn recognizing the ways I have harmed sentient beings, I acknowledge that these actions have disturbed the hearts of all those with great compassion. Today, I individually confess each of these wrongdoings without concealment. For all the ways I have acted contrary to your wishes, I ask for your patience and forgiveness.",
    "To delight the Thus-Gone Ones, from this day forward,\nI firmly pledge myself as a servant to the world.\nShould multitudes trample upon my head with their feet,\nOr even kill me, I shall not retaliate—may the Protector of the World be pleased.",
    "The compassionate ones have made all beings in this world their own—of this there can be no doubt. These very beings we perceive in the form of sentient creatures are, in reality, the essence of those protectors themselves. Why, then, would we not show reverence to them?",
    "This very act is what truly pleases the Tathagatas (the Buddhas).\nThis same practice is what genuinely accomplishes one's own purpose.\nThis alone is what dispels the suffering of all beings in the world.\nTherefore, I shall always commit myself to this practice.",
    "Just as a single royal official may oppress the common people, those with farsightedness, though capable, do not retaliate with harm.",
    " Translation of Tibetan Buddhist Text\n\nRemember that a ruler's power never stands alone;\nThe king's might serves as their true strength and army.\nLikewise, never disregard those who cause harm\nThough they may appear weak or insignificant.\n\n Explanatory Translation\n\nRemember that a person in a position of power does not operate in isolation. Their actual strength comes not from themselves alone but from the king's power and all the forces that stand behind them. Similarly, you should never dismiss or underestimate anyone who causes harm, regardless of how weak or insignificant they might seem. Even the seemingly weakest wrongdoer exists within a larger system of karmic accountability and is connected to powerful forces beyond what is immediately apparent.",
    "Both the guardians of hell and the compassionate ones are forces to be reckoned with. Therefore, one should please all sentient beings, just as subjects would appease a wrathful king.",
    "What harm can even an angry king inflict that compares to the torments of hell—those sufferings that one must endure as a result of causing distress to sentient beings?",
    "Even if a king were completely pleased with you, \nhe could never grant what you would gain\nby bringing joy to sentient beings—\nthe state of Buddhahood itself.",
    "Setting aside the future attainment of Buddhahood that comes from pleasing sentient beings—why do you not recognize that even in this very life, great prosperity, fame, and happiness arise from such actions?",
    "Through patience while wandering in the cycle of existence, one attains an attractive appearance and health. One gains fame and an extremely long life, ultimately obtaining the abundant happiness of a universal monarch.",
    "Thus concludes the sixth chapter entitled 'The Perfection of Patience.'\n\n---\n\n*From 'Entering the Bodhisattva's Way of Life,' this is the sixth chapter, entitled 'The Teaching on Patience.'*"
  ],
  [
    "Having thus cultivated patience, one should apply oneself to diligence. For it is in diligent effort that awakening truly resides. Just as there can be no movement without wind, no virtue can arise without diligence.",
    " Translation of Verses on Diligence and Laziness\n\nWhat is diligence? It is enthusiasm directed toward virtue.\n\nI will now explain its opposing factors. \n\nLaziness consists of attachment to harmful activities, discouragement, and self-deprecation.",
    "From savoring the pleasure of idleness and developing craving that clings to sleep, combined with not feeling weary of the sufferings of cyclic existence, laziness will certainly arise.",
    "Ensnared by the net of afflictions, you have fallen into the trap of rebirth. You now stand in the very jaws of death. How is it that you still fail to recognize this reality?",
    "Do you not see how your own companions are gradually being put to death? Yet you still rely on sleep, just like a buffalo awaiting slaughter by an outcast butcher.",
    "With all escape routes blocked and Death himself watching intently, how can you take pleasure in eating? How can you sleep so contentedly? How can you find such delight in worldly pleasures?",
    "Since death will swiftly come,\nFor as long as possible, gather your provisions.\nEven if you abandon laziness at that moment,\nWhat can you accomplish when it is too late?",
    "This remains unfinished, merely begun,\nAnd this one stands only half-completed.\nWhen death suddenly arrives,\nI will think, 'Alas, I am ruined!'",
    "With faces swollen from the force of grief, tears streaming from reddened eyes, one observes hopeless relatives and the faces of Death's messengers.",
    "When you are tormented by memories of your own harmful deeds and hear the terrifying sounds of hell realms, what will you do when you become disoriented with fear, your body soiled with filth?\n\nIn that moment—when the recollection of your negative actions brings you anguish, when you hear the horrifying cries of those suffering in the hell realms, when terror makes you lose control of your bodily functions, and when your mind becomes completely bewildered—you will find yourself utterly helpless. What possible recourse will you have then?",
    "If you tremble with fear even in this life—just like a fish writhing out of water—then what need is there to mention the unbearable sufferings of the hell realms that await one who has committed negative actions?",
    "When touched by hot water, your delicate, youthful skin becomes painfully scalded. Yet after committing actions that will lead you to the hell realms, why do you remain so complacently at ease?",
    "Alas! How pitiful are those who desire results without making any effort, those delicate souls who suffer greatly from the slightest hardship. Though already in death's grasp, they behave as if immortal like gods, only to be crushed by suffering.",
    "Having obtained this human vessel,\nCross over the great river of suffering.\nThis boat will be difficult to find again,\nSo, deluded one, do not sleep through this precious time.",
    "Why, having abandoned the supreme joy of the sublime Dharma—which is a limitless source of happiness—do you delight in distractions caused by sources of suffering, in frivolity and such things?",
    "Without discouragement, gather your forces,\nDiligently practice and master yourself,\nEqualize yourself with others,\nAnd exchange yourself for others.",
    "Do not become discouraged, thinking, 'How could someone like me ever achieve enlightenment?' For the Tathagata, who speaks only truth, has proclaimed this truth: everyone has the capacity to attain awakening.",
    " Translation\n\n'Even those who were mosquitoes, flies, bees, and various types of worms—if they generate the power of diligence, they too can attain the supreme enlightenment that is otherwise difficult to achieve.'\n\n Expanded Translation with Context\n\n'Even the smallest creatures—mosquitoes, flies, bees, and various types of worms—can attain the supreme, difficult-to-achieve enlightenment if they generate the power of diligence. If such seemingly insignificant beings can accomplish this through persistent effort, how much more so can humans who possess more favorable conditions for spiritual practice.'",
    "Since I am born as a human being with the capacity for discernment,\nAnd can clearly distinguish between what is beneficial and harmful,\nIf I do not abandon the path of awakening,\nWhy would I not attain enlightenment?",
    "But if I worry, 'I must give away my hands, feet, and other body parts,' then I am simply afraid due to confusion, having failed to discern what is truly significant from what is not.",
    "For countless billions of eons, I have been repeatedly cut into pieces, stabbed, burned, and slashed open innumerable times—yet through all this, I have not attained enlightenment.",
    "The suffering I endure for the sake of achieving awakening is limited in measure. It resembles the pain of having a wound made on the body in order to remove a harmful embedded thorn and eliminate deeper suffering.",
    "All physicians heal disease through treatments that cause discomfort. Similarly, one should endure minor hardships to overcome greater suffering.",
    " Translation of the Buddhist Verse\n\nThe Supreme Physician does not employ such ordinary medical treatments. Instead, through extremely gentle methods, he heals immeasurable grave afflictions.\n\n Expanded Translation\n\nThe Supreme Physician, the Buddha, does not resort to crude medical treatments like those of common healers. Unlike practitioners of conventional medicine who might use painful procedures such as bloodletting or cauterization, the Buddha employs extraordinarily gentle methods. Through this compassionate middle way approach—avoiding both harsh austerities and indulgence—he effectively cures countless serious diseases of the mind, including the fundamental afflictions that keep beings trapped in the cycle of suffering.",
    "At first, the Guide encourages practitioners to begin simply with giving vegetables and other modest offerings. By practicing this regularly, they become accustomed to giving. Later, through this gradual development, they eventually reach a point where they can even give away their own flesh.",
    "When one comes to view one's own body  \nAs casually as vegetables and other common things,  \nWhat difficulty could there possibly be  \nIn giving away one's flesh and other parts?",
    "Those who have abandoned negative actions are free from suffering,\nAnd those who have attained wisdom experience no mental distress.\nThis is because it is mistaken conceptualization\nAnd harmful actions that afflict both mind and body.\n\nThe bodhisattva who has completely abandoned negative actions experiences no physical suffering. Having cultivated wisdom and understanding the true nature of reality, they are free from mental distress and unhappiness. This freedom from both physical and mental suffering occurs because ordinary beings suffer precisely due to two causes: their mistaken conceptualizations—especially the incorrect belief in an inherent self where there is none—and the harmful actions they commit. These two factors are what actually afflict both mind and body, generating the experience of suffering. The bodhisattva, having transcended these causes, can remain engaged in the world without being affected by its troubles.",
    "Through the power of merit, the body finds comfort and ease;\nThrough wisdom, the mind experiences happiness and joy.\nThough they remain in the cycle of existence for others' benefit,\nWhy would those with compassion ever grow weary?",
    "Through the power of the awakening mind, one exhausts previous negative actions while gathering vast oceans of merit. For these reasons, those who develop bodhicitta are taught to be superior to the hearers on the spiritual path.",
    "Therefore, mounted upon the steed of bodhicitta—the awakening mind that dispels all weariness and fatigue—who with awareness would ever become discouraged? Proceeding from one state of happiness to even greater happiness, what person who understands the mind would ever lose heart?",
    "To accomplish the welfare of sentient beings, four powers serve as one's forces: aspiration, steadfastness, joy, and relinquishment. Aspiration should be cultivated by contemplating both the fears of suffering and the benefits that result from this aspiration.",
    "Having thus uprooted the opposing forces, one should strive to increase diligence through the powers of devotional aspiration, steadfast confidence, joyful engagement, and appropriate abandonment, while maintaining mastery over one's practice.",
    "I must overcome the immeasurable faults in both myself and others. This tremendous task falls to me—to conquer countless flaws and afflictions. For each single fault that must be eliminated, oceans of eons would be exhausted in the process.",
    "When I examine myself, I do not see even the slightest effort toward eliminating my faults—a task I once committed to undertake. Given this failure that condemns me to immeasurable suffering, why does my heart not shatter? How can I remain so unmoved when faced with this terrible reality?",
    "I must cultivate numerous qualities and virtues for both myself and others. For each single quality, would even oceans of eons be enough to fully master it?",
    "Despite having attained this precious human life, I have never cultivated even the slightest measure of excellent qualities. How astonishing and lamentable that I have somehow obtained this rare and marvelous birth, yet have wasted it completely without purpose.\n\nI have not developed any familiarity with even a fraction of the virtuous qualities necessary for enlightenment—qualities that require consistent practice over immense periods of time. Though I should be developing the numerous spiritual qualities required for both my own and others' liberation, I have failed to establish any habitual practice. This human birth with all its freedoms and advantages is extraordinarily difficult to obtain, yet somehow I acquired it through the power of past karma. How remarkable and tragic that I have squandered such a precious opportunity without accomplishing anything meaningful for this or future lives.",
    "I have not made offerings to the Blessed One, nor have I provided the joy of grand celebrations. I have not worked to support the teachings, and I have failed to fulfill the wishes of the poor.",
    "If I have not offered fearlessness to those who are afraid, and have not given comfort to those who suffer, then my birth has only caused pain in my mother's womb and produced nothing but suffering.",
    "Both in my previous lives and now in this present existence, I have become destitute in this way because I lacked genuine conviction in the Dharma. What sensible person would ever abandon their dedication to the Dharma?",
    "The Buddha taught that aspiration is the root of all virtuous qualities. And the root of this aspiration itself is continuous meditation on the ripening effects of actions.",
    "Physical suffering and mental distress, various forms of fear, and separation from what one desires—all these arise from engaging in harmful actions.",
    " Translation\n\nWherever those who perform virtuous actions with pure intention travel, they are honored with the rewards that naturally bloom from their merit. In each place they go, the fruits of their goodness manifest as offerings that celebrate their presence.",
    "Though those who commit evil actions desire happiness, wherever they go, in those very places they are struck down by the weapons of suffering that arise from their own misdeeds.",
    "Through virtuous deeds, one becomes a child of the Buddhas, dwelling in their presence. These fortunate beings reside within the hearts of spacious, fragrant, and cool lotus flowers. Their radiance develops through consuming the nectar of the Buddha's sweet voice as nourishment. They possess sublime bodies that emerge from lotus blossoms opened by the light rays of the Sage.",
    "With skin completely flayed by the servants of the Lord of Death, one becomes utterly tormented in agony. Molten copper, liquefied by intensely hot fires, is poured over the raw body. The flesh is struck with blazing swords and spears, cutting it into hundreds of scattered pieces. Due to numerous unwholesome deeds, one falls repeatedly onto the ground of intensely burning iron.",
    "Therefore, cultivate aspiration toward virtue and meditate with sincere devotion. Following the ritual method of the Vajra Banner, begin by developing dignified confidence.",
    "First, carefully assess your capabilities and resources. Then make a clear decision: either undertake the task or refrain from it entirely. It is better not to begin at all than to start something and abandon it before completion. Once you have committed to a course of action, never turn back.",
    "In future lives, this habit will persist, causing both negative karma and suffering to increase. Moreover, other tasks you undertake will yield diminished results, with their fruition becoming inferior—and even these lesser endeavors will remain unfulfilled.",
    " Verse on Courageous Determination\n\nRegarding actions, mental afflictions, and one's own capabilities—in these three domains, one should cultivate courageous determination. Thinking, 'I alone must accomplish this,' is what constitutes the proper pride in action.",
    "People in this world, powerless under the control of their afflictions, are unable to accomplish even their own goals. Unlike me, sentient beings lack the capacity for effective action. Therefore, I must take on this responsibility myself.\n\n*Alternative rendering with greater contextual clarity:*\n\nPeople in this world are helplessly controlled by their mental afflictions, leaving them unable to accomplish even what would benefit themselves. Since other beings cannot act effectively as I can, I must therefore take up this responsibility—to work for the welfare of all.",
    "When others are engaged in humble work,\nHow can I remain idle?\nIf I refrain from helping due to pride,\nIt is far better that my pride be destroyed.\n\n**Modern English Translation:**\n\nWhen I see others engaged in humble tasks, I should ask myself: How can I just stand by without helping? If I refrain from assisting them merely out of a sense of superiority, then it would be better for me to abandon such pride altogether. Freedom from arrogance is truly the superior state.",
    "When encountering a dead snake, even a crow behaves like a Garuda, the mighty divine eagle. Similarly, if I become weak in my spiritual resolve, even minor transgressions can cause great harm.",
    "For those who, in dejection, have abandoned all effort, is there any possibility of deliverance from suffering? But one who rises with determination and acts with confident perseverance cannot be overcome even by great adversities.",
    "Therefore, with a steadfast mind, I must overcome all downfalls. If I am defeated by these downfalls, my aspiration to conquer the three realms will become nothing but a laughable matter.",
    "I must conquer all, but none should conquer me.\nThis is the confidence I must maintain,\nFor I am a child of the Victorious Lion.",
    "Those beings who have been conquered by pride are actually afflicted, yet they do not possess true noble pride. One who has authentic noble pride does not fall under the control of enemies, while those others fall under the control of pride itself, which has become their enemy.",
    "Filled with the affliction of pride, one is led by this same pride to lower realms of existence. Even when born as a human, one's celebrations and joys are destroyed. Such a person becomes a servant dependent on others' food, as well as foolish, physically unattractive, and weak.",
    "Universally despised are those ascetics inflated with pride. If even these proud spiritual practitioners are counted among the arrogant, what can be said of the truly wretched? How much more pathetic must their condition be?",
    " Translation of the Tibetan Buddhist Verse\n\nThose who embrace pride to conquer the enemy of pride—they alone are truly proud in the worthy sense and genuinely victorious heroes. They who definitively defeat even the stirring enemy of pride and fulfill the fruits of victory for all beings according to their wishes.\n\nIn more natural English:\n\nThe true possessors of noble pride, the genuinely victorious heroes, are those who maintain a sense of confidence precisely to overcome the enemy of harmful pride. These spiritual warriors completely vanquish even the most active manifestations of ego-based pride, and thereby fulfill the perfect fruit of victory for all beings in accordance with their deepest aspirations.",
    "When dwelling amid conditions that trigger negative emotions,\nOne should be resilient in a thousand ways,\nLike a lion among foxes and lesser predators,\nRemaining unaffected by the host of afflictions.",
    "Even in the face of great dangers and hardships, just as people instinctively protect their eyes, likewise, when confronted with adversity, one should never fall under the power of negative emotions.",
    "I would rather be burned and killed,  \nOr even have my head cut off—  \nYet in no way will I bow down  \nTo the enemy of mental afflictions.  \nSimilarly, in all circumstances,  \nI will practice only what is reasonable.",
    "Just as a child delights in the pleasure of play, so too should one become devoted to whatever virtuous actions are to be done. One should become attached to these activities, never feeling satisfied with them, yet taking continual joy in their performance.",
    "Though actions are performed for happiness,\nWhether they will bring joy remains uncertain.\nFor those whose actions themselves become happiness,\nHow can they find joy without performing such deeds?\n\nIn modern English prose:\n\nActions are commonly undertaken with the hope of attaining happiness, yet there is no guarantee that these efforts will actually result in the joy we seek. The truly wise understand that certain actions—virtuous deeds themselves—are inherently joyful by their very nature. For such people, the performance of these virtuous actions is happiness itself. How, then, could someone experience genuine happiness without engaging in these intrinsically joyful actions? True contentment cannot be found by avoiding the very deeds that constitute happiness in their essence.",
    "If one cannot be satisfied by sensual pleasures—like honey placed on a razor's edge—how much more insatiable should one be for merit, which ripens into both happiness and the peace of liberation?",
    "Therefore, even after completing one task, immerse yourself in that same activity again—just as an elephant, scorched by the midday heat, plunges into a lake upon finding it.",
    "When your strength is depleted and you're exhausted, temporarily set aside your practice with the intention of resuming it later. Even when you've successfully completed a practice, abandon it out of desire for progressively higher achievements that follow.",
    "Like a veteran warrior engaged in close combat with an enemy on the battlefield, when swords clash in the heat of battle, you must skillfully evade the weapons of afflictions while simultaneously striking down the enemies of your mind.\n\nJust as an experienced fighter must both defend against an opponent's attacks and launch effective counterstrikes, you should protect yourself from being wounded by mental afflictions while actively uprooting these harmful states at their very foundation. This vigilant approach—combining defensive awareness with offensive determination—is how one engages in the inner battle against the forces that obstruct spiritual progress.",
    "Just as one who is frightened in battle would quickly retrieve a fallen sword, likewise, when the weapon of mindfulness is lost, swiftly reclaim it by recalling the terrors of the hell realms.",
    "Just as poison, having entered the bloodstream, spreads throughout the entire body, so too do negative emotions, when they find an opening, pervade the mind completely.",
    " The Oil-Bearer's Vigilance\n\nLike one who bears a vessel filled with mustard oil,\nWhile guarded by a swordsman standing close at hand,\nWho fears for life should even a single drop be spilled—\nSo should the disciplined practitioner maintain such vigilance.",
    "Therefore, just as one would quickly leap up when a snake appears in one's lap, similarly, when drowsiness and lethargy arise, one should swiftly dispel them.",
    "For each individual fault that arises, I should thoroughly reproach myself and reflect at length: 'How can I act to ensure this never happens to me again?'",
    "'How can I develop consistent mindfulness in these various situations?' With this motivation in mind, one should seek either to meet with qualified spiritual teachers or to engage in appropriate practices that accord with authentic instructions.",
    "Rise quickly to action, remembering the teachings on mindfulness. Just as one has the capacity to accomplish all tasks from their very beginning through the power of past actions.\n\n---\n\n Expanded Translation\n\nOne should rise with nimbleness to virtuous activity, keeping in mind the teachings on mindfulness and vigilance. This approach enables one to develop the capacity to effectively engage in all endeavors from their very outset, just as the momentum of previous actions provides the power and ability to function in all situations. By recalling the instructions on careful attention and diligence, one should approach spiritual practice with lightness and enthusiasm rather than heaviness or reluctance.",
    "Just as the wind commands absolute control over cotton,\nEffortlessly moving it forth and back at will,\nSimilarly, through joyful effort one gains mastery over oneself,\nAnd in this way, all spiritual accomplishments are fulfilled.",
    " Translation of 'Teaching on Diligence' (Chapter Seven)\n\nThis concludes the seventh chapter, entitled 'Teaching on Diligence,' from the text 'Engaging in the Bodhisattva's Conduct.'\n\n*[Sanskrit: 'This completes the seventh chapter called 'The Perfection of Diligence.'']* "
  ],
  [
    "After thus developing diligence, one should place the mind in meditative concentration. A person whose mind remains distracted dwells between the fangs of afflictive emotions.",
    "Through seclusion of both body and mind, distractions cannot arise. Therefore, abandon worldly entanglements and completely relinquish conceptual thinking.",
    "Due to emotional attachment and craving for things like material gain, people do not relinquish their worldly entanglements. Therefore, the wise person should completely abandon these attachments and carefully analyze their mind in the following manner.",
    "Understanding that the afflictive emotions can be thoroughly overcome through special insight that is fully supported by calm abiding, one should first seek to cultivate calm abiding. This calm abiding is accomplished through finding genuine joy in freedom from worldly attachments.",
    "How can any impermanent being reasonably form attachment to what is impermanent? One who cultivates such attachment will not encounter their beloved even across thousands of lifetimes.",
    "When one does not see the desired object, no joy arises. \nThe mind cannot settle in meditative concentration.\nEven upon seeing it, one never feels satisfied,\nAnd continues to burn with craving just as before.",
    "When attachment to sentient beings takes hold,\nIt completely obscures one from seeing ultimate reality.\nIt destroys any sense of renunciation in the mind,\nAnd finally leads to the torment of grief and sorrow.",
    "By merely obsessing over these matters, one's life passes without purpose or meaning. Through attachment to impermanent friends and companions, even the eternal Dharma that leads to liberation will be destroyed.",
    "If you associate with childish people and share in their ways, you will certainly fall into lower realms of existence. When they lead you along incompatible paths, what purpose is there in keeping company with such foolish individuals?",
    "In an instant, people can become friends, yet in a mere moment, they can turn into enemies. Since they grow angry at what should bring them joy, ordinary people are difficult to please.",
    "When I offer beneficial advice, they respond with anger. \nThey even try to dissuade me from pursuing what is beneficial.\nIf I do not listen to their discouragement,\nThey become angry and, as a result, head toward unfortunate rebirths.",
    "Towards those superior to oneself, jealousy arises;\nWith equals, one engages in rivalry and competition;\nTowards those below, one displays pride; when praised, one becomes arrogant;\nWhen faced with criticism, anger immediately flares up.\nWhen will one ever derive benefit from associating with childish people?",
    "When associating with immature people, negative consequences will inevitably arise. In their company, one finds oneself drawn into self-promotion and disparagement of others, as well as conversations that celebrate worldly life. These and other unwholesome behaviors will certainly emerge from such associations.",
    "Thus, associating with others only leads to ruin. Neither do they act for my benefit, nor will I serve their purposes.",
    "Keep your distance from childish people, avoiding them whenever possible. If you must meet them, interact pleasantly and make them feel welcome. However, do not develop deep familiarity with them. Instead, maintain a balanced, neutral demeanor, like an ordinary person who is neither overly friendly nor hostile.",
    "Like a bee gathering only honey from flowers, I will take just the essential meaning of the Dharma. I will move through all places as though encountering them for the first time, dwelling without forming attachments.",
    "If I become conceited thinking, 'I have acquired many possessions and honors, and many people are fond of me,' such pride will give rise to fear after death.",
    "Wherever the deluded mind becomes attached, captivated by pleasure and confusion, suffering a thousandfold greater will arise from those very attachments.",
    "Therefore, the wise should not become attached. From attachment arises fear. Since all things will naturally fall away, strengthen your mind and thoroughly examine this reality.\n\n---\n\n**Modern English Translation:**\n\nTherefore, a wise person should avoid becoming attached to worldly things. Attachment only gives rise to fear and anxiety. Since all objects of desire—wealth, reputation, and relationships—will inevitably be lost due to their impermanent nature, one should develop mental stability and thoroughly investigate this truth. By carefully examining the transient nature of all phenomena, one can recognize the futility of clinging to what cannot last, thereby freeing oneself from the suffering that attachment brings.",
    "Many acquired abundant possessions,\nAnd though they gained fame and acclaim,\nThese collections of wealth and renown provide no guidance\nAbout where one will go after death.",
    "When some people criticize me,\nWhy should I become happy when others praise me?\nWhen some people praise me,\nWhy should I become unhappy when others criticize me?",
    "Sentient beings have vastly different inclinations and interests. If even the fully enlightened Buddhas cannot please them all, how could someone ignorant like myself possibly do so? Therefore, I should simply abandon concern about worldly opinions.",
    "They criticize those who lack possessions and speak ill of those who have wealth. How could any joy possibly arise from such beings, who by their very nature are difficult to associate with?",
    "'Childish persons cannot be anyone's friend,' the Tathagatas have declared, 'because they are incapable of experiencing joy without self-interest.'",
    "In the forest, wild animals, birds, and trees never speak harsh or unpleasant words. When will I be fortunate enough to dwell together with these agreeable companions, whose presence brings such ease?",
    "Dwelling in an empty cave, an abandoned temple,  \nOr at the base of a tree,  \nWhen will I live without looking back,  \nFree from all attachment?",
    "When will I come to dwell in places that no one claims as their own—naturally spacious landscapes where I can move about freely without attachment, following my own path without hindrance?",
    "When will I come to dwell fearlessly, possessing only the simplest necessities like an alms bowl, wearing garments that no one would covet, and having no need to hide or protect this body?",
    "When will I go to the charnel ground and equalize my own body with the skeletal remains of others, recognizing that both are equally subject to the law of destruction?",
    "This very body of mine will inevitably become so foul that even jackals, drawn to carrion, will refuse to approach it because of its putrid stench.",
    "Even the flesh and bones of this single body, which arose together at birth, will disintegrate and go their separate ways. What need is there to mention other beloved people?\n\nThe very components of this one body—our flesh and bones that have been with us since birth—will inevitably decompose and scatter in different directions. If such intimate parts of our own physical form must separate, how much more certainly will we be parted from others whom we hold dear? \n\nThis body, though appearing as a unified whole, contains elements that were born together yet are destined to separate. When even the most intrinsic parts of ourselves cannot remain united, we should recognize that separation from friends and loved ones, whose connections are formed through temporary karmic conditions, is absolutely certain.",
    "Alone one comes into being at birth,\nAnd alone that same being faces death.\nSince others cannot take on one's portion of suffering,\nWhat purpose do cherished ones serve who only create obstacles?",
    "**Just as travelers on a journey take up temporary dwellings along their way, similarly, those who journey through the cycle of existence take up temporary residences in each new birth.**",
    "Before the four pallbearers have lifted the body from its place—while the world still grieves and laments all around—until that moment arrives, retreat to the forest.",
    "Without forming close friendships or harboring enmity,\nI dwell alone in solitude with just this body.\nHaving already considered myself as one who died long ago,\nWhen death actually comes, there will be no occasion for grief.",
    "When one dies in solitude, no companions stand nearby who might cause distress through their mourning or grief. Without anyone present who would weep at one's passing, one experiences no mental anguish from witnessing others' sorrow. Moreover, in such seclusion, no one will disturb or distract one's meditation on the Buddha and other virtuous practices at the crucial moment of death. In this way, one can depart peacefully while maintaining a clear and virtuous state of mind.",
    "Therefore, I shall dwell alone in delightful forests—\nvibrant and pleasing to the senses,\nwhere life requires little effort and brings contentment.\nThere, all distractions naturally subside.\n\nIn such solitude, I will make my home.",
    "Having abandoned all other thoughts, I will strive diligently with single-pointed attention on myself alone, for the dual purpose of establishing my mind in meditative equipoise and disciplining it.",
    "In both this world and the next, desires generate nothing but calamity. In this present life, they lead to being killed, imprisoned, and mutilated; in future lives, they cause rebirth in hell realms and other miserable states of existence.",
    "For whom, in the past, I sent many male and female messengers with joined palms in earnest supplication; for whom I did not hesitate to commit sinful acts or risk ill repute—",
    "Even when plunging myself into danger,\nAnd completely exhausting my wealth and possessions,\nThose very bodies I passionately embrace\nAnd from which I derive supreme pleasure—\n\nI willingly enter into dangerous situations and risk my well-being. I spend all my wealth and possessions to depletion. And for what? For these very bodies that I passionately embrace and cling to, mistakenly believing they provide me with supreme happiness and satisfaction.",
    "These are merely skeletons, nothing more—\nNot independent, not a self.\nWhy not proceed to liberation\nInstead of completely embracing them with intense desire?",
    "Though at first with great effort her face is lifted upward,\nYet drawn forward, she gazes downward from modesty.\nWhether her face was seen or not seen before,\nNow it becomes covered with a veil.\n\n---\n\nIn more natural prose:\n\nWhen first encountering intimacy, though someone makes an effort to lift her face and draw it forward, she looks downward out of modesty. This face—whether it had been seen by others before marriage or had remained hidden according to custom—is now covered with a veil. \n\n*[Note: This verse appears to be from a contemplative text on impermanence that contrasts the veiled face of a bride with its eventual fate, suggesting that the same face so carefully protected and desired in life will one day be covered differently in death—a subtle reminder of the transient nature of physical beauty and the futility of attachment.]*",
    "That face you once craved with such passion—\nSee how the vultures have now laid it bare,\nRevealing plainly what was once concealed.\nWhy do you flee from it now?",
    "Though others merely look with their eyes,\nWhatever you completely protected,\nAs long as it is being devoured,\nWhy do you, the possessive one, not protect it?",
    "Observing this heap of flesh being devoured by vultures and other creatures, why would you honor what is merely food for others with flower garlands, sandalwood paste, and ornaments?",
    "When you are frightened by a skeleton \nEven though it remains motionless,\nWhy would you not fear when the same bones\nAre animated like a reanimated corpse?",
    "If you feel desire for this body even when it is covered with clothes, then why wouldn't you desire it when it is uncovered? If you claim there is no purpose in an uncovered body, then why do you embrace it when it is covered?",
    "From a single source of food arise both feces and saliva. While you find feces repulsive, why then do you delight in saliva?",
    "The lustful, deluded about impurity, refuse to take pleasure in pillows of cotton that are soft to the touch. Instead, they claim, 'It does not ooze with foul odor,' clinging to what is actually unclean.\n\n---\n\n*Expanded translation for clarity:*\n\nThose consumed by desire, confused about what is truly impure, find no delight in pillows filled with cotton that offer a genuinely soft and pleasant touch. Instead, they become attached to the body, falsely reassuring themselves, 'It doesn't emit foul smells,' when they are merely deceived about what is fundamentally unclean. Such is the delusion of those overcome by lust, who mistake impurity for purity.",
    "The lustful, wicked, and deluded ones,\nUpon touching cotton and finding it soft,\nBecome angry at it, saying,\n'One cannot have sexual intercourse with this.'",
    "If you claim to have no attachment to what is impure, then why do you embrace another person in your arms? Why hold close this cage of bones fastened together with tendons, smeared with the mud of flesh? \n\nThis body you embrace is nothing but a skeletal frame bound by sinews, covered in the filthy paste of flesh. If you truly had no passion for impurity, you would not clutch such a thing to yourself.",
    "You yourself are full of numerous impurities,\nYet you constantly dwell contentedly with this very body.\nAnd toward other sacks of impurity as well,\nYou generate desire, greedily craving what is unclean.",
    "You claim 'I am fond of this flesh,' and you wish to touch and gaze upon it. Yet if the flesh is inherently without consciousness, why do you desire it?\n\nIf you truly desire flesh itself, as you claim, then why are you drawn to touch and look at only certain flesh? Since all flesh is by its very nature devoid of consciousness, your selective attraction reveals an inconsistency. The fact that you don't desire a corpse, which is also just flesh, demonstrates that your attraction is not actually to flesh itself. Your claim of desiring mere physical form contradicts your actual behavior of discriminating between living and dead flesh.",
    "The mind that you desire cannot be touched or seen,\nAnd what can be touched or seen is not consciousness.\nWhat purpose does this meaningless embrace serve?\n\nIn fuller prose:\n\nThe mind of desire that you long for cannot be physically touched or visually perceived. The actual consciousness that is the object of your attachment remains beyond physical reach or sight. Conversely, whatever you can touch or see—such as another person's body—is not the consciousness or mind that you claim to desire. There exists a fundamental disconnect between what you think you desire (another's mind) and what you actually engage with physically. Therefore, what purpose does this meaningless embracing of the physical form serve? This attachment brings no genuine benefit and is ultimately futile.",
    "It is not so surprising that you fail to recognize the impure nature of another's body.\nWhat is truly astonishing is that you do not recognize your own body's inherent impurity.",
    "Why would one who is attracted to impurity take delight in a cage of filth, having forsaken the young lotus flower that has opened to the cloudless sun's rays?\n\nWith a mind fixated on what is unclean, why be attracted to this vessel of impurities, while rejecting the fresh lotus blossom that unfolds in the sunlight of a clear sky?",
    "If you are unwilling to touch places stained with impure substances like dirt and excrement, then how can you desire to touch the body from which these impurities originate?",
    "If you truly have no attachment to impurity, why do you embrace another in your lap? This body emerged from an impure source—the womb—and was produced and developed from those impure seeds.",
    "You reject even the smallest worms born from impurity, finding them repulsive. Yet paradoxically, you desire the human body—which is itself composed of numerous impurities and likewise born from impure substances.",
    "Not only do you fail to feel disgust at your own inherent impurity, but you—a sack of filth yourself—greedily desire others who are equally impure receptacles.",
    "Even appealing substances like camphor and other pleasant things, as well as rice dishes and vegetables—when placed in the mouth, then taken out and discarded—make even clean ground impure and defiled.",
    "If you still have doubts about the impure nature of this body—even when its impurity is directly before your eyes—then go to the charnel grounds and observe other discarded corpses as well.",
    "When the skin is peeled away, revealing what lies beneath, great fear naturally arises. Yet how is it that, even knowing this truth, one still develops desire for that very same body?",
    "The fragrance applied to your body comes only from substances like sandalwood and nothing else. Why then do you become attached to others based on scents that actually belong to something entirely different?",
    "Since the body is naturally foul-smelling, wouldn't it be better not to be attached to it? Why do worldly people with meaningless desires anoint it with pleasant fragrances?\n\n---\n\n*Expanded Translation:*\n\nGiven that the body naturally possesses an unpleasant odor, wouldn't it be better to remain unattached to it rather than developing desire for it? Indeed, this would be the wiser course. Yet strangely, worldly people, driven by their pointless cravings, insist on applying sweet-smelling perfumes to it. Why do they attempt to disguise the body's inherent nature with borrowed fragrances that don't belong to it?",
    "What pleasing fragrance has actually come to reside in this body, even if it is sandalwood? Why does one become attached to another person merely because of a scent that belongs to something else entirely?",
    "If the body, with its long hair and nails, yellowish and stained teeth, and skin coated with filth and mud-like impurities, were to be seen in its natural state—naked and exposed—would it not appear truly terrifying?",
    "Why do people labor so diligently to groom and adorn this body, which harms them like a weapon turned against oneself? The entire earth is thrown into chaos by these madmen, frantically exerting themselves out of delusion about the self.",
    "When you see mere skeletons in a cremation ground, you feel revulsion. Yet isn't it strange how you delight in the village, which is itself a cremation ground filled with moving skeletons?",
    "Thus, this impure body cannot be obtained without a price. Pursuing it leads to exhaustion, and results in the torments of hell and similar realms.",
    "A child cannot acquire wealth,\nSo what happiness can be found when youth arrives?\nIf life is spent gathering possessions,\nWhat purpose do desires serve when old age comes?",
    "Some wretched slaves to desire,\nCompletely exhausted from laboring all day long,\nReturn home with depleted bodies,\nAnd lie down to sleep like corpses.",
    "Some people, afflicted by the hardships of distant journeys and burdened with the suffering of extended travel, are unable to see their children and spouses despite deeply longing for them—even after a full year has passed.",
    "Those who, deluded by their desires yet wishing to benefit themselves, sell their very being for some promised reward—they fail to obtain what they sought. Their lives, rendered meaningless, are driven by the winds of others' actions.",
    "Some people sell their own bodies and lose their freedom, becoming helpless servants forced to obey others' commands. Even when their wives become pregnant, they must give birth wherever they happen to find themselves—beneath trees or in wilderness areas—without proper shelter or security.\n\nIn this way, those who have sacrificed their autonomy for small wages find that even the natural joys of family formation bring no relief from their suffering. Lacking homes of their own, these families experience the harsh reality of their bondage, delivering their children in exposed and precarious locations, their vulnerability a testament to their complete loss of independence.",
    "Deluded by desire, fools declare, 'I must earn a living to survive,' even as they march into battle risking their very lives. For the sake of profit, they willingly enter into servitude.",
    "Some driven by desire have their bodies cut to pieces,\nWhile others are impaled upon sharpened stakes.\nSome are seen pierced by short spears and weapons,\nAnd others are consumed by raging flames.",
    " English Translation\n\nUnderstand that wealth brings endless suffering through the anguish of accumulating, protecting, and losing it. For those whose minds are distracted by attachment to possessions, there can be no opportunity for liberation from the sufferings of cyclic existence.",
    "Those who are attached to desires experience many disadvantages with minimal rewards, just like oxen pulling a cart who only manage to eat a few mouthfuls of grass.",
    "For the sake of trivial pleasures—things so insignificant that even animals can easily obtain them—those tormented by their karma squander this precious human life endowed with freedoms and opportunities, which is extremely difficult to find.\n\nHuman lives like ours, endowed with leisures and favorable conditions for spiritual practice, are extraordinarily rare and valuable. Yet we sacrifice this precious opportunity pursuing commonplace satisfactions that even animals readily secure. Driven by the force of our past actions, we destroy our greatest treasure for the most ordinary rewards.",
    "This body, which will inevitably perish and causes one to fall into the hells and other lower realms, is of little significance. Yet all the exhausting efforts one makes for its sake throughout one's entire life—",
    "If with merely a billionth fraction of the effort \nthat one has expended pursuing desires,\none could attain complete Buddhahood,\nthen the suffering experienced by those attached to desires\nis far greater than the hardships of the bodhisattva path,\nyet unlike the spiritual journey, their greater suffering yields no enlightenment.\n\n---\n\n Prose Translation\n\nIf one could achieve complete Buddhahood with just a tiny fraction—merely one billionth—of the effort that has been expended in pursuing worldly desires, then how irrational it is to continue on the path of attachment. Those devoted to sensual pleasures actually endure far greater suffering than practitioners on the bodhisattva path, yet unlike spiritual hardships which lead to awakening, their immense suffering produces no enlightenment whatsoever.",
    "When one contemplates the suffering of hell realms and similar states,\nno comparison can be made to the dangers of desires—\nneither weapons, poison, fire,\nprecipices, nor enemies suffice as adequate examples.",
    "Thus, becoming weary of sensual desires, cultivate delight in solitude. Seek out peaceful forest settings that are free from conflict and mental afflictions.",
    "The fortunate ones find peaceful retreat on cool stone terraces of delightful mansions, where moonlight and sandalwood provide natural coolness. There, caressed by the silent, gentle forest breezes, they walk in meditation while contemplating ways to benefit others.",
    " Translation\n\nDwelling for as long as one wishes in empty houses, at the foot of trees, or in caves, free from the suffering of possessing and protecting belongings, one lives independently and moves about with ease, unburdened by expectations.\n\n---\n\n Expanded Translation\n\nOne can choose to stay for whatever duration one desires - whether briefly or extended periods - in uninhabited dwellings, beneath the shelter of trees, or within secluded caves. Having abandoned the distress and anxiety that comes with owning possessions and constantly guarding them against loss, one lives without dependency on others. Free from attachment and social obligations, one moves through the world with a liberated mind, unrestrained and at ease, conducting oneself according to one's own authentic spiritual path rather than conforming to worldly expectations.",
    "One who moves freely without attachment and remains unbound to anyone, who experiences the happiness of contentment—even Indra, lord of the gods, finds such joy difficult to attain.",
    "By reflecting on these and other qualities of solitude, one should calm all discursive thoughts and then cultivate the mind of awakening.",
    "First, one should diligently meditate on the equality of self and others. Since all beings equally experience happiness and suffering, one should protect everyone just as one protects oneself.\n\n*[From Sanskrit: In the beginning, one should respectfully cultivate the equality of self and others. Since all beings equally experience happiness and suffering, I should protect them all just as I would myself.]*",
    "Though the body has many distinct parts—hands and so forth—we regard and protect it as a single entity. In the same way, although living beings are diverse, all experience pleasure and pain alike. Just as I seek happiness, every being equally desires the same.",
    "Though my suffering does not directly affect the bodies of others, this very suffering becomes unbearable to me because of my attachment to myself as 'I.' \n\nEven when my personal pain causes no harm to other beings' physical forms, I find this same suffering intolerable precisely because of my deep-seated self-cherishing and identification with it as 'mine.'",
    "Similarly, though the suffering of others does not directly befall me, nevertheless, that suffering becomes my own suffering; due to identification with them as self, it becomes unbearable.",
    "I shall remove the suffering of others because it is suffering, just as I would remove my own pain. I shall work to benefit others because they are sentient beings, just as I naturally care for my own body.",
    "When I and others equally desire happiness, what difference is there between myself and them? For what reason, then, should I strive for happiness for myself alone?",
    "When both myself and others equally dislike suffering and seek to avoid pain, what difference is there between us? What justification is there for protecting myself while ignoring others?",
    "If I refuse to protect others from their suffering\nBecause their pain does not harm me,\nThen why would I protect myself from future suffering\nThat does not harm me now?",
    "The thought 'I will experience that suffering in the future' is a mistaken concept. This is because the one who dies is actually different from the one who is born in the next life.",
    "If we hold that each person's suffering should be protected against only by that very person themselves, then why should the hand protect the foot from its suffering? After all, the suffering of the foot does not belong to the hand.",
    "If you object that 'Even though it is unreasonable, I engage in these actions due to self-grasping,' then understand this: Whatever is unreasonable—whether concerning oneself or others—should indeed be abandoned to the best of one's ability.",
    "What we call a 'continuum' or a 'collection' \nIs false, just like a garland or an army.\nSince there is no actual possessor of suffering,\nWho could possibly claim ownership of it?",
    "All suffering lacks a true owner and is without fundamental distinction. Because it is suffering, it should be eliminated, regardless of whose it is. What purpose is served by maintaining rigid distinctions in this matter?",
    " Translation of 'Why Eliminate Suffering?'\n\nWhy should the elimination of suffering for all beings even be questioned? This is beyond dispute. If suffering should be eliminated at all, then all suffering everywhere should be eliminated. Otherwise, my own suffering—just like that of other sentient beings—would equally have no reason to be addressed.",
    "If compassion brings much suffering, why deliberately cultivate it? When one contemplates the suffering of all beings, how can compassion's pain be considered too great?",
    "If a single instance of suffering\nCan eliminate the suffering of many,\nThen one endowed with compassion should indeed\nGenerate that suffering for oneself and others.",
    "Therefore, though Supushpachandra (Flower-Moon-Beautiful) was fully aware of the harm the king would cause him, he did not seek to remove his own suffering, because doing so would exhaust the suffering of many others.",
    "When one has cultivated their mindstream in this way,\nThey find joy in relieving others' suffering.\nLike swans eagerly diving into a lotus lake,\nThey will even willingly enter the most terrible hell realms.\n\n---\n\n**Modern English Prose Translation:**\n\nWhen practitioners have thoroughly trained their minds in this way, they develop genuine delight in alleviating the suffering of others. With such deeply cultivated compassion, they become like swans joyfully plunging into a lotus-filled lake—they would willingly enter even the most unbearable hell realms if doing so would benefit other beings. Their transformation is so complete that what would normally be considered the ultimate sacrifice becomes a source of joy, as their concern for others' wellbeing completely overshadows any thought of personal comfort or safety.",
    "When sentient beings find complete liberation,\nThere arises an ocean of joy so vast.\nIs this alone not sufficient fulfillment?\nWhat need is there for seeking liberation just for oneself?",
    "Therefore, even when working for the benefit of others, one neither feels pride nor amazement at one's actions. Since one takes delight solely in benefiting others, there is no expectation for karmic results or rewards for oneself.",
    "Therefore, just as I would instinctively protect myself from even the slightest harsh words or criticism, I should likewise develop the same protective attitude and compassionate mindset toward others.\n\nIn the same way that I naturally shield myself from even minor unpleasantness, I should cultivate an identical sense of protection for all other beings. The compassion I generate for others should mirror exactly the care and concern I have for my own wellbeing, with equal intensity and commitment.",
    "Just as through habituation, one develops the notion 'This is me' \nregarding the drops of semen and blood from others—\neven though there is no actual self-entity present in them—",
    "Similarly, why not regard others' bodies as 'self' as well?\nIt is not at all difficult to establish one's own body\nas belonging to others.\n\n---\n\nIn natural modern English:\n\nIn the same way, why shouldn't we be able to regard others' bodies as 'self' too? After all, it's not actually difficult to recognize our own bodies as belonging to others.",
    "Having recognized that oneself is flawed while others are oceans of good qualities, one should cultivate the complete abandonment of self-cherishing and the embracing of others.",
    "Just as hands and other limbs are considered parts of one's body, why are sentient beings not likewise considered parts of the world?",
    "Just as through habituation one develops the sense of 'self' \nIn relation to this body which has no inherent self-nature,\nWhy would the same sense of self not arise toward other beings as well\nWhen one becomes habituated to regarding them as oneself?",
    "Thus, even when I have worked for the benefit of others, neither pride nor amazement arises in me. Just as after feeding myself, I do not expect anything in return.",
    "Therefore, just as you would protect yourself even from minor unpleasant words, in the same way, cultivate both a protective mindset and compassionate heart toward all living beings.",
    "Therefore, the Protector Avalokiteshvara, out of his great compassion, blessed even his own name in order to dispel the fears that beings experience in gatherings and assemblies.\n\n*Alternative rendering based on the Sanskrit:*\n\nThus did the Lord bestow his blessing, through his very name 'Avalokiteshvara,' to remove even the anxiety people feel in assemblies.\n\n*Note: The Tibetan version emphasizes Avalokiteshvara's great compassion, which is not explicit in the Sanskrit verse. The Sanskrit also specifically mentions 'assembly fear' (parṣacchāradya) while the Tibetan refers more broadly to 'fears in gatherings' (ʼkhor gyi ʼjigs pa).*",
    "Do not turn away from difficult practices,\nFor through the power of habituation,\nThat which once terrified you merely upon hearing its name\nWill later, in its absence, become something you miss.",
    "Whoever wishes to quickly protect themselves and others should practice the supreme secret teaching of exchanging self and others.",
    "This very body, to which we are so attached, causes us to feel fear even from the smallest threats. When one considers that this body is itself the source of all our fears, who among us would not view it with the same aversion we hold toward an enemy?\n\nThe body to which we cling with such affection becomes the basis for our terror—even minor dangers provoke intense fear. Given that this physical form generates countless anxieties both in this life and in futures ones, what wise person would not regard it as adversarial? Rather than cherishing this body with attachment, a rational person would recognize it as a continuous source of suffering and develop a sense of detachment from it. Just as we naturally avoid what threatens us, we should similarly question our instinctive identification with and attachment to this body that brings us nothing but fear.",
    "Whoever wishes to remedy their bodily ailments such as hunger, thirst, and illness, and for this purpose kills birds, fish, and wild animals, or lies in wait along roads to ambush others—",
    "One who, driven by personal gain and honor, would go so far as to kill their own father and mother, and would steal possessions belonging to the Three Jewels—such a person will consequently burn in the Avīci hell.",
    "What wise person would desire this body, protect it, and worship it? \nWho would not view it as an enemy, and who would not treat it with contempt?",
    "Thinking, 'If I give this away, what will I have for myself?' is the mentality of demons, focused only on self-interest. \n\nThinking, 'If I use this for myself, what will I have to give to others?' is the divine way, concerned with the welfare of others.",
    "One who harms others for selfish gain\nWill suffer torment in the hells and lower realms.\nBut one who sacrifices oneself for others' benefit\nWill attain all excellent prosperity.\n\n---\n\n Modern English Translation (Prose Version)\n\nIf you harm others for your own self-interest, you will suffer torment in the hell realms and other lower states of existence. However, if you willingly accept hardship and sacrifice yourself for the welfare of others, you will attain every form of prosperity and excellence.",
    "Through selfish desires to elevate oneself above others, one will experience rebirth in lower realms, acquire low status, and develop a foolish mind. However, if one transfers this very same desire—wishing instead for others to be elevated—one will experience rebirth in fortunate realms, receive honor from others, and develop wisdom.\n\n---\n\nIn more natural modern English:\n\nThe very same desire for elevation that, when selfishly applied to oneself, leads to unfortunate rebirth, low social standing, and mental dullness, will—when redirected toward wishing for others' advancement instead—result in fortunate rebirth, respectful treatment, and a wise mind.",
    "If you exploit others for your own benefit,\nYou will experience life as a servant or similar station.\nIf you dedicate yourself to serving others' needs,\nYou will experience life as a lord, master, or similar position.\n\nIn more natural contemporary English:\n\nWhen you use others for your own selfish purposes, you create the karma to be reborn as a servant or in other subordinate positions in future lives. Conversely, when you willingly serve others and dedicate yourself to their welfare, you create the karma to be reborn as a master, leader, or in other positions of authority and respect.",
    "All happiness that exists in the world \nArises from wishing for others' happiness.\nAll suffering that exists in the world\nComes from desiring one's own happiness alone.",
    "What need is there for many words? \nLook at this fundamental difference:\nImmature beings work for their own benefit,\nWhile the Sage acts for the welfare of others.",
    "If you do not genuinely exchange your own happiness for the suffering of others, you will neither achieve Buddhahood nor find happiness even within the cycle of existence.",
    "Setting aside considerations of the next world, even the purposes of this present life cannot be accomplished when servants fail to perform their work and masters withhold proper payment.",
    "Deluded people abandon the complete fulfillment of happiness—both the visible benefits in this life and the invisible joys of future lives. Instead, through causing suffering to others, they take upon themselves unbearable suffering.\n\nThese confused beings forsake all possibilities of perfect well-being and prosperity that would come from caring for others. Rather than practicing altruism, which brings happiness both seen and unseen, they choose actions that harm others. Through their confusion about the true causes of happiness and suffering, they unwittingly bring terrible suffering upon themselves.",
    "Every harm that exists in this world,\nAll the fears and sufferings found throughout existence—\nIf these all arise from grasping at a 'self' where none exists,\nWhat purpose could this great demon of self-grasping possibly serve for me?",
    "Without fully renouncing the self, one cannot be free from suffering, just as one cannot avoid being burned without letting go of fire.",
    "Therefore, to pacify my own suffering and to alleviate the suffering of others, I shall give myself completely to others and cherish others exactly as I cherish myself.",
    "Understand this with certainty, my mind: 'I am now bound to others.' From now on, think of nothing else except working for the benefit of all sentient beings.",
    "It is not appropriate to pursue personal interests using the eyes and other sense faculties that belong to others. Using eyes and other faculties that have been dedicated to others' benefit to harm those very beings is improper.",
    "Therefore, prioritize the welfare of sentient beings above your own. Whatever you see on your own body—possessions, enjoyments, or necessities—take these away from yourself and use them to benefit others instead.",
    "First, place yourself mentally in the position of those who are inferior, equal, or superior to you. Then, imagine these others in your position, essentially exchanging yourself with them. With a mind free from conceptual elaboration, meditate on feelings of jealousy, competitiveness, and pride.",
    "They are honored while I am not. \nJust as they have obtained abundant provisions, I have gained nothing.\nThey receive praise while I face criticism.\nThey experience happiness while I endure suffering.",
    "I perform various labors while this person rests in comfort. This one is celebrated as great in the world, while I am known as lowly and devoid of qualities.",
    "What purpose is there in being without qualities? Indeed, I should be fully endowed with virtues. There are those compared to whom I am inferior, and there are also those compared to whom I am superior.\n\n---\n\n Modern English Translation\n\nWhat is the point of lacking good qualities? I should strive to develop all virtuous qualities within myself. There will always be some people who surpass me in certain respects, and likewise, there will always be others whom I surpass in some way. \n\nThe text reminds us that while we should aspire to cultivate positive qualities, we should also recognize that superiority and inferiority are merely relative concepts. No one is absolutely superior or inferior; these distinctions exist only in relation to others, which helps guard against both excessive pride and unwarranted self-deprecation.",
    "My moral discipline and views have deteriorated, not because I am inherently flawed, but because I am under the power of afflictive emotions beyond my control. I need healing as much as possible, and I willingly accept whatever hardship this process may bring.\n\nIn more natural prose:\n\nThe deterioration of my ethical conduct, philosophical views, and other aspects of my practice is not something I can control by myself—these failings occur because I am overwhelmed by the power of afflictive emotions. I need to be healed to whatever extent possible, and I willingly accept any difficulties that may arise during this healing process. Just as a student accepts correction from a teacher, I am prepared to endure hardship for the sake of my spiritual restoration.",
    "If I am not someone who should be cared for by you, then why do you show such contempt toward me? What use are these qualities of yours to me? I myself am the one with true qualities.",
    "Those who stand at the threshold of lower realms, as if in the jaws of vicious beasts,\nYet feel no compassion for suffering beings,\nWhile outwardly boasting of spiritual qualities they do not possess,\nArrogantly challenge and seek to compete with the truly wise.",
    "When comparing yourself to someone of equal status, if you seek to establish your own superiority, you will surely secure gains and honors for yourself, even if it requires engaging in conflict.",
    "May my qualities be clearly visible throughout the entire world, yet may whatever qualities this other person possesses remain unheard by anyone at all.",
    "I should conceal my own faults while I receive honor instead of this person. Today I have obtained excellent gains, and I, not this person, should be the one who is respected.",
    "I will gladly observe for a long time those who have committed harmful deeds. Let them become objects of laughter for all beings and targets of criticism from every direction.",
    "These disturbing emotions are said to compete alongside me,\nAs if in rivalry. Are these emotions equal to me\nIn learning and wisdom? Or perhaps in physical appearance,\nSocial standing, or wealth?\n\n---\n\nIn modern English prose:\n\nIt is said that these disturbing emotions within me act as if they are competing with me, setting themselves up as rivals. I should reflect: On what basis do these afflictive states presume to stand as my equals? Are they my match in learning and wisdom? Or do they compare with me in physical appearance, family lineage, or material wealth? \n\nThis verse exposes how prideful thoughts create an internal sense of competition, leading us to constantly measure ourselves against others. By personifying these mental afflictions as rivals, the text invites us to recognize the absurdity of letting such comparative thinking dominate our minds and create suffering.",
    "Thus, when I hear my own qualities being celebrated and renowned among all, I will experience the rising of joy that manifests as goosebumps on my skin, and I will fully immerse myself in this happiness and well-being.",
    "Even if this person acquires wealth or resources, if they are performing work at my direction, I should provide them with only enough for their basic subsistence, then forcefully claim the remainder for myself through my own authority.",
    "This self-cherishing mind should be deprived of its pleasures and comfort,\nAnd I should continually subject it to hardship.\nFor hundreds upon hundreds of times,\nThis mind has caused me harm throughout my wandering in the cycle of existence.",
    "O mind, though countless eons have passed while you have desired to accomplish only your own benefit, through all these immense efforts, you have achieved nothing but suffering.",
    "Therefore, engage wholeheartedly in working for the benefit of others with certainty and conviction. The words of the Buddha are unfailing, and you will later witness the qualities that arise from this practice.",
    "If in former times you had performed this essential practice, it would have been impossible for you to be in such a state as this, instead of experiencing the perfect bliss of Buddhahood.",
    "Therefore, just as you have developed a sense of 'I' and 'mine' regarding the droplets of semen and blood that came from others (your parents), similarly, train yourself to cultivate this same attitude toward all other beings.",
    "Become a caretaker for others' needs, and whatever valuable possessions you observe on your own body, take these very things from yourself by releasing your attachment to them, and use them to benefit others who are in need.\n\nIn this way, transform yourself into a guardian who carefully examines what others require. Instead of coveting what belongs to others, look at your own food, clothing, ornaments, and possessions with the eye of generosity. Mental­ly relinquish your sense of ownership over these items—seizing them from your self-cherishing attitude—and put them to use for the welfare of those who lack such necessities.",
    "I am happy while others suffer. I stand high while others remain low. I act for my own benefit, but others do not do the same for themselves. Why should I not feel envy toward myself?",
    "I should deprive myself of happiness and take upon myself the suffering of others. When this person does something questionable, I should carefully examine my own faults.",
    "When others commit wrongdoings, take them upon yourself as your own faults. Even if you have committed only a minor transgression, openly confess it before many people.",
    " Translation\n\nExtol the fame and virtues of others lavishly, allowing their reputation to overshadow your own. Consider yourself like the lowest of servants, and dedicate yourself entirely to fulfilling the needs of all beings.\n\nIn more detailed prose:\n\nSpeak generously of others' good qualities and reputation, praising them more lavishly than they might deserve. By doing so, deliberately let your own fame and recognition be diminished and obscured. View yourself as the humblest of servants, someone of the lowest rank who takes on burdens without complaint or pride. Like such a servant, commit yourself wholeheartedly to working for the benefit of all beings in every situation, serving their needs rather than expecting them to serve yours.",
    "This self is inherently flawed in its nature;\nDo not take pride in temporary qualities.\nWhatever virtues you may possess,\nEnsure that no one discovers them; act accordingly.",
    "In brief, whatever harm you have inflicted upon others for your own benefit, from now on, let all such harm fall upon yourself instead, for the sake of sentient beings.\n\n*Alternative rendering:*\n\nIn essence, any suffering you have caused to others out of self-interest, redirect that suffering to yourself for the benefit of all sentient beings.",
    "Do not encourage the mind to become prideful or arrogant, which would make it haughty and overconfident. Instead, maintain it like a newly-wedded bride—modest, restrained, with a proper sense of shame and caution.",
    "Do this and remain in this manner; this is what you should not do. In this way, bring the mind under control, and if you transgress these boundaries, apply discipline.",
    "If, despite being instructed in this way,\nyou, mind, refuse to act accordingly,\nthen since all faults depend on you,\nI shall have no choice but to subdue you completely.",
    "Where can you flee now that I have seen you? I will utterly destroy all your pride. This is different from that previous time when you destroyed me.\n\nThis is no longer the past era when you, my self-cherishing mind, could lead me to ruin. Now I have recognized you for what you are. Where can you possibly escape? Now that I have truly seen your nature, I will completely demolish all your arrogance and self-importance.",
    "Abandon the thought that says, 'I still have my own purposes to fulfill.' I have sold you (my self-centered mind) to others, so do not become discouraged but offer your service and very being wholeheartedly.",
    "If I carelessly fail to give myself to sentient beings, I will certainly be handed over to the guardians of hell realms. \n\nIf I become heedless and do not offer myself to all beings, there is no doubt that my self-cherishing mind will deliver me into the hands of the terrifying guardians who protect the hell realms.",
    "In this way, you—my self-cherishing mind—have long caused me to suffer by repeatedly giving me away to torment. Now, remembering these past grievances, I will destroy your self-serving intentions.",
    "If you truly desire happiness for yourself, do not seek pleasure for yourself alone. If you truly wish to protect yourself from suffering, always devote yourself to protecting others.",
    "The more attentively one pampers and indulges this body, the more delicate and fragile it becomes, steadily declining into a state of hypersensitivity.",
    "Thus, for a person who has fallen into such craving,\nEven if all the riches of this entire earth\nWere available to them, they would still be insufficient\nTo satisfy their desires—who then could possibly fulfill them?",
    "Desiring what is unattainable brings mental afflictions and leads to disillusionment. But the one who remains free from dependence on everything will experience excellence that knows no end.",
    "Therefore, do not create opportunities to increase your body's desires. Whatever attractive things you refrain from grasping—that is the truly excellent treasure.",
    "This body ultimately dissolves into nothing but ashes,\nIncapable of moving itself, needing others to propel it.\nA repulsive form composed of impure substances,\nWhy do I cling to this as my 'self'?",
    "Whether alive or dead, what use is this mechanical contraption to me? What difference is there between this body and a clod of earth? Alas, why do I not dispel this pride of self-importance?\n\n---\n\nIn fluid modern English:\n\nWhether I am alive or dead, what use is this machine-like body to me? What meaningful difference exists between this body and a lump of clay or other mundane objects? Alas, why do I fail to overcome the arrogance that clings to this sense of 'me' and 'mine'?",
    "By obsessively attending to this body, \nI have needlessly accumulated suffering.\nWhat purpose is there in feeling attachment or aversion\nToward this thing that is no different from a piece of wood?",
    "Whether my body is carefully nurtured by me,\nOr eventually devoured by vultures and other creatures,\nSince the body itself feels neither attachment nor aversion,\nWhy should I develop attachment to it?",
    "If I become angry when criticized,\nAnd pleased when praised,\nYet this very body lacks awareness,\nFor whose sake am I exerting myself?",
    "If I consider those who desire this body of mine to be my friends, then why should I not delight equally in all beings? Since every creature desires its own body just as I desire mine, why should they not also be dear to me?",
    "Therefore, I shall release this body without attachment for the benefit of beings. Though it has many faults, I shall maintain it as one maintains a tool for one's work.\n\nIn more natural English:\n\nTherefore, I will offer this body without clinging to it, dedicating it entirely to the welfare of all beings. Despite its many flaws and imperfections, I will care for it properly—just as a craftsperson maintains their tools for their work.",
    "Therefore, I shall abandon worldly behaviors and instead follow the path of the wise. Keeping in mind the teachings on mindfulness and vigilance, I will overcome drowsiness and mental dullness.",
    "Following the example of the greatly compassionate bodhisattvas, one should establish firm persistence in reasoned practice. If one does not strive continuously, day and night, when will one's suffering ever come to an end?\n\n---\n\n*Expanded Translation:*\n\nLike the noble bodhisattvas who embody great compassion, one should cultivate unwavering diligence grounded in sound reasoning and understanding. If one fails to make consistent effort throughout both day and night without interruption, how will one's suffering in the cycle of existence ever reach its conclusion? Only through persistent and unbroken practice can one hope to find liberation from suffering.",
    "Therefore, to dispel all obscurations, I shall withdraw my mind from mistaken paths and continually place it in meditative equipoise on the correct object of meditation.",
    "From the 'Introduction to the Bodhisattva's Way of Life,' the Eighth Chapter entitled 'The Teaching on Meditation' (or 'The Perfection of Meditation')."
  ],
  [
    "All these components of the path  \nThe Sage taught for the sake of wisdom.  \nTherefore, those who wish to pacify suffering  \nShould cultivate wisdom.",
    "The conventional and the ultimate are accepted as the two truths. The ultimate is not within the domain of the intellect; intellect itself is said to be conventional.\n\n---\n\nIn natural, contemporary English:\n\nThere are two truths that encompass all of reality: the conventional truth and the ultimate truth. The ultimate truth transcends intellectual understanding and cannot be grasped by conceptual thought. The intellect itself, along with all its cognitive processes, belongs to the domain of conventional truth.",
    "In this context, the world is seen as twofold: \nThat of the yogis and that of ordinary people.\nIn this regard, the ordinary world\nIs invalidated by the yogic world.",
    "Even accomplished yogis are refuted by those of higher understanding,\nEach superior level overcoming the previous ones.\nThrough examples accepted by both sides,\nThey practice for results without getting caught in analysis.",
    "Ordinary people perceive objects in the world and consider them to be truly real, rather than understanding them as illusion-like. This is the point of contention between yogic practitioners and ordinary worldly people.",
    "Even forms and other objects that appear to be directly perceived\nAre established merely by convention, not by valid cognition.\nSuch conventional perception is false,\nJust as impure things are wrongly seen as pure.",
    "For the purpose of guiding worldly beings, the Protector taught things as having momentary existence. However, these phenomena are not truly momentary from the perspective of ultimate reality. If one objects that this contradicts conventional reality as well, [this objection is unfounded].",
    "Through the yogi's conventional understanding, there is no fault.\nCompared to ordinary worldly perception, they see reality as it truly is.\nOtherwise, when they recognize women's bodies as impure,\nThis realization would be contradicted by worldly misconceptions.\n\n Prose Translation\n\nThe conventional understanding of yogis is faultless because, in contrast to ordinary worldly perception, they see reality as it truly is. If this were not the case, when yogis correctly recognize the impure nature of women's bodies through their meditative insight, their valid realization would be wrongly contradicted by ordinary worldly misconceptions that cling to notions of purity and attractiveness. This demonstrates that the yogic perception, being superior, cannot be invalidated by inferior ordinary perception.",
    " Translation of the Verse\n\n'How can merit arise from an illusion-like Buddha, just as it would from something truly existent? And if sentient beings are like illusions, how can they be reborn after death?'\n\n Detailed Prose Translation\n\nMerit arises from the Buddha, who is like an illusion, in exactly the same way as it would arise from what others consider truly existent. The verse poses two philosophical questions: First, if the Buddha lacks inherent existence and is merely like an illusion, how can genuine merit arise from making offerings to such a Buddha? Second, if sentient beings themselves are like illusions—empty of inherent existence—then how can they undergo the process of death and rebirth? If something is merely illusory, like a magical creation that vanishes without trace, then how can beings reappear in new forms after their death?\n\nThese questions challenge the emptiness view by questioning how conventional functions like generating merit and the process of rebirth can operate in a reality where all phenomena lack true, independent existence. The verse captures the tension between the ultimate nature of reality (emptiness) and the conventional processes that appear to operate in our everyday experience.",
    "As long as the collection of causes and conditions is assembled,\nFor just that duration, the illusion will manifest.\nHow could sentient beings truly exist\nMerely because they have a long-running continuum?",
    "When killing a magically created person or committing similar acts,\nSince there is no mind present, no negative karma arises.\nHowever, in relation to beings who possess minds that are like illusions,\nBoth merit and negative karma can arise.\n\nIn modern English:\n\nThere is no negative karma incurred when killing or harming a magically created being, because such an illusory entity lacks a mind that can experience suffering. However, when we interact with sentient beings—whose minds are themselves illusory in nature—our actions generate real consequences: beneficial actions produce merit, while harmful actions create negative karma.",
    "Since mantras and other magical methods lack inherent power, they cannot produce an actual consciousness in illusory displays. These various illusions arise from diverse conditions, and therefore appear in many different forms. Nowhere does a single condition possess the capacity to produce all possible effects.",
    "If nirvana is the ultimate truth, while samsara is merely conventional truth, then even the Buddha would be bound to cycle in samsara—so what would be the purpose of practicing the bodhisattva path?",
    "When the continuum of conditions remains unbroken,\nEven illusory appearances will not cease.\nBut when the continuum of conditions is severed,\nEven conventional reality no longer arises.",
    "When there isn't even delusion present,\nBy what means could illusion be perceived?\nWhen for you the illusion itself\nDoes not exist, what then is being perceived?\n\n---\n\nIn clear modern English:\n\nIf even the mistaken perception doesn't exist, how could an illusion be recognized at all? And if, according to your view, the illusion itself doesn't even exist, then what exactly is being perceived in that moment?",
    "If something else truly exists as reality, then that appearance is mind itself. But when mind itself is like an illusion, what is there to be seen, and by what?",
    "The Lord of the World himself has declared:\n'The mind cannot see the mind.'\nJust as a sword's edge cannot cut itself,\nSo too the mind cannot perceive itself.",
    " Translation\n\nJust as a lamp clearly illuminates its own nature,\nSo too, some claim, consciousness reveals itself.\nBut a lamp does not need to illuminate itself,\nFor it is never obscured by darkness.\n\n---\n\nIn modern English prose:\n\nSome argue that just as a lamp illuminates its own nature clearly, consciousness can perceive itself. However, this analogy fails upon examination. A lamp does not actually need to illuminate itself because from the moment it exists, it is never obscured by darkness—it is inherently luminous by its very nature. What need would there be to illuminate something that is already visible? The lamp only illuminates other objects by dispelling the darkness that obscures them, but the lamp itself is never hidden by darkness, so it requires no self-illumination.",
    "Just as a blue crystal does not depend on anything else for its blueness, similarly, we observe that some things depend on others while some do not.\n\nJust as a crystal that appears blue does not depend on external factors for its essential blueness, in the same way, we can observe in the world that some phenomena depend on other things, while other phenomena exist independently without such dependence.",
    "That which is not inherently blue cannot make itself blue through its own agency. Nothing can transform itself blue by its own power.",
    " Translation from Sanskrit\n\nHow could something blue make itself blue through its own action? If something is not already blue, it cannot make itself blue through its own action.",
    "If one claims, 'A lamp illuminates,' this is known through consciousness and then expressed in words. But if one asserts, 'Consciousness itself is illuminating,' then who knows this to be true, and on what basis is such a statement made?",
    "When something is not seen by anyone,\nWhether it is manifest or unmanifest,\nSpeaking about it is as meaningless\nAs describing the graceful movements of a barren woman's daughter.",
    "If self-awareness did not exist,\nHow could consciousness be remembered?\nIt is remembered through its relationship with experiencing other things,\nJust as with rat poison.",
    " Translation of Verse 25\n\nWhen one sees something through reliance on other conditions, this doesn't prove that it illuminates itself. Just as when a pot is seen through a magical eye ointment, the ointment itself doesn't become visible.\n\n Prose Rendering\n\nWhen consciousness perceives objects by relying on various conditions, some argue that this demonstrates consciousness's self-illuminating nature. However, this reasoning is flawed. Consider this example: when magical eye ointment prepared with special mantras allows us to see a jar buried underground at a distance, the eye ointment itself—though literally in our eye—isn't visible to us. Similarly, just because consciousness perceives other things doesn't mean it necessarily perceives itself. The illuminating agent (like the eye ointment) may reveal other objects clearly while remaining imperceptible itself. This example demonstrates that the illuminator and what is illuminated need not share the same nature, thus challenging the notion that consciousness must be self-aware.",
    "What is seen, heard, and mentally cognized is not being refuted here. Rather, what needs to be eliminated is the conception that these things are inherently true or real, for this misconception is the cause of suffering.",
    "If illusions are not different from the mind, yet are also not conceptualized as non-different from it, then consider: if they were real entities, how could they not be different from the mind? And if you claim they are not different, then they cannot exist as real entities.",
    "Just as an illusion, though not real, can still be perceived, so too is the mind that perceives it. If the cycle of existence depended on something substantially real as its basis, it would otherwise become like empty space.",
    "How could non-existence, which depends on existence, possibly possess the capacity to act? Indeed, according to your position, the mind would end up entirely alone, without any companion.",
    "When the mind is free from grasping at objects,\nAt that moment, all are Thus-Gone Ones.\nYet even so, what benefit is there\nIn analyzing everything as mere mind?",
    "Even if one knows phenomena are like illusions,\nHow would this reverse the afflictions?\nAfter all, even the magician himself\nCan develop desire for the illusory woman he created.\n\n---\n\n**Modern English Translation**\n\nEven when someone intellectually understands that all phenomena are illusory, this knowledge alone doesn't automatically eliminate emotional afflictions. How could mere conceptual understanding reverse deeply rooted patterns of attachment and aversion? Consider this: even the magician who creates an illusory woman—knowing perfectly well she doesn't truly exist—may still experience desire for his own creation. This demonstrates the gap between intellectual understanding and complete emotional transformation.",
    "The creator of illusory appearances has not abandoned the latent tendencies of mental afflictions regarding objects of knowledge. Therefore, when such a person perceives the illusion they've created, their understanding of emptiness remains weak.",
    " Translation of 'Habituating to Emptiness'\n\nBy cultivating the imprints of emptiness in one's mind,\nThe imprints of grasping at concrete entities are dispelled.\nThrough repeated habituation to understanding that 'nothing whatsoever exists,'\nEven that subtle attachment to emptiness will later be abandoned.\n\n---\n\n*In natural English prose:*\n\nThrough repeated familiarization with emptiness, one gradually removes the deeply ingrained habit of perceiving phenomena as inherently real. Then, by continually practicing the understanding that 'nothing whatsoever truly exists' - meaning that even emptiness itself lacks intrinsic existence - one eventually abandons even the subtle attachment to emptiness. This progressive meditation leads to complete freedom from all conceptual fixations.",
    "When an entity that is the object of analysis cannot be observed, and we say, 'It does not exist,' how can that non-existence, which has no basis to rest upon, remain as an object before the mind?",
    "When neither existence nor non-existence stands before the mind, at that time, because no other alternative remains, the mind rests without a reference point, completely pacified.",
    "Just as a wish-fulfilling jewel or a wish-granting tree completely satisfies whatever hopes one might have, similarly, the Buddha's form appears to disciples through the power of aspirations made for those to be trained.",
    "Just as a Garuda-mantra master, having consecrated a ritual pillar and then passed away, continues to neutralize poison and other harmful influences through that pillar even long after his death—in the same way, the beneficial influence of a realized being persists beyond their physical presence.",
    "Even when a bodhisattva has passed beyond suffering into nirvana, they continue to accomplish all beneficial purposes through the victory monument of enlightenment they established by conducting themselves in accordance with the path to awakening.",
    "How can offerings made to that which lacks consciousness yield any results? The scriptures clearly teach that offerings made to the Buddha, whether during his lifetime or after his passing into nirvana, are considered exactly equal in merit.",
    "Whether conventionally or in ultimate reality, the results from making offerings come from scriptural authority. For example, just as offerings made to the true Buddha yield definite benefits.",
    "Some claim that liberation comes from seeing the truth alone—so what is the purpose of seeing emptiness? Yet scripture clearly states that without this path of emptiness, awakening is impossible.",
    "If the Mahāyāna is not established as authentic, then how can your own scriptures be established as authentic? For what is accepted by both traditions was not initially established for you either.",
    "For whatever reason you have faith in your own scripture, apply that same standard equally to the Mahāyāna. If something were true merely because two different groups desire it to be so, then even the Vedic texts and similar works would have to be accepted as true.\n\n*Alternative rendering with slightly more context:*\n\nWhatever grounds cause you to have confidence in your scriptures, those same grounds apply equally to the Mahāyāna teachings. If truth were established merely because two different parties assert something as true, then even the Vedas and other non-Buddhist texts would necessarily become true as well.",
    "If you object that the Mahāyāna is unreliable because it is disputed, then you should abandon your own scriptures as well. This is because other scriptures are also subject to disputes—whether from non-Buddhists or even from within your own tradition and from other Buddhist schools.",
    "The foundation of the Buddhist teaching is the authentic monastic community. Yet, maintaining true monkhood itself is difficult to achieve. For those whose minds still cling to objects of reference, even the attainment of liberation remains extremely challenging.",
    "If liberation were achieved merely by eliminating afflictions,\nThen one would be liberated immediately upon their removal.\nYet we observe that even in those free from afflictions,\nThe power of karma continues to operate.",
    " Translation of Verse 47\n\nIf you maintain with certainty that craving, which serves as the appropriating cause, no longer exists, why couldn't there be a non-afflictive form of craving, just as there is non-afflictive ignorance?\n\n---\n\n**Expanded Translation:**\n\nSuppose you assert with certainty that craving—which functions as the appropriating cause for future existence—has been completely eliminated. In that case, consider this: why couldn't there exist a form of craving that, while not afflictive in nature, still persists in the mind stream? This would be similar to how ignorance can exist in both afflictive and non-afflictive forms. Even though this type of craving might not be contaminated by afflictions in the conventional sense, why couldn't it continue to exist in some form, just as non-afflictive confusion does?",
    " Translation of Verse 48\n\nFrom sensation arises craving, and these sensations exist even in them [the Arhats]. Their minds, still bound to objects of perception, remain dwelling in certain reference points.\n\n---\n\n**Modern English Translation:**\n\nCraving arises conditioned by sensations, and these sensations continue to exist even in those who have attained individual liberation. As long as their minds remain engaged with conceptual objects of focus, they will continue to dwell within specific frames of reference rather than achieving complete freedom from all mental constructs.",
    " Translation\n\nA mind lacking the realization of emptiness, once ceased, will be born again—just like in the meditative absorption of non-perception. Therefore, one should cultivate emptiness.\n\n Detailed Prose Translation\n\nA mind that is separated from the understanding of emptiness will inevitably arise again after it has ceased. This resembles what happens in the meditative absorption where perception is absent—though consciousness temporarily subsides, it later returns. For this reason, one should diligently cultivate the realization of emptiness.\n\nThe text teaches that without insight into the empty nature of reality, the mind remains bound to the cycle of cessation and rebirth. Even if one achieves deep meditative states where mental activity seems to stop, this is merely a temporary suspension—not true liberation. Just as those who enter the absorption of non-perception eventually emerge from it with their fundamental ignorance intact, so too will any mind lacking emptiness realization return to its conditioned patterns. Only through directly realizing the empty nature of all phenomena can one find lasting freedom from this cycle.",
    "If you wish to consider any speech that engages with the collections of sutras as truly spoken by the Buddha, then aren't most Mahāyāna teachings similarly consistent with your own sutras?",
    "If one text's exclusion makes all the others defective,\nThen why wouldn't a single text that resembles your accepted scriptures\nEstablish that all these teachings\nWere indeed spoken by the Buddha?",
    "Those profound teachings that even Great Kāśyapa and other senior disciples could not fathom to their depths—who has the authority to declare them invalid simply because you yourself have not realized them?",
    "For the sake of those who suffer due to delusion, a person who has realized emptiness can accomplish the seemingly paradoxical feat of dwelling in the cycle of existence while completely free from the extremes of attachment and fear. This is the fruit of emptiness.\n\nIn other words, the realization of emptiness enables one to remain engaged in the world out of compassion for deluded beings who experience suffering, while simultaneously transcending both attachment to worldly existence and the fear that drives lesser practitioners to escape from it entirely. This balanced state—where one can work within the cycle of rebirth for others' benefit without being tainted by it—is the true and profound result that emptiness realization brings.",
    "Thus, objections against the position of emptiness cannot be reasonably sustained. Therefore, one should meditate on emptiness with unwavering confidence and without any doubt.",
    "Emptiness is the antidote to the darkness of both emotional and cognitive obscurations. How could anyone who desires to quickly attain omniscience not meditate on it?",
    "If an object causes suffering,\nIt is natural to fear it.\nYet since emptiness pacifies all suffering,\nWhy should one fear it?",
    "If there were a self that truly existed, then fear would arise in relation to any object whatsoever. But since there is not even the slightest inherently existing self, who is it that actually becomes afraid?",
    "I am not my teeth, hair, or nails.\nI am not my bones or blood.\nI am not mucus or phlegm,\nNor am I lymph fluid or pus.\n\n---\n\n*Modern English Translation:*\n\nI am not to be identified with my teeth, hair, or nails. My true self is not to be found in my bones or blood. I am not the mucus from my nose or the phlegm in my body. Neither am I the lymph fluid or pus that may form within this physical form.",
    "I am not fat nor am I sweat.\nI am not the lungs nor the liver.\nI am not any other internal organs.\nI am not excrement nor urine.",
    "I am not flesh, nor skin;  \nI am not heat, nor am I the vital winds.  \nI am not the bodily openings in any way,  \nNor am I the six consciousnesses.",
    "If sound-consciousness were permanent, then it would apprehend sound at all times. When there is no object to be known, what could it possibly cognize? On what basis could it even be called consciousness?",
    "If consciousness could exist without actually cognizing anything, then even a piece of wood would absurdly qualify as consciousness. Therefore, it is definitively established that consciousness cannot exist without the presence of an object to be known.",
    "If the same [consciousness] that knows visual form, why would it not also hear sound at that same moment? If you argue this is because sound is not present nearby, then by the same logic, the consciousness of sound should not exist either.",
    "That which has the nature of grasping sound—how could it grasp form? A single person may be conceptualized as both father and son, but this is not ultimately real.",
    "Thus, the qualities of essence, energy, and darkness are neither son nor father. That which perceives sound is not seen as having the nature of visual perception.",
    "If one perceives the same essence merely appearing in a different form, like an actor [changing roles], then that essence cannot be permanent. If you claim that this different manifestation is still the same essential nature, then such a concept of oneness is unprecedented.",
    " Translation of the Buddhist Philosophical Verse\n\nIf the differentiated appearances are not true,\nThen what exactly is their intrinsic nature?\nIf you say it is merely consciousness itself,\nThen all beings would absurdly collapse into one.\n\n Prose Translation\n\nIf you claim that things appearing in different ways are not true as they appear—that is, if the various differentiated aspects of consciousness such as sound perception are merely superficial appearances and not real—then you must explain what actually constitutes their true intrinsic nature. If your answer is that their nature is simply 'consciousness itself' or 'pure awareness,' then you face an absurd consequence: all sentient beings with their separate mind-streams would necessarily become a single entity. This is because all minds would be equivalent in being mere undifferentiated consciousness, eliminating any basis for distinguishing between different beings or persons.",
    "If conscious and unconscious entities would become one because they equally exist, and if their distinguishing characteristics are false, then what could possibly serve as the basis for any similarity between them?",
    "I cannot be an unconscious entity, since anything that lacks consciousness—like a pot or similar objects—cannot be a self. And if one argues that I could be an entity that possesses consciousness through association, this creates an absurdity: an inherently non-knowing entity that comes to know would contradict its own nature, as this transformation would destroy its original non-conscious essence.",
    "If the self is truly unchangeable,  \nWhat can consciousness possibly do for it?  \nIn this way, an unconscious, inactive entity  \nWould merely be space labeled as 'self.'",
    "If there is no self, then the connection between actions and their results would not be reasonable. Since the action would disappear after being performed, whose action would it become when the result manifests?",
    "Since both of us acknowledge that the bases of action and its result are distinct, and that in these processes there is no permanent self that functions as an agent—a point established by both our positions—isn't this debate ultimately pointless?",
    "The notion that 'a cause-possessor simultaneously enjoys its result' cannot be observed—such a scenario is impossible. Rather, the Buddha taught that terms like 'the doer' and 'the experiencer' are designated in dependence upon a single continuum.\n\n---\n\n Explanatory Translation\n\nIt is impossible to observe a situation where one who possesses a cause simultaneously experiences its result. Instead, the Buddha taught that we designate someone as 'the agent who performs an action' and 'the one who experiences the results' based on the concept of a single mental-physical continuum. This maintains the relationship between actions and their consequences without requiring a permanent self.",
    "Past and future mind cannot be the self, for they do not exist. If one claims the presently arisen mind is the self, then when that mind ceases, the self would no longer exist.",
    "Just as a banana tree trunk, when separated into its parts, reveals nothing substantial within, likewise, when I search for myself through careful analysis, I too am found to have no ultimate reality.",
    " Translation of Śāntideva's Verse\n\n'If sentient beings do not truly exist, toward whom should compassion be shown?' one might ask.\n\nIt is toward those who appear due to ignorance—constructs that are accepted provisionally for the purpose of achieving liberation.",
    "If sentient beings do not exist, then for whom is the result and who would attain it? This is true from the ultimate perspective, yet the desire for this result arises from ignorance. For the sake of pacifying suffering, this ignorance regarding the result should not be rejected.",
    "The ego-centered pride that causes suffering\ngrows stronger through delusion about the self.\nIf one objects that this cannot be reversed,\nthen meditation on selflessness is the supreme remedy.",
    "The body is not the feet, nor is it the calves.\nNeither the thighs nor the waist constitute the body.\nThe abdomen and back are also not the body.\nThe chest and shoulders, too, are not the body.",
    "Neither the sides nor the hands constitute the body.\nNeither the armpits nor the shoulders are the body.\nThe internal organs are not it either.\nIf neither the head nor the neck are the body,\nThen what indeed is this thing called 'body'?",
    "If this body exists throughout all its parts\nBy having a portion in each location,\nThen those portions would reside in their own parts,\nBut where does the body itself actually abide?",
    "If the body as a complete entity existed within all its parts such as hands and so forth, then there would be as many bodies as there are parts like hands and so forth.",
    "If the body exists neither externally nor internally, how can it exist in the hands and other parts? If it is not separate from the hands and other parts, how then can it truly exist at all?",
    "The body does not inherently exist; rather, due to delusion, we form the concept of a 'body' regarding hands and other parts. This happens through the specific arrangement of these components—just as one mistakes a scarecrow for a person based on its form.\n\nIn other words, there is no intrinsically existing body, yet through ignorance, we develop the notion of a body when looking at hands and other bodily parts. This misconception arises from the particular way these parts are arranged and organized, similar to how someone might mistake a scarecrow for a human being when seeing its human-like shape from a distance.",
    "For as long as the collection of conditions remains assembled, the body appears like a person, similar to a scarecrow. Likewise, for as long as hands and other parts exist in their proper relationship, for that duration the body appears as such.",
    "Likewise, since a finger is merely a collection of parts, what could we truly identify as a hand? That hand, too, is merely an aggregation of joints, and even those joints, when divided into their own components, cannot be found as singular entities.",
    " Translation\n\nAny part, when analyzed, divides into particles.\nAnd even that particle, when subjected to analysis by directional parts,\nAlong with its directional divisions, being devoid of parts,\nLike space, therefore, even particles do not exist.\n\n Modern English Translation\n\nWhen we analyze any component of physical reality, we can break it down into particles. But even these particles themselves can be further divided according to their directional aspects—east, west, north, south, top, and bottom. Upon closer examination, these directional divisions are found to be without inherent parts or substance. Therefore, just as space has no substantiality, particles themselves ultimately do not exist as independent, inherently real entities.\n\nThe analysis shows that physical forms, when subjected to progressive examination from gross to subtle levels, ultimately dissolve into emptiness, similar to the nature of space. No truly established, indivisible particles can be found at the foundation of physical reality.",
    "Who, possessing discernment, would become attached to forms that are dream-like in this way? When the body thus has no inherent existence, what then can truly be called woman or man?",
    "If suffering truly existed inherently, why would it not affect those experiencing great joy? And if happiness were truly real, why would delicious foods and pleasant things fail to bring delight to those afflicted with grief and anguish?",
    "If a sensation is overpowered by something stronger and thus not experienced, how can it be called a sensation at all? For something whose very nature is not to be experienced, how can it possibly be considered a feeling?",
    "Suffering exists in a subtle form. Hasn't the coarse aspect of suffering been removed? If one argues, 'This is merely experienced as a slight enjoyment different from intense pleasure,' even that subtle aspect would still belong to pleasure, not suffering.",
    "If the arising of contradictory conditions would mean that suffering does not arise, wouldn't this establish that what we call 'feeling' is merely a conceptual fixation or mental projection?",
    "For this very reason, this analytical investigation should be cultivated as the antidote. Meditation, arising from the field of discriminating analysis, serves as nourishment for yogis.",
    "If there is space between sense faculties and their objects,\nhow could they ever meet?\nAnd if there is no space between them, they would become one and the same—\nso which thing could connect with which?",
    "One atomic particle cannot enter into another atomic particle. This is because they have no empty space within them and are equal in size to each other. Since they cannot enter into one another, they cannot mix together. And without mixing, there can be no true contact between them.",
    " Verse 96 - On the Impossibility of Contact Between Partless Entities\n\nHow can something that is partless be said to make contact with anything? If you have seen something that is both partless and capable of making contact, please demonstrate it.\n\n---\n\n*Translation Note: This verse presents a philosophical challenge regarding the contradiction between being partless and making contact. In Buddhist atomistic debates, this argument undermines the idea that indivisible atoms could physically touch one another, since contact logically requires parts (at minimum, a part that contacts and a part that doesn't). The verse challenges proponents of atomism to demonstrate how such a contradiction could be resolved, implying that no such demonstration is possible because the concept itself is fundamentally incoherent.*",
    "Consciousness, being without physical form, cannot reasonably make contact with objects. And since a collection also lacks true existence, as was previously examined in detail, there can be no inherently real connection between consciousness and objects.",
    "Thus, if contact does not exist, how could feeling possibly arise? What purpose does all this striving serve? From what could harm come, and to whom?",
    "When there is no experiencer to be found\nAnd sensation itself does not truly exist,\nUpon seeing this reality,\nWhy would craving not dissolve?",
    "When something is seen or touched, it exists in the nature of a dream or an illusion. Because feelings arise simultaneously with the mind that experiences them, these feelings cannot truly be seen or experienced by that same mind.",
    " Translation of the Buddhist Verse on the Nature of Experience\n\nWhat arises before or after is only remembered, not truly experienced. One does not experience oneself, nor is one experienced by others.\n\nIn more natural contemporary English:\n\nFeelings that arose in the past or will arise in the future can only be remembered or anticipated, but are never directly experienced in the present moment. A feeling cannot experience itself, nor can it truly be experienced by any consciousness other than itself. This reveals the ultimately illusory nature of what we consider experience.",
    "No experiencer of sensations truly exists.\nTherefore, sensation itself has no ultimate reality.\nSo in this collection of aggregates devoid of self,\nHow could suffering actually cause harm?",
    "The mind does not reside within the sense faculties,\nNor in forms and other objects, nor in the space between them.\nIt is neither inside nor outside,\nNor can it be found anywhere else.",
    "That which is neither found within the body,\nNor elsewhere apart from it, \nNeither mixed with the body nor existing separately anywhere—\nThis does not exist in the slightest way.\nTherefore, sentient beings are naturally beyond suffering.",
    "If consciousness exists prior to its object of knowledge,\nUpon what does it focus to arise?\nIf consciousness and its object of knowledge exist simultaneously,\nUpon what does it focus to arise?",
    "If the object of knowledge were to exist only after [the cognition], \nthen from what would that cognition arise?\nThus, the arising of all phenomena\ncannot be logically established.",
    "If conventional reality does not exist in this way, then how could the two truths possibly exist? And if conventional reality depends on yet another convention, how could sentient beings ever attain liberation from suffering?",
    "This is merely conceptual fabrication about others' minds,\nBut that is not one's own conventional reality.\nIf, after achieving nirvana, one still ascertains that conventional phenomena exist,\nThen they do exist relative to oneself; otherwise, conventional reality itself does not exist.",
    "The conceptualizing mind and that which is conceptualized are mutually dependent upon each other. All analytical investigations are expressed based on what is conventionally accepted in the world.",
    "When one employs analytical wisdom to examine phenomena, and then uses that same analytical process to investigate the analytical wisdom itself, this creates an endless regression. This is because if the discriminating knowledge that examines all things must itself be examined, there would be no end to this chain of examination.",
    "When the objects of analysis are thoroughly examined,\nNo basis remains for the analytical mind itself.\nBecause there is no foundation, nothing arises—\nThis is what is called nirvana, the state beyond suffering.",
    "For one who considers both the object and the cognition as truly existent, their position is extremely difficult to defend. If they claim that objects are established through the power of cognition, then what basis exists for the very existence of that cognition itself?",
    " Translation of Verse 113\n\nIf knowledge is established based on objects of knowledge,\nWhat then is the foundation for the existence of those knowable objects?\nIf both exist through mutual dependence on each other,\nThen both would ultimately lack inherent existence.\n\n Expanded Modern English Translation\n\nIf one claims that knowledge derives its existence from objects of knowledge, we must ask: what serves as the basis for the existence of these knowable objects themselves? The argument creates a circular problem. And if we suggest that knowledge and its objects exist purely through mutual dependence—each established only by virtue of the other—then we must conclude that both ultimately lack any independent, inherent existence. Like the concepts of 'long' and 'short' which exist only in relation to each other, neither knowledge nor its objects can stand alone. This mutual dependence reveals that both knowledge and knowable objects are empty of self-nature.",
    "If there is no son, how can one be a father?\nYet from where would a son arise without a father?\nWithout a son, there is no father,\nAnd likewise, both lack inherent existence.",
    "Just as a sprout arises from a seed,\nAnd the existence of that seed is understood through the sprout's emergence,\nWhen consciousness arises from objects of knowledge,\nWhy would one not similarly understand the existence of those objects?",
    "From a sprout, if through a separate cognition\nOne understands that 'a seed exists,'\nThen by what means is the existence of cognition itself known—\nThe cognition by which that object is understood?",
    "First, ordinary people can perceive through direct observation that all phenomena in the world have causes. Just as lotus stems and similar things display various differences, these variations arise from differences in their respective causes.",
    "If one asks what produces the diversity among causes, it is precisely from the differentiation of previous causes. \n\nWhy is a cause able to generate its effect? It is precisely from the power of previous causes.",
    "If one claims that a sovereign deity is the cause of all beings, then first tell me: what exactly is this sovereign deity? If you say it refers to the elements, very well then. Why exhaust oneself arguing over a mere difference in names?",
    "However, elements like earth are manifold in nature,\nImpermanent, without conscious movement, and not divine.\nThey can be trodden upon and are inherently impure—\nTherefore, they cannot possibly be Īśvara.\n\nIn modern English prose:\n\nHowever, material elements such as earth cannot be considered the supreme deity Īśvara. These elements exist as multiple substances rather than a unified entity. They are impermanent, undergoing continuous change and deterioration, unlike an eternal deity. They lack conscious intention in their movements and effects. They are not divine beings worthy of worship. These elements can be stepped on and traversed by ordinary beings, which would be inappropriate for a supreme deity. Finally, they possess inherent impurity, whereas a divine being would be characterized by purity. For these reasons, physical elements cannot be equated with Īśvara.",
    "The Creator cannot be space, as space lacks the capacity for action. The Creator cannot be a permanent self, as this has already been refuted. And what purpose is served by claiming an inconceivable agent? If the Creator is truly inconceivable, even the assertion of such a Creator becomes meaningless.",
    "What exactly does the divine creator wish to produce? If it is supposed to be the self, then surely this self—along with the elements like earth, and the divine lord himself—is considered permanent in their own system? Furthermore, consciousness arises from its objects of knowledge, and...",
    "Happiness and suffering arise from karma that has no beginning.\nTell me, what exactly has this [creator deity] produced?\nIf a cause has no beginning,\nHow could its results have a beginning?",
    " Translation\n\nWhy does God not create continuously?\nHe does not depend on anything else.\nIf nothing exists that he has not created,\nThen what could his creative activity possibly depend on?\n\n Alternative prose translation\n\nIf God truly exists as the universal creator, why doesn't he create effects continuously? This cannot be explained by saying he depends on other conditions, because he supposedly does not rely on anything else. If nothing exists that was not created by him—including any conditions for creation—then what could his act of creation possibly depend on that would explain why effects occur only occasionally rather than constantly?",
    "If a creator deity depends on a collection of causes and conditions, then that collection itself becomes the true cause, not the deity. When the collection of causes and conditions is present, the deity has no power to prevent the result from arising. And without these causes and conditions, the deity lacks the power to produce any result at all.",
    "If the divine Lord acts unwillingly,\nIt follows he would be subject to others' control.\nIf he acts willingly, he becomes dependent on his desires.\nHow can one who acts with such dependence truly be a sovereign Lord?",
    "As for those who claim that atoms are permanent—the Vaiśeṣikas and Mīmāṃsakas—they have already been refuted earlier through the reasoning that demonstrates how atoms can be divided into directional parts. The Sāṃkhyas, for their part, assert that primordial nature (pradhāna) is permanent and serves as the cause of the world and all living beings.",
    "When the three qualities—sattva (clarity), rajas (energy), and tamas (darkness)—remain in perfect equilibrium, this state is called pradhāna (the Primary Principle). When these qualities fall out of balance, they are said to manifest as the phenomenal world.\n\n*Alternative translation in more accessible language:*\n\nWhen the three fundamental qualities—clarity, energy, and darkness—exist in perfect balance, this balanced state is known as the Primary Principle (pradhāna). However, when these qualities become unbalanced, they manifest as the diverse phenomena of the world we experience.",
    "It is illogical for a single entity to possess three distinct natures simultaneously. Therefore, such a primordial substance cannot exist. Similarly, the three qualities themselves cannot truly exist either, since each of these qualities individually would also need to be threefold in nature.",
    " Translation of Verse 130\n\nIf the essential qualities are absent, then the very existence of things like sound becomes extremely remote. Similarly, pleasure and such experiences cannot possibly exist in unconscious objects like clothing.",
    "If things truly exist as having the nature of their causes, haven't we already thoroughly examined and refuted the existence of such things? Moreover, according to your view, pleasure and similar feelings are themselves the causes [of material things], yet it's evident that things like cloth do not arise from such feelings.",
    "Pleasure and similar sensations arise from cloth and similar objects. Yet because these objects themselves do not truly exist, the pleasure and other sensations derived from them cannot truly exist either. Furthermore, pleasure and similar experiences are never observed to possess permanence at any time.",
    "If experiences like happiness are truly manifest and inherently exist, why aren't they continuously apprehended by consciousness? If one claims that this same happiness merely becomes subtle [when not experienced], how can it be both coarse and subtle? How can a single entity possess these contradictory states?",
    "When the gross form is discarded and transforms into the subtle,\nBoth the subtle and gross states are themselves impermanent.\nSimilarly, why would one not accept\nThat all entities are likewise impermanent?",
    "If you claim that gross physical form is not different from pleasure, then clearly pleasure must be impermanent. If you argue that 'Nothing that previously did not exist can arise, because non-existence cannot produce existence,' you contradict yourself. For even though you are unwilling to accept it, the fact remains that you have already established that manifestation arises from what previously did not exist.",
    " Translation of the Tibetan Buddhist Text\n\nIf effects truly existed within their causes,\nThen eating food would be the same as consuming filth.\nAnd for the price of cloth, you might as well\nPurchase cotton seeds and wear them as your garment.\n\n Modern English Translation (Prose Version)\n\nIf effects inherently resided within their causes, as some philosophers claim, then eating ordinary food would be equivalent to consuming impure substances. Similarly, you might as well purchase cotton seeds for the price of finished cloth and attempt to wear those seeds as clothing. These absurdities reveal the contradiction in believing that effects pre-exist in their causes.",
    " Translation\n\n'If the world does not see [the effect in the cause] due to ignorance, then why don't those who claim to know reality act according to this supposed truth?'\n\n*Alternative rendering for more contextual clarity:*\n\n'If ordinary people fail to see cloth already existing in seeds merely because of their ignorance, as you claim, then why don't your own wise teachers who supposedly know this reality wear cotton seeds as garments instead of woven cloth?'",
    "If this knowledge exists even among ordinary people, why then do they not see it? If ordinary perception is not a valid means of knowledge, then even the clear things we perceive cannot be considered true.",
    "If valid means of cognition are not ultimately valid,\nWouldn't the objects they measure be false?\nTherefore, meditation on emptiness\nAs the true nature of reality would not be tenable.\n\n---\n\n Modern English Translation (Prose Version)\n\nIf valid cognition is not truly valid, as you Madhyamikas claim, wouldn't the objects measured by such cognition also be false? If the means of measuring reality are themselves invalid, then how can we trust what they establish? Following this reasoning, meditation on emptiness as the ultimate nature of phenomena would be logically untenable, as the very understanding of emptiness would be established through unreliable means.",
    "Without touching upon a mentally constructed entity, one cannot apprehend its non-existence. Therefore, whatever entity is false, its non-existence is likewise clearly false.",
    "Therefore, when in a dream one's child has died,\nThe thought 'this child does not exist'\nServes as an obstacle to the conception\nThat 'the child exists' - yet this thought too is false.",
    "Therefore, through this kind of careful analysis, we can see that nothing whatsoever exists without a cause. Nor does anything inherently exist within its conditions, whether these conditions are considered individually or as a collective whole.",
    "It neither comes from elsewhere,\nNor does it abide, nor does it go away.\nHow does this, which the deluded take as real,\nDiffer in any way from an illusion?",
    "Examine carefully: that which is created by illusion, and that which is produced by causes—where does it come from, and where does it go?",
    "When something appears due to the presence of certain causes, but does not appear when those causes are absent, it is artificially constructed, just like a reflection in a mirror. How could such a thing possess any inherent truth or reality?",
    "For an entity that already exists,\nWhat need is there for a cause?\nAnd if that entity does not exist at all,\nWhat need is there for a cause?",
    "Even with a hundred million causes,\nThat which does not exist cannot be transformed.\nHow could something in a state of non-existence become real?\nAnd what other thing could transform into existence?",
    "If a thing cannot exist during its time of non-existence, when would it ever become existent? Without having first arisen as an entity, it cannot become separated from its non-existence.",
    "If something is not free from non-existence,\nThere can be no opportunity for its existence.\nLikewise, what exists cannot transform into non-existence,\nFor this would entail the absurdity of having two contradictory natures.",
    "Thus, there is no cessation, nor are there inherently existing entities. Therefore, all sentient beings and worlds are, in their ultimate nature, never born and never cease.",
    "Sentient beings are like dreams,\nAnd when thoroughly analyzed, they resemble plantain trees.\nBetween what we call nirvana and what is not nirvana,\nIn ultimate reality, there exists no difference.",
    "In these phenomena that are thus empty of inherent existence,\nwhat can truly be gained and what can truly be lost?\nWho is there to be honored or respected,\nand who is there to be completely disdained?",
    "From where do happiness and suffering arise? What is there to like, and what is there to dislike? If one searches for their true nature, who is it that experiences craving, and toward what is that craving directed?",
    "When carefully examined, what is this world of the living? Who truly dies here? Who will come into being, and who has already existed? Who is truly a relative, and who is genuinely a friend?",
    "May people like myself regard all things as being like the sky—\nBeings who desire happiness for themselves\nThrough causes of conflict and excitement\n[End up creating these very causes of suffering].",
    "Caught in agitation and fleeting pleasures, beings endure immense hardship through their harmful actions. They experience grief, exhaust themselves in futile struggles, and engage in bitter disputes. They inflict wounds upon each other, cutting and piercing one another in conflict. Through such negative deeds, they sustain their lives with great difficulty, all while deluding themselves that these actions will bring satisfaction.",
    "They return again and again to fortunate realms,\nWhere they experience numerous pleasures.\nBut after death they fall into the lower realms,\nSuffering torments that are prolonged and unbearable.",
    "In the realm of cyclic existence, there are many dangerous precipices. In such a place, there is nothing resembling true reality. Furthermore, since there is mutual contradiction between the two, such ultimate reality cannot exist within cyclic existence.",
    "There in cyclic existence, incomparable and unbearable oceans of suffering extend beyond all limits. In such a state, beings possess very little strength, and their lives are indeed exceedingly brief.",
    "Even during this brief existence, life is consumed by efforts to survive and maintain health, by the fatigue of hunger and exhaustion, by time spent sleeping and enduring various harms. Similarly, one's time is wasted in fruitless associations with childish people.",
    "Life passes swiftly without purpose,\nAnd the wisdom of discernment is exceedingly difficult to find.\nEven then, how could there possibly be a method\nTo reverse the habitual patterns of distraction?",
    "Even in this context, demonic forces actively strive to cast beings into great lower realms of suffering. Here, numerous wrong paths abound, and doubt is exceedingly difficult to overcome.",
    " Translation of Shantideva's Verse\n\nOnce again, a precious human life with spiritual opportunity is exceedingly difficult to find. The appearance of a Buddha in this world is extraordinarily rare. The torrents of afflictive emotions are nearly impossible to overcome. Alas! How endlessly suffering continues in succession.",
    "How tragic! These beings deserve our deepest compassion. Though immersed in extreme suffering, they fail to recognize their own dire condition. Alas! How worthy of lamentation are these beings who remain adrift in the river of suffering!",
    "Just as someone who repeatedly bathes themselves and then repeatedly enters into fire, similarly, though they dwell in extreme suffering, they delude themselves into thinking they are happy.",
    "For those who live as if they were immune to aging and death, dwelling carelessly in their illusory state of immortality, severe consequences await. When death inevitably arrives first to claim them, they will fall into unbearable suffering in the lower realms.",
    "When will I be able to pacify those who are tormented by the fires of suffering? When will I shower them with resources of happiness that flow abundantly from the clouds of my merit, bringing them peace?",
    "When I have accumulated a collection of merit with deep reverence through the practice of non-referential awareness, I will teach the profound nature of emptiness to those who suffer because of their fixation on inherent existence.",
    "This concludes the ninth chapter of 'Introduction to the Bodhisattva's Way of Life,' entitled 'The Perfection of Wisdom.'"
  ],
  [
    "Through whatever virtue I have gained by composing this work on entering the Bodhisattva's way of life, may all beings engage in the conduct of awakening.\n\n*Alternative translation:*\n\nBy whatever goodness arises from my effort to compose this text on how to enter the Bodhisattva's way of life, may all beings be adorned with the practice of the path to awakening.",
    "May all beings throughout all directions who experience suffering in body and mind, however many there may be, obtain an ocean of happiness and joy through the power of my merit.",
    "For as long as cyclic existence endures, may these beings never lose their happiness. May all living creatures attain the uninterrupted joy experienced by bodhisattvas.",
    "May all sentient beings who dwell in the countless hell realms throughout the various world systems experience and rejoice in the supreme happiness of Sukhāvatī, the Land of Bliss.",
    "May those suffering from cold find warmth. Through the limitless rivers flowing from the great clouds of bodhisattvas, may those suffering from heat be cooled.",
    "May the forest of blade-like leaves transform for them into delightful pleasure groves.\nMay even the cotton trees with their cruel thorns be reborn as wish-fulfilling trees.",
    "May the regions of hell become delightful places adorned with the beauty of blue-winged teal, ruddy shelducks, swans, and other birds that emit melodious calls. May these realms be transformed into pleasant landscapes with lakes filled with lotuses that emit powerful fragrances, making these once-terrible places into realms of joy and delight.",
    "May these heaps of burning coals transform into mounds of precious jewels.\nMay the scorching ground become a crystal floor beautifully arranged.\nMay the crushing mountains become magnificent offering palaces\nFilled with the presence of the Blissfully Gone Ones (Sugatas).\n\n Prose Translation\n\nMay all those heaps of burning coals be transformed into piles of precious jewels. May the scorched earth become a smooth, crystal pavement. May the mountains that crush and destroy also become magnificent celestial palaces of offerings, completely filled with the perfectly realized Buddhas.",
    "May the rain of embers, heated stones, and weapons from this day forward transform into a shower of flowers.\n\nFrom this day onward, may the mutual attacks with weapons become instead the tossing of flowers for play and delight.",
    "Those immersed in the boiling river that resembles a pit of fire and offers no ford to cross,\nWhose flesh has completely disintegrated, leaving skeletal remains white as kunda flowers—\nMay they, through the power of my virtuous deeds, obtain divine bodies\nAnd dwell with celestial goddesses where the gentle waters flow.",
    "'Why are Yama's servants, along with those dreadful crows and vultures, suddenly terrified in this place? Who possesses this excellent power that dispels darkness from all directions and generates happiness and joy?' they wonder. Looking upward into the expanse of the sky, they behold Vajrapani blazing with radiance. Upon seeing him, may they—freed from their negative actions through the force of their overwhelming joy—be able to accompany him on his journey.",
    "A shower of flowers mixed with fragrant waters falls down,\nExtinguishing the blazing fires of hell with a hissing sound.\nAs those in hell, suddenly filled with unexpected joy, wonder, 'What is this?'\nMay they behold the Lotus-Handed One before them.",
    "Come quickly, friends! Cast away your fears, for we are alive! A certain radiant youth with a topknot has arrived among us, bringing fearlessness. Through his power, all our suffering has disappeared and waves of joy have arisen. The awakening mind has emerged, along with compassion—the mother of complete protection for all beings.",
    " Translation of the Verse on Mañjuśrī's Compassionate Appearance\n\nBehold him whose lotus feet are worshipped by the crowns of hundreds of gods, whose eyes are moist with compassion, upon whose head falls a shower of countless flowers. May the beings in hell realms now burst into joyful exclamations upon seeing Mañjuśrī before them, surrounded by magnificent celestial mansions, while thousands of divine maidens sing his praises in melodious voices.\n\nIn more natural, flowing English:\n\nLook upon this wondrous sight: Mañjuśrī, whose lotus feet receive the touch of hundreds of divine crowns in reverence, whose compassionate gaze flows with moisture born of loving-kindness for all beings. See how a cascade of countless flower blossoms showers upon his head, while he dwells amidst beautiful multi-tiered palaces. Around him, thousands of celestial goddesses fill the air with their melodious songs of praise. May all beings suffering in hell realms now witness this magnificent vision of Mañjuśrī and, upon seeing him, may their cries of pain transform into expressions of joy and wonder.",
    "Thus, through my virtuous deeds, may the beings suffering in the hell realms experience great joy upon seeing Samantabhadra and other bodhisattvas—like clouds free from all obscurations—causing cooling, pleasant showers with sweet-scented breezes to fall upon them. When these hell beings witness this refreshing rainfall bringing comfort and relief, may they be filled with tremendous happiness.",
    "May all animals be freed from the fear of devouring one another. May all hungry ghosts find happiness like the humans of Uttarakuru in the northern continent.",
    "May the stream of nectar flowing from the hands of noble Avalokiteshvara, the Lord of Compassion, satisfy all hungry ghosts and, as they bathe in it, may they be perpetually cooled and refreshed.",
    "May the blind regain their sight and behold visible forms,\nAnd may the deaf always be able to hear sounds.\nJust as the divine goddess Māyā gave birth miraculously,\nMay pregnant women deliver their children without harm or suffering.",
    "May those who are naked obtain clothing,\nMay those who hunger receive nourishing food,\nMay those who thirst find pure water,\nAnd may they all enjoy delicious drinks.",
    "May those who are impoverished obtain wealth.\nMay those afflicted with sorrow and suffering find joy.\nMay those who have fallen into despair be revived in spirit,\nAnd may they attain perfect, unwavering stability.",
    "May all sentient beings who are ill\nBe swiftly freed from their sickness.\nMay all diseases of living beings, without exception,\nNever arise again.\n\n---\n\n Prose Translation\n\nMay all sentient beings suffering from illness be quickly liberated from their afflictions. May every disease that affects living beings—without a single exception—permanently cease to arise.",
    "May those who are fearful become free from fear. May those who are bound be liberated.\nMay those without strength become powerful, and may all beings develop gentle hearts toward one another.",
    "May all travelers in every direction journey in safety and comfort. May whatever purpose for which they travel be accomplished effortlessly, fulfilled naturally without requiring struggle or hardship.",
    "May those who embark on journeys by boat or great ship have all their heart's desires fulfilled. Having safely reached the shore, may they rejoice together with their loved ones.",
    "May those who have lost their way on sorrowful paths find companions on their journey. May they proceed without weariness and with ease, free from fears of thieves, tigers, and other dangers.",
    "May the divine protectors safeguard those who are asleep, intoxicated, or completely inebriated; children and the elderly who have no guardians; and all who find themselves in remote monasteries or other perilous, pathless places.",
    "May all beings be liberated from every state that lacks spiritual opportunity, and be endowed with faith, wisdom, and loving compassion. May they obtain excellent sustenance and conduct, and always remember their previous lifetimes.",
    "May all beings possess inexhaustible resources like the sky-treasury, with enjoyments that never become depleted. May they live without conflict and free from harm, able to enjoy their lives with complete independence.",
    "May all sentient beings who possess little radiance and majesty be transformed into beings of great splendor. May those ascetics who have become physically deformed through their austerities attain perfectly beautiful bodily forms.\n\n*Expanded Translation:*\n\nMay all sentient beings who currently possess little radiance or charisma—those who are overlooked or ridiculed because of their unimpressive appearance—be transformed into beings of magnificent presence and great majesty. May they no longer suffer from others' contempt but instead be able to act with dignity and independence. And may those devoted practitioners who have endured harsh austerities—whose bodies have become emaciated or disfigured through exposure to extreme conditions, lack of food, or other spiritual hardships—attain perfectly beautiful and well-formed bodies while maintaining their spiritual discipline.",
    "May all women throughout the world attain masculine form. May those of low status achieve high positions, and may their pride be overcome.",
    "Through this merit I have generated, may all beings without exception abandon every negative action and continuously engage in virtuous conduct.",
    "May we never be separated from the awakening mind, and may we be devoted to the practices that lead to enlightenment. May we be fully embraced by all the Buddhas, and may we completely abandon all actions that serve as obstacles to spiritual progress.",
    "May all sentient beings have immeasurably long lives. May they always live in happiness and well-being, and may even the very sound of death never be heard among them.",
    "May all directions be filled with delightful gardens of wish-fulfilling trees, populated by Buddhas and Buddha's children who captivate minds with their melodious proclamations of the Dharma.",
    "May the ground everywhere become free from gravel and other impurities, level like the palm of a hand, and remain naturally smooth with the essence of lapis lazuli.",
    "In all the gathering places throughout the world, may many bodhisattvas take their seats and adorn the surface of the earth with their magnificent qualities.",
    "May all sentient beings continuously hear the uninterrupted sound of the Dharma emanating from birds, from all trees, from rays of light, and even from the sky itself.",
    "May they always meet with the Buddhas and the Buddha's spiritual children. With limitless clouds of offerings, may they make offerings to the teachers of all beings.",
    "May the deities send rainfall in the proper seasons,\nMay harvests be abundant and plentiful,\nMay rulers govern according to the principles of dharma,\nAnd may the world and its inhabitants flourish.\n\n---\n\n Modern English Prose Translation\n\nMay the gods bring timely rains when they are needed, creating the natural conditions that support life and practice. May crops and harvests be abundant and successful, providing the material foundation for both sustenance and spiritual development. May those who rule and lead do so in accordance with righteous principles, upholding dharmic values in both religious and secular affairs. And may the entire world—both the natural environment and all beings who dwell within it—thrive in prosperity, happiness, and well-being.",
    "May all medicines be endowed with healing power. May the recitation of sacred mantras be successful for those who practice them. May ḍākinīs, rākṣasas, and all such beings be filled with compassionate minds.\n\nMay all medicines be imbued with their full healing potential. May those who recite sacred mantras achieve the results they seek. May all sky-travelers, spirits, and potentially harmful beings be filled with compassion instead of malice.",
    "May no sentient being suffer pain,\nMay none commit harmful deeds or fall ill,\nMay none be intimidated or despised,\nAnd may no one experience mental distress.",
    "May monasteries be filled with the sounds of study and recitation, flourishing as vibrant centers of learning. May the monastic community always remain in harmony, and may all their noble aims be successfully accomplished.\n\n---\n\n Detailed Translation\n\nMay all monasteries and temples be adorned with the activities of reading sacred texts and melodious recitation from memory, and may these sacred institutions remain well-established and flourish. May the monastic community always maintain harmony and unity in their endeavors, free from division or conflict. Furthermore, may all the spiritual goals and practical objectives of the Sangha be fully accomplished according to their aspirations.\n\nThe verse expresses the wish that Buddhist monasteries serve their essential purpose as centers where the teachings are continuously studied, recited, and contemplated. It emphasizes the importance of both intellectual engagement with texts and their embodied practice through recitation. The second part of the verse focuses on the monastic community itself, highlighting the dual importance of harmony among its members and the fulfillment of their spiritual mission—both their own progress toward liberation and their responsibility to preserve the Buddha's teachings for the benefit of all beings.",
    "May monks who aspire to proper training obtain true seclusion. Having abandoned all distractions, may they cultivate a mind that is workable and receptive to meditation.",
    "May the nuns be well-provided for with their necessities, and may they be free from quarrels and harmful behavior. Likewise, may all those who have left worldly life to become monastics maintain their moral discipline without deterioration.",
    "When I become disheartened by my moral failings,\nMay I always work to eliminate negative actions.\nHaving attained a fortunate rebirth,\nMay my spiritual commitments remain unbroken even there.",
    "May scholars be honored and respected, and may they easily obtain the alms they need. May their minds be completely purified, and may their good reputation spread throughout all directions.\n\n Expanded Translation\n\nMay the learned ones be respected and honored, and may they receive ample provisions through alms-giving. May their mental streams be thoroughly purified, and may their noble reputation spread in all directions throughout the world.",
    "May they never experience the sufferings of the lower realms, and without needing to undergo difficult austerities, may they swiftly attain Buddhahood with a body more sublime than even the gods.",
    "May all sentient beings make abundant offerings to all the Buddhas, and may they forever dwell in happiness through the inconceivable bliss of Buddhahood.",
    "May the aspirations of the bodhisattvas for the welfare of all beings be completely fulfilled. May all sentient beings receive exactly what these protectors have envisioned for them.",
    "Likewise, may all Pratyekabuddhas and Śrāvakas experience happiness.",
    "Through the kindness of Mañjuśrī, until I attain the Ground of Perfect Joy, may I always remember my past lives and obtain the renunciant's life in every rebirth.",
    "May I sustain myself with simple food while maintaining my vitality and strength. Throughout all my future lifetimes, may I obtain perfect conditions for dwelling in solitude.",
    "Whenever I wish to see the divine face of Mañjuśrī or desire to ask even the smallest question, may I behold that very protector, Mañjuśrī himself, without any obstacles or hindrances.\n\nIn other words: May I, without any impediment, directly perceive Lord Mañjuśrī whenever I wish to gaze upon him or whenever I seek answers, even to minor inquiries. May this wisdom deity be immediately accessible to me, revealing himself clearly and directly as my spiritual protector and guide on the path of wisdom.",
    "For the benefit of all sentient beings throughout the ten directions, extending to the very limits of space, I aspire to conduct myself exactly as Mañjuśrī does. Just as he works tirelessly to fulfill the welfare of all beings, may my own actions likewise be dedicated entirely to accomplishing the well-being of all sentient creatures.",
    "For as long as space itself endures, and for as long as living beings remain in this world, may I too continue to exist, dedicated to dispelling the sufferings of all beings.",
    "Whatever suffering exists in the world, may all of it ripen upon me. Through the virtuous actions of all bodhisattvas, may all beings experience happiness.",
    "The unique medicine for all beings' suffering,\nThe source from which all happiness arises,\nMay the teachings, along with material support and reverence,\nRemain in this world for a very long time.",
    "I bow to Mañjughoṣa, by whose kindness virtuous thought arises in me. I also pay homage to my spiritual guides, through whose kindness I have grown and flourished.",
    "This concludes the tenth chapter entitled 'Dedication of Merit' from the Guide to the Bodhisattva's Way of Life.\n\nHere ends the Guide to the Bodhisattva's Way of Life, composed by Master Śāntideva.",
    "This text was first translated from a Kashmiri manuscript by the Indian preceptor Sarvajñadeva and the great translator Bande Paltsegs, who established a definitive Tibetan version. Later, this translation was revised by the Indian preceptor Dharmaśrībhadra working together with the great translators Bande Rinchen Zangpo and Śākya Lodrö. They compared it with a manuscript from Central India and its commentary, made corrections, and established an improved version.\n\nSubsequently, at a later time, the Indian preceptor Sumatikīrti and the great translator monk Loden Sherab thoroughly corrected and retranslated the text, establishing an excellent definitive version."
  ]
]