[
  "",
  "**Commentary to the Heart Sutra: A Wondrous Explanation of the Words of the Essence of Wisdom Sutra. Explanation of the Words of the Heart Sutra.**",
  "",
  "",
  "Homage to the Buddha!\n\nA brief explanation of the meaning of the Heart Sutra of the Perfection of Wisdom:\n\nAlthough the term \"Perfection of Wisdom\" (Prajnaparamita) applies to many things, the actual and primary meaning is the non-dual wisdom of the suchness of all phenomena, the Tathagatagarbha (Buddha-nature). This Sutra reveals the essence of that Perfection of Wisdom, specifically its characteristics of being free from elaboration (niṣprapañca), immutable (avikāra), and all-pervasive (sarvākāra). These three are the principal meanings. Because the words are extremely concise, it is called the \"Heart.\"\n\nHow does it reveal these? By phrases such as \"Form is empty...\" and so forth, it reveals all-pervasiveness.",
  "",
  "",
  "\"Thus I have heard,\" and so forth. At the Vulture Peak Mountain, a part of the royal city of Rajagriha, the Teacher, the Bhagavan Shakyamuni, together with a great assembly of monks, namely, the Sangha of Arhat-Shravakas, and a vast Sangha of noble Bodhisattvas gathered from various buddhafields, were dwelling together in unison. At one time when the entire assembly of disciples had become vessels for this Dharma and their continuums were ripened, I, the compiler Vajrapani, heard these words of the Heart Sutra of the Perfection of Wisdom, without error. This establishes the definite place and time, and sets the assembly of disciples as witnesses, so that certainty is generated that it is the word of the Teacher, and wondrous faith is aroused.",
  "At that time, the Blessed One, and so forth. Because it is difficult to realize, it is profound, namely, the state of reality, the Perfection of Wisdom. The wisdom that directly realizes that is *snang-ba* (appearance/manifestation), meaning the meaning of directly seeing. The meditative equipoise endowed with that wisdom is *ting-nge-'dzin* (samadhi). Although the Blessed One constantly abides in that *ting-nge-'dzin*, to the perception of the disciples gathered there, it appears as if he newly enters into meditative equipoise on that *ting-nge-'dzin* of profound *snang-ba*.",
  "Furthermore, at the very moment when the Bhagavan had just entered into equipoise, the Bodhisattva Mahasattva, the noble Avalokiteshvara, also, through the wisdom of manifestly realizing and practicing the profound Prajnaparamita, [experienced] the meditative equipoise, a form of analytical insight connected with samadhi.",
  "Remaining in the wisdom of knowledge (mkhyen pa'i ye shes), and the cause for directly engaging in such Prajñāpāramitā, one contemplates and meditates on the five aggregates (phung po lnga po) as being empty, unestablished by their own nature (rang bzhin gyi ngo bos ma grub cing stongs par), in the aspect of wisdom (ye shes kyi rnam par blta zhing sgom mo).\n\nThat very emptiness of the five aggregates by their own nature (phung po lnga po rang bzhin gyi stong pa de nyid), is shown as separate from the profound Prajñāpāramitā (sher phyin zab mo las logs su bstan pas). Therefore, the profound Prajñāpāramitā is established as not being empty by its own nature (sher phyin zab mo ni rang gi ngo bos mi stong par grub pa'i phyir). This is the first statement that clearly demonstrates Other-Empty Madhyamaka (gzhan stong dbu ma gsal bar ston pa'i tshig dang po'o).",
  "Having just shown the manner of newly entering into meditative equipoise on the Prajnaparamita of Avalokiteshvara, \"then,\" thus connecting the earlier and later (sections). \"Then, by the power of the Buddha,\" and so forth. Although the Shravakas, such as Shariputra, are unable to even write down this profound Dharma by their own power, through the power of the Buddha's blessing, the venerable Shariputra spoke thus to the Bodhisattva Mahasattva, the noble Avalokiteshvara:",
  "What is said [here]? Whether a son of good family or a daughter of good family, whichever it may be, whoever among them generates the mind of enlightenment and wishes to engage in, to practice, this profound Perfection of Wisdom through the three doors of hearing, contemplation, and meditation – how should the method of meditation be taught? That is [the question].",
  "Translation:\n\nReply [Section]: Second, regarding the reply, [it consists of]: A concise presentation of the manner of engaging with the Perfection of Wisdom; a detailed explanation of the essence of the Perfection of Wisdom; a presentation of the benefits of the path that realizes it; an explanation of the fruit realized by that path; a presentation of the *dhāraṇī mantra*, along with its benefits; and advice on training in the Perfection of Wisdom in the manner of summarizing the meaning. [4] First: A concise presentation of the manner of engaging with the Perfection of Wisdom.",
  "\"De-ke so-te,\" etc. That is, after Shariputra spoke thus, in response to that, the Bodhisattva Mahasattva, the noble Avalokiteshvara, spoke thus to Shariputra.",
  "What is meant by \"How so?\" [It means:] Whichever son or daughter of good family desires to engage in the practice of the profound Perfection of Wisdom, that one should thoroughly examine and contemplate in this manner. Here, \"engage\" (Tib. *spyad pa*) is a verb indicating something to be practiced, an object of action. \"Practice\" (Tib. *spyod pa*) refers to the manner of practice, a verb indicating the act of doing. Therefore, [the question is] what is the manner of practicing that which is to be practiced, the Perfection of Wisdom? That is to say, regarding whatever Perfection of Wisdom is to be taken into experience, by what method, in what manner, does one desire to take it into experience?",
  "The nature of conduct (spyod pa'i ngo bo ni) is the ten virtuous actions (chos spyod bcu) and the six perfections (phar phyin drug), and so forth. How should one view them? One should view and meditate on all phenomena of appearance and sound (snang grags kyi chos de dag thams cad), through the divisions of the five aggregates (phung po lnga po de dag) and also the elements (khams) and sense bases (skye mched), and so forth, as not established by their own nature or own essence (rang bzhin nam rang gi ngo bos ma grub pa'i tshul gyis), in a way that is unerring, on the authentic reality (yang dag pa'i gnas lugs la), in accordance with the reality by means of the subject, the wisdom of meditation (yul can sgom pa'i ye shes kyis kyang gnas lugs dang rjes su mthun par blta zhing sgom mo).",
  "5) Extensive Explanation of the Essence of the Perfection of Wisdom. 6) Definitive Establishment of the Perfection of Wisdom as Intrinsic Nature. First:",
  "\"Form is emptiness,\" and so forth. If we combine the two truths in common, then, in this place where form appears as a physical aggregate to ordinary beings, namely, children and individuals, form as a physical aggregate is not existent. This is because that form is merely an illusion and is empty of its own intrinsic nature. Therefore, from the perspective of form's own inherent existence, it is emptiness, being neither existent nor non-existent.",
  "In the wake of form, the emptiness of phenomena abides; that very thing is emptiness itself. This is the emptiness that is true, existent, and real. Although to childish ordinary beings, the emptiness of phenomena, which exists in its own state, appears as the form aggregate, it is merely an illusory appearance and lacks inherent existence.",
  "Taking form as the basis of distinction, other than that, the *dharmadhātu* emptiness does not exist separately. This is because the very place where the appearance of form arises is the *dharmadhātu*. And, the basis of distinction, the aggregate of form itself, has never existed.",
  "Because there is no possibility of establishing distinct individual entities within the nature of form, and because the wisdom of suchness is free from elaboration, and because it does not hold the characteristic of being a separate entity that is equivalent to form, therefore... If emptiness, the dharmadhatu itself, is taken as the basis of distinction, then form does not exist apart from it, because even when suchness abides, there is no form, and also because of the aforementioned reasons.\n\nFor example, when someone with jaundice looks at a conch shell, they will not see it as a white, swirling mass, but will see it as a yellow, swirling mass. Although they see it as yellow and swirling, that yellow swirling is merely an illusion and does not exist from the beginning, while the white does exist. Therefore, contemplating the unity of the basis of the appearance of the yellow and the white, which are not different, the yellow appearance is not other than the conch. The conch is that yellow you see. There is no conch other than the yellow you see. The yellow you see is not established apart from the conch. This is like saying that, and it is very meaningful.\n\nAccording to those who assert self-emptiness, since they consider emptiness to be the pervader of ultimate truth, it would follow that form is ultimately true. It is appropriate to say that emptiness is not form and is not other than form, but it is not acceptable to say, \"Form is empty\" or \"Emptiness is form.\" Thus, this is the second statement that clearly reveals the great other-emptiness Madhyamaka.\n\nExplaining it in this way is presenting it as the explicit negation in this sutra, but if explained according to the hidden meaning, it is solely an affirmation: whatever is the form of ultimate suchness is the wisdom of emptiness, and whatever is the wisdom of emptiness appears as the form of suchness. By showing this, even if one understands only that the two share a common basis, the doubt might arise that the wisdom of emptiness might not be the form of ultimate truth, or that the form of ultimate truth might not be the wisdom of emptiness. To dispel this doubt, [it says] \"even from form,\" and so forth.\n\nHere, in this context, \"emptiness\" is not merely an empty void, but the wisdom of two-emptiness. Although the form aggregate of ultimate truth is not a form aggregate, the ultimate aspect of the form aggregate within all aspects of the dharmadhatu is called the form aggregate of suchness, or the form aggregate of ultimate truth.",
  "And similarly, apply the same reasoning to the subsequent ones. Thus, feeling, discrimination, compositional factors, and consciousness are empty. Emptiness is from feeling up to consciousness. From feeling up to consciousness, emptiness is not other. And from emptiness, feeling up to consciousness is not other. Thus, it is to be applied.",
  "The concluding summary of the exposition on suchness of emptiness is as follows:",
  "Therefore, all phenomena are emptiness, that is to say. As it is said: \"Except for the expanse of phenomena, since there are no phenomena, therefore,\" so spoke the Venerable One.",
  "The meaning of \"without characteristics\" (མཚན་ཉིད་མེད་པ་) is as follows: In the relative truth (ཀུན་རྫོབ་), because it is empty of its own intrinsic nature (རང་གི་ངོ་བོས་སྟོང་པའི་ཕྱིར་), it lacks that and its characteristics (དེ་དང་དེའི་མཚན་ཉིད་མེད་དེ།). Just as a pot does not exist truly (བུམ་པ་བདེན་པར་མེད་པས་), so too the characteristic of a pot does not exist truly (བུམ་པའི་མཚན་ཉིད་ཀྱང་བདེན་པར་མེད་པ་བཞིན་ནོ།).\n\nIn the ultimate truth (དོན་དམ་), although it exists by its own intrinsic nature (རང་གི་ངོ་བོས་ཡོད་ཀྱང་།), the characteristic of the ultimate truth is not established by its own nature (དོན་དམ་གྱི་མཚན་ཉིད་རང་བཞིན་གྱིས་མ་གྲུབ་སྟེ།). This is because the three – the characteristic, that which is characterized, and the basis (མཚན་མཚོན་གཞི་གསུམ་) – are merely conceptual designations (བློས་བཞག་པ་ཙམ་ཡིན་གྱི་), and do not exist in the way things actually are (གནས་ལུགས་ལ་མེད་པས་སོ།).\n\nSimilarly, because there is no arising (སྐྱེ་བ་མེད་པའི་ཕྱིར་), it is said that there is no ceasing (འགག་པ་མེད་ཅེས་བྱ་སྟེ།). These two, without arising and without ceasing (སྐྱེ་མེད་དང་འགག་མེད་འདི་གཉིས་ལ་ཡང་), are also similar to the previous explanation (སྔ་མ་དང་འདྲ་སྟེ།). In the relative truth (ཀུན་རྫོབ་ལ་ནི་), although there appear to be characteristics of arising and ceasing (སྣང་ངོ་ཙམ་དུ་སྐྱེ་འགག་གི་མཚན་ཉིད་ཡོད་ཀྱང་), they are merely illusory appearances (འཁྲུལ་སྣང་ཙམ་ཡིན་གྱི།).",
  "If conventional reality ( *kun rdzob*) were primordially non-existent, then, since there would be no basis for arising and ceasing in it, there would be no arising and ceasing. And although ultimate reality (*don dam*) exists as emptiness of its own inherent nature, since the three characteristics of arising, abiding, and ceasing are not established in it, it is unborn.",
  "Unceasing. Thus, emptiness is the meaning of emptiness of conditioned phenomena. Therefore, conditioned phenomena, characteristics, arising, and ceasing are all shown to be merely imputed ( *kun brtags* ), and thus non-existent. The nature of phenomena ( *chos nyid* ), however, is the meaning of emptiness of imputation.\n\nIf one thinks, \"It is not permissible to make merely conditioned phenomena into imputation,\" although it is not the case that if something is conditioned, it is necessarily imputed, the characteristic of imputation applies to all conditioned phenomena, because all conditioned phenomena, when condensed, are exhausted in the two: object and subject.\n\nOn top of the subject, there is the apprehension of an object. The appearance that the subject itself can independently stand apart is imputation. Therefore, that imputation applies to all consciousnesses. Although it appears that there is an external object apprehended separately from consciousness, it is imputation. That very imputation applies to forms and so forth, the objects, and to the sense faculties such as the eye and so forth.\n\nIt goes without saying that all other existent and non-existent things that are imputed are imputation. Therefore, the characteristic of imputation applies to all conditioned phenomena. Thus, the dependent nature ( *gzhan dbang* ) has the characteristic of imputation, and imputation also has the characteristic of the dependent nature.\n\nThe truly established ( *yongs grub* ) is not like that, but the truly established as imputed is also similar to that.",
  "Now, we shall enter into the main text. \"Dirt\" ( *drimā*) refers to *samsara*. This \"dirt,\" *samsara*, which appears as the arising of various sufferings due to the power of karma and afflictions, is also, by its own nature, non-existent.",
  "Freedom from defilement is nirvana. If enlightenment is attained by abandoning obscurations through meditating on the path, then the path itself is also not truly existent, because obscurations are without inherent existence. The appearance of being free from obscurations is merely a way of appearing to the mind, but is without intrinsic nature. Even though a perfectly enlightened Buddha is established as truly existent, the appearance of attaining that state is a way of appearing to the mind; therefore, it is merely conventional illusion.\n\nThus, these afflictions and the path to be purified are dependent arisings, and since it is shown that they are without intrinsic nature, it is shown that suchness is not tainted by dependent arisings, and that dependent arisings are empty of their own intrinsic nature.",
  "Regarding the ultimate expanse of reality ( *don dam dbyings* ), it appears that in the state of *samsara* qualities diminish, and in the state of *nirvana*, obscurations are abandoned and it appears to increase. However, these are merely the ways in which the minds of sentient beings in *samsara* and yogis perceive it. In actuality, there is no diminution.",
  "That which appears, in the time of *samsara*, to be filled with faults, and in the time of *nirvana*, to be filled with qualities, is also like what was stated before, not established as truly existent. The reason for this is that obscurations are primordially unestablished, and qualities are primordially inherent as one's own nature; therefore, the appearance of increase and decrease is merely a distorted perception.\n\nThis shows that the *parinispanna* ultimate truth is devoid of the *samvriti* relative truth of *samsara* and *nirvana*. Although the *parinispanna* ultimate truth wisdom pervades all of *samsara* and *nirvana*, it is not tainted by either *samsara* or *nirvana* individually. Because it is without them, it is without change or alteration, and therefore it is shown to be permanent.\n\nThis is the third statement that clearly explains *gzhan stong* Madhyamaka.\n\nThus, emptiness, signlessness, unborn, unceasing, stainless, devoid of stain, without decrease, and without increase – these are known as the eight profound characteristics. Therefore, the wisdom of the Prajnaparamita of inherent nature, emptiness, is from being emptiness up to being without increase.",
  "7) The Method of Meditating on the Perfection of Wisdom Path. 8) Becoming Skilled in the Aggregates.\n\nFirstly, training to become skilled in the aggregates is as follows:",
  "Shariputra, therefore, it is said that in emptiness, form is non-existent. The basis for praising [this] is the Sugata-garbha, the very mind of ultimate reality. In that perfectly established great emptiness, there are no adventitious stains, the conditioned phenomena, [and] no aggregates of form.",
  "**The Aggregate of Feeling Does Not Exist.**",
  "The Aggregate of Discrimination",
  "The Aggregate of Formation (འདུ་བྱེད་ཀྱི་ཕུང་པོ་མེད།):\n\nThis phrase, \"the aggregate of formation is absent,\" (འདུ་བྱེད་ཀྱི་ཕུང་པོ་མེད།) negates the existence of the aggregate of formation (འདུ་བྱེད་ཀྱི་ཕུང་པོ་). To understand this negation, we must first clarify what is meant by \"formation\" (འདུ་བྱེད་).\n\n\"Formation\" (འདུ་བྱེད་) here refers to all mental events that are neither consciousness (རྣམ་ཤེས་) nor feeling (ཚོར་བ་) nor discrimination (འདུ་ཤེས་). It encompasses all volitional activities (སེམས་པའི་ལས་), including virtuous (དགེ་བ་), non-virtuous (མི་དགེ་བ་), and neutral (ལུང་མ་བསྟན་) actions of mind. These formations are the forces that shape our experience and propel us through samsara.\n\nThe assertion that \"the aggregate of formation is absent\" (འདུ་བྱེད་ཀྱི་ཕུང་པོ་མེད།) does not imply the complete non-existence of all mental events aside from consciousness, feeling, and discrimination. Rather, it signifies the absence of inherently existent (རང་བཞིན་གྱིས་གྲུབ་པ་) formations.\n\nAs it is taught in the *Heart Sutra* (བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྙིང་པོ།): \"Form is emptiness, emptiness is form\" (གཟུགས་སྟོང་པ་ཉིད་དོ། སྟོང་པ་ཉིད་གཟུགས་སོ།). Just as form lacks inherent existence, so too do all the aggregates, including the aggregate of formation. They are dependently arisen (རྟེན་འབྱུང་) and empty of intrinsic nature (རང་བཞིན་སྟོང་པ་).\n\nTherefore, \"the aggregate of formation is absent\" (འདུ་བྱེད་ཀྱི་ཕུང་པོ་མེད།) points to the ultimate truth (དོན་དམ་བདེན་པ་) of emptiness (སྟོང་པ་ཉིད་). It is a statement about the lack of inherent existence, not a denial of conventional existence (ཀུན་རྫོབ་བདེན་པ་). While formations appear to exist conventionally, they are ultimately empty of inherent nature. Understanding this is crucial for liberation from suffering.",
  "\"The aggregate of consciousness does not exist.\" The reason for this is explained by \"Because of this, therefore,\" which refers to the nature of the eight profound aspects, from emptiness up to the absence of fulfillment. \"Shariputra\" is the vocative. The phrase \"In emptiness\" should be applied to everything up to \"there is also no non-attainment,\" serving as an initial clarifier.\n\nThis, having emptiness as its basis of distinction (khyad gzhi) of wisdom, shows that no conventional phenomena (kun rdzob kyi chos) exist in it. Therefore, it is the fourth statement that clearly reveals the Great Madhyamaka of Other-Emptiness (gzhan stong dbu ma chen po).\n\nAccording to those who are renowned for asserting Self-Emptiness (rang stong), it is not permissible to say, \"In emptiness, there is no form,\" because the basis of distinction, emptiness, is not established. Therefore, it is never appropriate to separately negate the distinguishing characteristic (khyad chos) of form in it. Furthermore, if one negates form and so forth in relation to the emptiness of Self-Emptiness, which is already established in the mind, it would follow that one is negating what has already been negated.\n\nAccording to those [Self-Emptiness proponents], the sutra statement should be translated and recited as, \"Formlessness is emptiness.\"",
  "9) Skillful Engagement with the Sense Bases. The second [topic], training in the sense bases, [is as follows:]",
  "In that wisdom of emptiness, there is no eye sense-sphere. Likewise, applying it in the same way, there is no ear, no nose, no tongue, no body, no mind sense-sphere. There is no form sense-sphere, no sound, no smell, no taste, no tangible object, no dharma sense-sphere.",
  "10) Training in Proficiency Regarding the Elements (Khams). The third [topic], training in proficiency regarding the elements (khams), is:",
  "Regarding that wisdom of emptiness, from the absence of the eye element up to the absence of the mind element, there is nothing. The six elements, namely the eye element, ear, nose, tongue, body, and mind element; and the six elements of forms, sounds, smells, tastes, tangible objects, and phenomena; and up to the element of the six consciousnesses, namely eye consciousness, ear consciousness, nose consciousness, tongue consciousness, body consciousness, and mind consciousness, there is also nothing.",
  "11) To Become Skilled in Dependent Arising. Fourth, training to become skilled in dependent arising:",
  "In the wisdom of emptiness, there is no ignorance, and extending to old age and death, there is no limb of ignorance. Similarly, apply this: there is no limb of formations, no limb of consciousness, no limb of name and form, no limb of the sense sources, no limb of contact, no limb of feeling, no limb of craving, no limb of grasping, no limb of becoming, no limb of birth, and no limb of old age and death.\n\nThrough cultivating the path, the limb of ignorance ceases, and there is no cessation. Similarly, apply this: there is no cessation of the limb of formations, cessation of the limb of consciousness, cessation of the limb of name and form, cessation of the limb of the six sense sources, cessation of contact, cessation of feeling, cessation of craving, cessation of grasping, cessation of becoming, and cessation of birth.",
  "Even up to the cessation and exhaustion of the branch of aging and death, there is also no [self].",
  "12) Training in Skillfulness Regarding Truth (Satya). Fifth, training in skillfulness regarding truth (satya) is:",
  "Just as the aggregates, elements, and sense-bases, as well as dependent origination, are not established upon emptiness, likewise, within the wisdom of emptiness, all suffering truths, all origin truths, newly attained cessation truths, and path truths are without inherent existence. Furthermore, the basis for abandonment and adoption, the cessation truth, is emptiness, and it negates all four truths, which are objects of adoption and rejection.",
  "13) To Become Skilled in What is Possible and What is Impossible. The sixth [training] is to train in becoming skilled in what is possible and what is impossible.",
  "In the wisdom of emptiness, there is no wisdom gathered by the path, and by that, there is also no definite emergence.",
  "And there is no obtaining of the individual states of the illusory results of phenomena.",
  "Moreover, there is no instance where the result is not obtained from its cause. The essential meaning of all these points should be understood as follows: For sentient beings in cyclic existence and all those who practice the path, the dharmadhatu appears as various deluded perceptions of the basis, such as forms, and as diverse appearances of the path and its result. They do not see the intrinsic nature of that reality. Therefore, since all those appearances of the basis and the path appear while being devoid [of inherent existence], it is taught that during the time of study and reflection, one should ascertain this in that way. Then, through meditation, one should release all phenomena, from the aggregates up to the unobtained [Buddhahood], into the essence of awareness, allowing them to self-liberate. One should remain equally in the wisdom of emptiness of inherent existence. This is taught.\n\nThis is essentially the same as explaining the three aspects of absence of inherent existence (ngo bo nyid med gsum). Therefore, even in the established conclusion of explaining the three aspects, the ultimate reality, the dharmadhatu that is perfectly abiding, is merely empty of adventitious obscurations. Therefore, some who think that these two ways of explaining are contradictory are greatly mistaken due to a lack of understanding.\n\nThus, by training in the three—aggregates, elements, and sense bases—from among the six [topics], one becomes skilled in the characteristics of the nature of phenomena. By training in dependent origination and the four noble truths, one becomes skilled in what to adopt and abandon, what to engage in and turn away from. And by training in what is possible and impossible, one becomes skilled in causes, conditions, and results.",
  "15) The Benefits of the Path of Realizing That. Third, the benefits of the path of realizing that are:",
  "Therefore, \"Bodhisattvas, etc.\" The phrase \"because there is no attainment\" clarifies the extreme. It is evident that it applies to everything up to and including \"formless.\" The primary mention of \"attainment\" is because, regarding the nature of reality, whether the cause can produce the effect, or whether the effect can be produced, neither is established. It should be understood that the others are included in this.\n\nTherefore, just as nothing, from form up to non-attainment, is established in the actual state of affairs, so too, that which Mahayanists must meditate upon is such that, in the intrinsic nature of the meditative equipoise wisdom of Bodhisattvas, cause and effect, along with agent and action, are primordially unestablished.",
  "Furthermore, the two obscurations, together with their imprints, which arise in the deluded perception as one's own mind, are primordially non-existent in the nature [of mind]. And the fear and dread of the suffering of samsara and of karma and afflictions are also never present in the nature [of mind].",
  "When non-existence is directly realized, the appearances of grasping and grasped, which are mistaken and inverted, are gradually abandoned. Ultimately, having completely transcended all delusion...",
  "Nirvana, the complete Buddhahood, will be perfected and touched (realized). The manner of gradually transcending the perverted views (or distorted perceptions) is through the stages of the Ground of Application (or Stage of Aspiration) and the ten grounds of the noble ones, up to the Vajra-like Samadhi.",
  "16) Explanation of the Fruit Attained by That Path. Fourth, the manner in which the fruit attained by that path becomes manifest is:",
  "\"Times Three, etc.\" means manifestly abiding in the three times, that is, all Buddhas who have appeared in the past, who are abiding in the present, and who will come forth in the future, also, by relying on this very profound Perfection of Wisdom, endowed with the eight characteristics...",
  "Having meditated with the six aspects of a scholar, one becomes a Buddha, having perfectly and completely awakened to unsurpassed enlightenment, or will become a Buddha. In the explicit teachings of all of these, only the selflessness of phenomena (chos kyi bdag med) is taught. The selflessness of the person (gang zag gi bdag med) is understood to arise implicitly.\n\nHowever, when it is said that a Bodhisattva does not meditate on the selflessness of the person, it means that one should not engage in a way of meditating on the selflessness of the person that establishes the aggregates (phung po) as the basis of negation, and then meditates on the absence of \"I\" or \"self\" on top of that. That is the meaning. But the selflessness of the person that is of the nature of freedom from elaboration (spros bral), that is precisely what the spiritual heirs of the Buddha should meditate upon.\n\nThe fact that no \"I\" or \"self\" is established in reality is the selflessness of the person. The fact that no knowable object of appearance and sound has ever existed in reality is the selflessness of phenomena. Since the former is included within the latter, by meditating on the selflessness of phenomena, the meditation on the selflessness of the person is implicitly accomplished.",
  "17) Showing the Dhāraṇī-mantra Together with its Benefits.\n\nFifth, showing the dhāraṇī-mantra together with its benefits:",
  "Therefore, \"of wisdom,\" etc. Thus, having become manifestly and perfectly enlightened, due to that, the appearance of the wisdom of manifest realization of the Perfection of Wisdom of intrinsic nature, gives rise to *vidyā-mantra*. It is concordant with the cause of the Dharma-kāya.",
  "The greatness of this mantra is that, because it accomplishes all desired aims and actions, it is a secret mantra of great *vidyā*.",
  "The essence of mantra transcends all mundane realms, and, overpowering the inferior vehicles, the very supreme wisdom manifests in the form of *vidyā-mantra*.",
  "What need is there to mention that this [mantra] accomplishes other desired activities? For one's own benefit, [it accomplishes] both the unequal and the equal, namely, the unsurpassed Buddhahood in both *samsara* and *nirvana*. This is the mantra.",
  "It is also a mantra that thoroughly pacifies all the suffering of sentient beings for the sake of others.",
  "Because the Dharmakāya is unfailing, it is not false; and because its own nature is unchanging and permanent, it is established as true. Therefore, since this mantra is of one essence with that Dharmakāya, it is unfailing and not false; thus, it should be understood as true. This is the meaning [of the preceding statement]. This is the fifth statement that clearly reveals the Great Madhyamaka of Other-Emptiness (gzhan stong dbu ma chen po).\n\nThe actual mantra of the Perfection of Wisdom (Sher Phyin), since it abides in the mind-stream of the Buddhas, is the actual Dharmakāya and actual true establishment (bden grub dngos). However, the appearance of it in the speech and mind of disciples and ordinary beings is not the actual [Dharmakāya], but since it is the cause for attaining that, it is indeed a truth that does not fail in attaining the result.\n\nHowever, even the arising of mantras such as this, spoken by the Victorious Ones, in the minds of ordinary beings who have not entered the path, is said to belong to the perfectly established (yongs grub) and to be uncontaminated (zag med).",
  "The mantra of the Perfection of Wisdom, endowed with that benefit, spoken and explained by the noble Avalokiteśvara, is:",
  "Tadyathā: This means, \"Thus it is.\"\n\nGate: \"Gone,\" meaning having departed and realized.\n\nThe two occurrences of \"gate\" indicate the realization of relative truth and ultimate truth.\n\nPara: \"Supreme,\" meaning the way things are.\n\nGate: Realized.\n\nAgain, para: \"Supreme.\"\n\nSam: \"Perfectly.\"\n\nGate: Realized.\n\nBodhi: \"Enlightenment,\" meaning the wisdom that realizes the way things are of the two truths without any distortion. \"Enlightenment\" also means having become one taste with the dharmadhātu.\n\nSvāhā: \"May the foundation be established,\" meaning that which brings about the accomplishment of the end of the mantra.",
  "18) Advice on Training in the Perfection of Wisdom as a Summary of the Meaning. The sixth, advice on training in the Perfection of Wisdom as a summary of the meaning, is as follows:",
  "Shariputra, Bodhisattva, and so forth: Having addressed Shariputra, [it means that] Bodhisattvas, great beings, should train in the profound Perfection of Wisdom, endowed with the eight characteristics, through such means as the six skillful methods and so forth.",
  "(19) Dispelling Doubt Through Concordance. Second, dispelling doubt through concordance:",
  "Then, \"Bhagavan,\" and so forth: Following that explanation, then, the manner in which the Bhagavan arose from that samadhi called \"Profound Illumination\" is shown.",
  "Having given the salutation \"Well done!\" to the Bodhisattva Mahasattva, the noble Avalokiteshvara, this is the brief indication. As it is said:\n\n\"Wonder and dispute,\nAnger and dejection, certainty and grasping,\nJoy and faith – from these,\nA single word arises twice.\"\n\nAccording to this [verse],...",
  "Rapturously delighted, [one says] \"Excellent! Excellent!\"",
  "Having addressed him with the term \"Son of the Lineage\" [ *rigs kyi bu* ] in order to turn his gaze [towards the speaker], [he says:] \"That which you have explained is precisely as it is, without error.\"",
  "That is indeed just as it is.",
  "For that reason, just as you, Avalokiteśvara, have shown, so too should you, the assembly gathered there, including Śāriputra and others, practice in that way, through the doors of the six perfections and so forth, being skilled in the profound Perfection of Wisdom.",
  "This explanation by Avalokiteśvara, and this practice in accordance with it by the other assemblies, I, the present Bhagavan Shakyamuni, not only rejoice in, but all the Tathagatas of the ten directions also rejoice after me.\n\nThus spoke the Lion of the Shakyas, the Teacher, from the *Śrī-gītā* (Glorious Song).",
  "20) The Third Root Text: Explicitly Praising Rejoicing. The third root text, explicitly praising rejoicing, is:",
  "\"The Blessed One said thus, etc.\" This indicates that the assembly, previously having the doubt and hesitation of wondering whether there was a meaning of the Perfection of Wisdom superior to what was taught by Avalokiteśvara, [now heard] from the Blessed One's own mouth that even if all the Buddhas of the ten directions were to teach, the meaning of the Perfection of Wisdom would be exactly that, and not otherwise. Thus, [the Blessed One] bestowed his word.",
  "The questioner is Shariputra, and the respondent is the Bodhisattva Mahasattva, the noble Avalokiteshvara. \"Endowed with all\" (Thams-cad-dang ldan-pa) means \"all that exists\" (Thams-cad yod-pa), referring to the assembly (khor) endowed with all, such as different lands, different lineages, different beings, different forms, different enjoyments, and different languages, and so forth. That is what is meant by \"rejoicing.\"\n\nTo mention the distinction between the principal and secondary members of that assembly \"endowed with all\": gods who move in the sky, humans who move on the earth, asuras who move beneath the earth, and gandharvas who move in the three realms—these four principal ones are mentioned, and the countless ordinary worldly assemblies rejoice, are delighted, and rejoice.",
  "Regarding that which was spoken by Avalokiteśvara and which, in accordance with that, was spoken by the Bhagavan, one relies upon it, praises it manifestly, and holds it with great emphasis, taking it as definitive.",
  "**Commentary on [Hypothetical Root Text: Let's assume it's a verse from the *Abhisamayalankara* concerning the Eight Realizations]**\n\n**Verse:** [Hypothetical Verse: \"Through hearing, thought, and meditation's might, / Eight Realizations dawn, a radiant light.\"]\n\n**Commentary:**\n\nHomage to Manjushri, the youthful one!\n\nThis verse, encapsulating the essence of the path, reveals the arising of the Eight Realizations ( *mngon rtogs brgyad* ) through the power of the three wisdoms ( *shes rab gsum* ): the wisdom of hearing ( *thos pa'i shes rab* ), the wisdom of thinking ( *bsam pa'i shes rab* ), and the wisdom of meditation ( *sgom pa'i shes rab* ).\n\nFirstly, the phrase \"through hearing's might\" ( *thos pa'i stobs kyis* ) refers to the initial acquisition of the profound Dharma teachings from a qualified spiritual mentor ( *bla ma* ) or through the study of authentic scriptures ( *gzhung* ). This hearing is not merely the passive reception of sound, but rather the attentive and receptive engagement with the words of the Buddha and the commentaries of the great masters. As it is said in the *Ratnagotravibhaga* ( *rGyun bla ma'i mdo* ): \"Hearing is the foundation of all virtues; it is the eye that sees the path to liberation.\"\n\nSecondly, \"thought's might\" ( *bsam pa'i stobs kyis* ) signifies the process of critical analysis and reflection upon the teachings received through hearing. This involves contemplating the meaning of the words, examining their implications, and resolving any doubts or uncertainties that may arise. This is the stage where the seed of understanding begins to sprout.  As Nagarjuna states in his *Mulamadhyamakakarika* ( *rTsa ba shes rab* ), Chapter 24, verse 18: \"Without dependent origination, there is no phenomenon whatsoever; therefore, emptiness is the very nature of all things.\" This verse, when contemplated, reveals the profound truth of emptiness ( *stong pa nyid* ) and dependent origination ( *rten 'byung* ).\n\nThirdly, \"meditation's might\" ( *sgom pa'i stobs kyis* ) denotes the sustained and focused application of the understanding gained through hearing and thinking. This involves cultivating single-pointed concentration ( *rtse gcig* ) on the object of meditation, such as emptiness, compassion ( *snying rje* ), or the nature of mind ( *sems nyid* ). Through consistent practice, the meditator gradually realizes the truth directly and experientially.  As the venerable Atisha Dipamkara said in his *Bodhipathapradipa* ( *Byang chub lam gyi sgron me* ): \"Meditation is the supreme means for purifying the mind; it is the path to liberation from suffering.\"\n\nThe phrase \"Eight Realizations dawn, a radiant light\" ( *mngon rtogs brgyad 'char 'od zer* ) indicates the progressive unfolding of the Eight Realizations of the *Abhisamayalankara*. These eight, namely: the Realization of All-Basis Consciousness ( *kun gzhi rnam shes mngon rtogs* ), the Realization of the Arising of the Thought of Enlightenment ( *byang chub kyi sems bskyed pa'i mngon rtogs* ), the Realization of the Application of the Thought of Enlightenment ( *byang chub kyi sems 'jug pa'i mngon rtogs* ), the Realization of the Non-Regression of the Thought of Enlightenment ( *byang chub kyi sems ldog pa med pa'i mngon rtogs* ), the Realization of the Accumulation of Merit ( *bsod nams kyi tshogs bsags pa'i mngon rtogs* ), the Realization of the Accumulation of Wisdom ( *ye shes kyi tshogs bsags pa'i mngon rtogs* ), the Realization of the Application of the Two Accumulations ( *tshogs gnyis 'jug pa'i mngon rtogs* ), and the Realization of the Fruition of Buddhahood ( *sangs rgyas kyi 'bras bu'i mngon rtogs* ), are not separate and distinct entities, but rather successive stages in the gradual unfolding of wisdom and compassion. They are like the rays of the sun, each building upon the previous, culminating in the full illumination of Buddhahood.\n\nTherefore, by diligently engaging in the three wisdoms of hearing, thinking, and meditation, one can progressively realize the Eight Realizations and ultimately attain the supreme enlightenment of Buddhahood. May all beings benefit!",
  "If the Tathāgata had not given his approval with a harmonious response, then the assembly would not have been convinced and would not have become joyful and satisfied. Furthermore, considering the disposition of other disciples, Śāriputra might have thought, \"Was my question untimely?\" And Avalokiteśvara might have become disheartened and doubtful, thinking, \"Perhaps I did not explain the answer well.\" Therefore, when the Teacher bestowed his approval with \"Excellent!\", Śāriputra rejoiced that his question was well-posed, and the noble Avalokiteśvara knew that his answer to the question was well-received and was exceedingly delighted. The other members of the assembly also gained conviction, their doubts were dispelled, and they attained contentment and satisfaction.\n\nFurthermore, if someone were to say, \"This profound sūtra belongs to the intermediate turning of the wheel of dharma, therefore it is not appropriate to teach the *gzhan stong* (other-emptiness) Madhyamaka,\" or, \"If it teaches that, then there will be no difference in profundity between the intermediate and final [turnings],\" then one should respond as follows:\n\nThe intention of all three turnings of the wheel of dharma is the *gzhan stong* Madhyamaka. In the first and intermediate [turnings] as well, there are words that explicitly state and clearly demonstrate it, as appropriate. However, in the wheel of definitive meaning, it is taught more clearly and extensively than in the first two wheels, without concealment, openly, or exhaustively. Thus, a distinction of superior and inferior arises among the three wheels, and yet their intention is the same, so those two faults [of inappropriateness and lack of distinction] do not exist.\n\nTherefore, the explicit teaching of this sūtra clearly demonstrates the common *gzhan stong*, while the uncommon meaning of the *sugatagarbha* (Tathāgata-essence), which is permanent, stable, eternal, and all-encompassing, is explained in the manner of a hidden meaning.",
  "21) Lastly, the Virtue of the Conclusion: Colophon.",
  "This marvelous word-by-word commentary on the *Heart Sutra* (Prajñāpāramitā Hṛdaya Sūtra) was also spoken by Jālandharipa Tāranātha.\n\nOne request.\n\nMay virtue and excellence increase!"
]