[
  [
    "The Entry into the Conduct\nof the Bodhisattva.",
    "༄༅༅། །\nIn the language of India [Sanskrit]: Bodhisattvacaryāvatāra [The Way of the Bodhisattva]",
    "In Tibetan: A Guide to the Bodhisattva's Way of Life",
    "Homage to all Buddhas and Bodhisattvas.",
    "With reverence I prostrate with body, speech and mind to all the perfectly-gone, never-returning Sugatas possessing the twofold dharmakāya,\nTogether with their noble heirs born from wisdom and compassion, and all who are worthy of veneration.\nThe entrance into the threefold discipline of these children of the Sugatas—restraint, virtue-gathering, and benefiting beings—\nI shall now concisely explain according to authentic scripture, suitable for beings of these degenerate times.",
    "I have nothing new to say here that has not been said before.\nNor do I possess any skill in composition.\nTherefore, I have not written this with the intention to benefit others.\nI have composed this solely to cultivate my own mind.",
    "For cultivating virtue, my force of faith\nShall, for the time being, increase through these verses.\nAnd should others of equal spiritual fortune\nChance upon these teachings, they too will find their path fulfilled.",
    "This precious human life with its eight freedoms and ten endowments,\nSo rare to find—like a blind turtle meeting a floating yoke—enables the highest Dharma purpose.\nIf, having obtained this fleeting treasure through past virtue, you fail to practice the holy Dharma,\nHow could such perfect conditions ever be gathered again as death approaches uncertainty?",
    "Just as in the night's darkness midst dense clouds\nLightning momentarily illuminates with brilliant light\nSo too by Buddha's power, once in a hundred times\nWisdom and merit briefly arise in worldly beings' minds",
    "Therefore virtue remains perpetually feeble,\nWhile sin's power is mighty and utterly unbearable.\nWhat virtue other than the mind of perfect enlightenment  \nCould possibly overcome such terrible forces?",
    "Having thoroughly contemplated over countless eons,\nThe Lords of Sages perceived that this alone brings benefit;\nThrough this, countless multitudes of beings\nEffortlessly attain supreme bliss.",
    "Those who wish to overcome hundreds of sufferings of existence,\nWho desire to dispel the unhappiness of sentient beings,\nWho wish to experience hundreds of happinesses, both temporary and ultimate—\nShould never, ever abandon bodhicitta, the awakening mind.",
    "The moment bodhicitta awakens in one's mind,\nThe wretched one, once bound in saṃsāra's prison,\nIs instantly proclaimed a child of the Sugatas,\nAnd becomes worthy of prostrations from gods and humans throughout the world.",
    "Like the supreme alchemical elixir that transforms into gold,\nTaking this impure body and transmuting it into the priceless, jewel-like form of the Victorious One,\nTherefore, firmly grasp without wavering\nThis supreme mind of awakening called bodhicitta.",
    "The world's sole captains, with wisdom immeasurable and all-pervading,\nHaving thoroughly examined all phenomena through countless eons, found most precious,\nThose who wish to be freed from samsara's realms of wandering,\nFirmly grasp this supreme jewel—the jewel of bodhicitta.",
    "All other virtuous deeds, like a plantain tree,\nWill ultimately be exhausted after bearing fruit.\nYet the wish-fulfilling tree of bodhicitta\nBears fruit without depletion, ever growing in abundance.",
    "Even if one has committed most terrible negative acts,\nJust as one escapes grave dangers by relying on a hero,\nWhich instantly liberates one when relied upon,\nWhy would those conscientious about proper conduct not depend on it?",
    "Like the fire at the end of time that consumes all worlds, bodhicitta\nInstantly burns away even the five heinous crimes.\nThese immeasurable benefits\nThe wise protector Maitreya explained to Sudhana, noble merchant's son.",
    "That bodhicitta, in brief,\nShould be understood as having two aspects:\nThe aspirational mind toward enlightenment,\nAnd the engagement in enlightenment itself.",
    "Just as one discerns the difference between\nWishing to go and actually going somewhere,\nSo should the wise understand\nThese two types in sequence.",
    "Though the aspiring mind of awakening (bodhipraṇidhicitta) yields\nGreat fruits while wandering in saṃsāra,\nIt does not generate continuous merit\nAs does the engaging mind (prasthānacitta).",
    "From the moment one firmly takes up that engagement bodhichitta\nFor the sake of liberating the boundless realm of sentient beings,\nWith an irreversible mind that will not turn back—\nA merit vast as space flows ceaselessly, even in sleep and inattention,",
    "From the moment one formally takes the engaged bodhicitta vow\nPowerful streams of merit, vast as space itself\nFlow forth unceasingly in boundless measure\nEven during sleep or times of heedlessness",
    "This teaching on engaged bodhicitta,\nWas expounded by the Tathāgata himself,\nFor the sake of beings of inferior motivation,\nThose śrāvakas who turned away from the Mahāyāna path.",
    "When one merely thinks of the headaches of beings,\n'I shall dispel them'—even just this thought,\nThis compassionate intent to benefit others,\nEndows one with immeasurable merit.",
    "Wishing to remove\nThe immeasurable sufferings of each and every being,\nAnd aspiring to establish each one in boundless qualities\nOf enlightenment—what need is there to speak of such merit?",
    "What mother or father could possess such altruistic intention?\nWho has such wish for others to attain Buddhahood?\nNot even among gods and truth-speaking sages,\nNor even in Brahma himself, does this profound concern exist.",
    "For these very beings\nEven for their own sake, this wish\nNot even in dreams has such a thought ever appeared\nHow then could it possibly arise for the benefit of others?",
    "Others do not generate even for their own sake\nThe mind that contemplates the welfare of sentient beings\nThis special jewel of mind bodhicitta\nHas arisen—an unprecedented marvel",
    "The cause of joy for all wandering beings,\nThe elixir for the suffering of all sentient beings,\nThis precious mind whose merit is boundless,\nHow could one possibly measure such merit?",
    "Even through the mere intention to benefit others,\nOne surpasses the merit of making offerings to Buddhas.\nWhat need is there to mention striving \nFor the happiness of all sentient beings without exception?",
    "Though beings wish to be free from suffering,\nThey rush toward suffering itself like moths to flames.\nThough longing for happiness through present and future lives,\nThrough delusion about what to adopt and reject,\nThey destroy their own happiness as if it were an enemy.",
    "To those who are deprived of joy,\nAnd burdened with manifold sufferings,\nMay I bring fulfillment through happiness,\nAnd sever completely all suffering.",
    "It even dispels ignorance.\nWhere is virtue equal to this?\nWhere is such a beneficial friend?\nWhere is merit like this?",
    "One who repays kindness received is, for now, deemed praiseworthy,\nWhat need, then, to mention the bodhisattva who,\nWithout being asked, performs virtuous deeds,\nWhat need, then, to mention the bodhisattva?",
    "One who provides ordinary meals to merely a few people,\nIs honored as virtuous by the world, though their gift is slight,\nWhether giving food for just a moment's sustenance,\nOr providing half a day's nourishment with disdain.",
    "That bestows upon limitless beings throughout endless time\nThe unsurpassed bliss of the Tathāgatas,\nCompletely fulfilling all wishes in every mind until space and beings are no more?\nWhat need is there to mention the inexhaustible generosity",
    "Whoever harbors malice in their heart\nToward a Bodhisattva, the Victor's heir who serves as patron,\nWill dwell in the hell realms for as many kalpas\nAs moments of ill will generated—thus the Sage declared.",
    "However, if one generates a mind of pure devotion,\nThe fruits thereof will multiply far more abundantly.\nFor the children of the Conqueror, even under great duress,\nNo negativity arises, while virtuous qualities naturally increase.",
    "I prostrate to the bodies of those\nIn whom that precious jewel of supreme bodhicitta has arisen\nI go for refuge to those sources of happiness\nWho transform even harmful acts into connections with happiness.",
    "Thus concludes the first chapter from the 'Introduction to the Conduct of Bodhisattvas' (Bodhicaryāvatāra), entitled 'Explanation of the Benefits of Bodhicitta.'"
  ],
  [
    "To generate and hold this precious bodhicitta mind,\nI make perfect offerings to the Tathāgatas and the sublime Dharma,\nTo the immaculate jewel free from all conceptual elaborations,\nAnd to the Buddha's children, the Bodhisattvas—these oceans of qualities.",
    "Whatever flowers and fruits there are in existence,\nAnd whatever varieties of medicines there are in existence,\nAnd whatever precious substances exist in the world,\nAnd whatever pure, delightful waters there are in existence.",
    "mountains of precious jewels like Meru and golden peaks\nforest realms secluded peaceful as turquoise mandalas\ntrees resplendent adorned with blossoming flower ornaments\nand those whose branches bow low bearing excellent fruits",
    "In the realms of gods and celestial beings, there are divine fragrances and incense,\nWish-fulfilling trees and trees made of precious gems,\nCrops that grow without being cultivated,\nAnd other ornaments worthy of offering.",
    "Oceans and lakes adorned with lotuses,\nSwans with beautiful and pleasing songs,\nThroughout the vast expanse of space to its limits,\nAll these that cannot be possessed.",
    "Having gathered with my mind the supreme sage, the best of humans,\nI present these well to him and his heirs.\nMay these holy recipients with immense compassion,\nAccept my offerings with kindness, considering me with love.",
    "I am without merit and greatly impoverished;\nI possess nothing else whatsoever for offerings;\nTherefore, O compassionate protectors, who think only of others' welfare;\nPlease accept these through your miraculous powers, for my benefit.",
    "I offer myself completely to the Victorious Ones and to all their spiritual heirs;\nThroughout all lifetimes, I permanently surrender my entire being, relinquishing all self-clinging.\nO Supreme Bodhisattvas, please accept me fully as your own;\nWith reverence, I become your servant to benefit all beings and transcend my negative actions.",
    "Having surrendered myself completely into your care,\nI remain fearless in saṃsāra while working for beings' welfare.\nI shall transcend my previous negative deeds,\nAnd henceforth commit no further wrongdoing.",
    "In those exceedingly fragrant bathing chambers\nWith floors of crystal that are clear and brilliantly gleaming\nAdorned with captivating pillars of radiant jewels\nCovered with canopies that shimmer with the luminous glow of pearls",
    "To the Tathāgatas and their spiritual children,\nI offer ablution with numerous gemstone vessels\nFilled with fragrant, mind-pleasing waters,\nAccompanied by melodious songs and musical instruments.",
    "With incomparable garments of divine cloth and Kāśika silk,\nI cleanse their sacred bodies with perfumed, immaculate cloths,\nThen I offer them excellent robes well-dyed in the three allowable colors,\nPresenting supremely fragrant, exquisite vestments.",
    "With divine garments—soft, smooth, and splendidly varied in form,\nAnd the finest ornaments of countless kinds adorning them,\nI honor noble Samantabhadra, wise Manjushri,\nAnd Lokeshvara, Lord of the World, along with other exalted bodhisattvas.",
    "With supreme fragrances whose sweet scents pervade the entire trichiliocosm,\nI anoint the bodies of all the Lords of Sages with these finest scents.\nLike pure gold well-melted, thoroughly refined, and perfectly polished,\nTheir radiant forms brilliantly blaze with captivating light.",
    "I worship the supreme Lords of Sages, most worthy of reverence,\nWith mandārava, lotus, and all fragrant flowers delightful to the mind;\nWith utpala and all other fragrant items,\nAnd beautifully arranged garlands that are pleasing to the mind.",
    "I offer billowing clouds of fragrant incense with rich aromas spreading, delightfully captivating the mind.\nI present various delectable foods, edible delights, and drinks—divine offerings worthy of the exalted ones.\nWith rich aromas spreading, delightfully captivating the mind.\nDivine offerings worthy of the exalted ones I reverently serve.",
    "I mentally offer jeweled lamps upon rows of gleaming golden lotuses of Jambu,\nPlaced on golden lotus arrangements, their radiant light dispelling the darkness of ignorance.\nOn gem-inlaid floors anointed with fragrant substances the thickness of a cow's hide,\nI scatter pleasing stemless flower petals, spread knee-high across this sacred ground.",
    "I offer these celestial mansions adorned with pearl and jewel necklaces\nResplendent ornaments of the quarters where enchanting hymns of praise resound\nThese clouds of divine palaces illuminating the boundless sky with their beauty\nTo those whose nature is compassion that all beings may reach liberation's realm",
    "I offer these magnificent jeweled parasols with golden handles,\nAdorned with precious gems and auspicious patterns in splendid array,\nBeautifully shaped and raised aloft, delightful to behold,\nThese I continuously present to the mighty sages.",
    "Furthermore, may magnificent clouds of offerings stand forth,\nWith instruments played, struck, and blown with their eight sublime qualities,\nMay clouds of music and melody that delight the mind and soothe,\nRelieving all beings' suffering, pervade before the Victorious Ones and their heirs.",
    "Upon all precious Dharma jewels, both scriptural and realized,\nUpon stupas of Buddha's eight activities and images painted, cast, and sculpted,\nMay showers of jewels, flowers, and manifold offerings\nFall incessantly without interruption until samsara ends.",
    "Just as Mañjuśrī, Samantabhadra and others\nMake magnificent offerings to the Victorious Ones,\nSo shall I make offerings to the Tathāgata protectors\nTogether with their spiritual heirs.",
    "I praise the oceans of qualities—the Buddha Blessed Ones with their physical marks, Brahma-voice, and omniscient wisdom—and their bodhisattva heirs\nWith oceans of melodious expressions of praise, where melody is speech, limbs are its causes, and ocean signifies their multiplicity.\nMay these sweet clouds of eulogizing melodies\nDefinitely arise before them perpetually in all times and places, even without my continuous offering.",
    "To all Buddhas throughout the three times,\nTogether with the sublime Dharma and supreme Assembly,  \nWith bodies as numerous as atoms in all buddha-fields,\nI reverently bow down and prostrate myself.",
    "I bow to all stūpas and the foundations of the awakening mind.\nI pay homage to the preceptors,\nI likewise venerate the teachers,\nThose of supreme disciplined conduct.",
    "Until I reach the essence of enlightenment,\nI go for refuge to the Buddhas. \nTo the Dharma and the assembly of Bodhisattvas,\nLikewise, I go for refuge.",
    "To those dwelling in all directions,\nThe perfectly awakened Buddhas and the bodhisattvas,\nAll who possess great compassion,\nWith joined palms, I make this supplication.",
    "From beginningless saṃsāra,\nIn this life or in other births,\nI have committed naturally wrongful deeds,\nOr directed others to do the same.",
    "Overwhelmed by ignorance and confusion,\nWhatever actions I've rejoiced in,\nHaving recognized these wrongdoings,\nI confess to the Protector with all my heart.",
    "Whatever harm I have inflicted on the Three Jewels,\nAnd on my parents or spiritual teachers or others,\nThrough the afflictions, by means of my body, speech,\nAnd mind—all this I hereby confess.",
    "I, defiled by numerous faults like attachment clinging like rust,\nA sinner who has committed utterly unbearable harmful deeds,\nAll these terrible sins that I have done, which may bring death at any moment,\nWith genuine remorse I confess before all guides—the Buddhas and their heirs.",
    "With my negative actions still unpurified,\nI will be taken by the Lord of Death prematurely.\nHow can I be definitively liberated from these misdeeds?\nI implore you, protect me swiftly, that I may take refuge!",
    "The Lord of Death, utterly beyond trust,\nWaits not for deeds done or yet unbegun.\nWhether healthy or sick, life is but a breath—\nNever trust this fleeting life will endure.",
    "Not knowing I must abandon everything and depart utterly alone,\nI committed numerous sins through attachment and aversion,\nFor the sake of those dear to me and against those not dear,\nAll meaningless actions that bring only suffering when I depart.",
    "Enemies shall cease to exist;\nDear ones too shall be no more;\nI myself shall likewise perish;\nThus everything shall come to nothing.",
    "Just as with experiences in a dream,\nWhatever objects one experiences\nBecome merely objects of memory,\nAll that has passed will not be seen again.",
    "Even in this very life, while you yet remain,\nMany beloved and non-beloved ones have passed away;\nYet the unbearable evil deeds committed through attachment and aversion\nStand before you.",
    "Thus I have not realized\nI am but a sudden, temporary visitor in this world.\nThrough delusion, attachment, and hatred\nI have committed many types of sins.",
    "Day and night without respite,\nLife constantly diminishes with no way to replenish,\nNo additional time comes from elsewhere,\nHow can I not meet death, I will surely die.",
    "Though I lie here on my deathbed\nSurrounded by all my relatives and friends\nThe unbearable pain of life being severed\nI alone must endure.",
    "When seized by the messengers of the Lord of Death,\nWhat help can relatives provide? What benefit are friends?\nAt that critical moment, only merit serves as a refuge,\nYet even that I have not cultivated.",
    "O Protector, through my heedlessness,\nNot knowing these terrifying fears,\nFor the sake of this impermanent life,\nI have committed many evil deeds.",
    "Led today to where his limbs will be severed as punishment\nThe condemned man withers, gripped by terror profound\nParched with thirst, his gaze downcast and pitiful\nHe himself appears utterly transformed from before.",
    "What more can be said of one seized by Yama's messengers\nWith terrifying forms—manifestations of one's own karma—\nAfflicted by the great disease of terror,\nOverwhelmed with dread while facing death's final torments?",
    "Who will properly protect me from\nThis great terror? thinking thus,\nWith terrified eyes agape,\nI frantically search in all four directions for refuge.",
    "Seeing no refuge in the four directions,\nI fall utterly into overwhelming despair.\nIn that terrifying place where no protection exists,\nWhat shall I do then?",
    "Thus to the Victor, the protector of beings,\nWho strive for the purpose of defending all beings,\nThe powerful one who dispels all fears,\nFrom this very day I go for refuge.",
    "I take genuine refuge in the Dharma realized by the Buddhas\nWhich dispels all saṃsāra's fears;\nAnd likewise in the noble assembly of bodhisattvas,\nI sincerely take refuge without doubt.",
    "Overwhelmed with terror from fears,\nI offer myself to Samantabhadra.\nTo Mañjuśrī as well,\nI surrender this body.",
    "With compassionate activity that is unerring,\nTo that Lord Avalokiteśvara,\nI cry out with a pitiful wail,\nMay he protect me, a sinner.",
    "To noble Ākāśagarbha, Buddha-appointed staff-like support for fallen bodhisattvas,\nTo Kṣitigarbha, protector of the destitute overcome by afflictions though wearing monastic robes,\nAnd to all great compassionate protectors like Maitreya and Viṣkambhin, lords of the ten grounds,\nI, observing some precepts while breaking others, cry out in anguish from the depths of my heart seeking refuge.",
    "Upon merely glimpsing Vajrapāṇi,\nThe messengers of Yama and all malevolent forces\nFlee terrified in all four directions\nI take refuge in this supreme Vajra-holder.",
    "Having transgressed your sacred commands in the past,\nNow seeing the great terrors,\nI come to you for refuge;\nSwiftly dispel these fears.",
    "Even one frightened by a minor ailment,\nShould not disregard the physician's words;\nHow much more when afflicted by hundreds of diseases,\nFrom the four afflictions and their four derivatives?",
    "When even one affliction like attachment or anger\nDestroys all people dwelling in Jambudvīpa\nWhat medicine that heals these mental poisons\nCan be found in any direction, even in Brahma's realm",
    "The Omniscient Physician\nWho extracts all thorns of suffering\nOne who contemplates not following His instructions\nIs utterly deluded, a proper object of reproach",
    "If I must remain mindfully vigilant\nEven at ordinary small precipices,\nWhat need to mention the abyss of lower realms \nWhere one falls a thousand yojanas for endless time?",
    "Thinking 'I shall not die today,'\nIt is inappropriate to rest in comfort.\nThe time when I shall cease to exist\nWill certainly come without fail.",
    "Who has given me fearlessness?\nHow could I escape this fate?\nSince I will inevitably perish,\nWhy does my mind remain at ease?",
    "From all those pleasures I've experienced,\nWhat lasting essence remains for me?\nYet fixated on such objects,\nI've transgressed my guru's instructions.",
    "Abandoning this present life with all its trappings\nLeaving behind my relatives and friends alike\nWhen I must journey alone driven helplessly by karma\nWhat use are all these loved ones and enemies to me",
    "From unwholesome actions suffering arises.\n'How might I definitely escape from this?'\nDay and night, constantly, I\nShould think of this alone, as is proper.",
    "Due to my ignorance and fundamental confusion,\nWhether natural misdeeds wrong for all beings by nature,\nOr prescribed wrongs forbidden only to those under vows,\nWhatever such negative actions I have committed.",
    "Standing directly before the Buddha protectors' omniscient gaze,\nWith joined palms, body trembling, fearful of lower realms' suffering,\nI prostrate again and again, with profound remorse in every bow,\nAnd confess all these misdeeds completely, turning away from each fault.",
    "May the guides—Buddhas and Bodhisattvas—acknowledge\nmy transgressions as true faults.\nO Protectors, these actions are not virtuous;\nHenceforth I shall never again commit such deeds.",
    "Thus concludes the second chapter entitled 'Confession of Negativities' (Pāpadeśanā) from the Introduction to the Bodhisattva's Way of Life (Bodhisattvacaryāvatāra)."
  ],
  [
    "I joyfully rejoice in all virtuous deeds performed by sentient beings\nThat provide relief from the sufferings of lower realms in cyclic existence.\nMay those afflicted with suffering abide in happiness.\nThough still bound by samsara's nature, I celebrate their merit with genuine delight.",
    "I rejoice in the virtues accumulated \nAs causes for the enlightenment of renunciants\nI rejoice in the definite liberation\nOf embodied beings from the sufferings of saṃsāra",
    "I rejoice in the enlightenment of the Buddhas, the protectors,\nAnd in the progressive grounds attained by the Bodhisattvas.\nIn the mind that brings happiness to all sentient beings,\nAnd the ocean of virtues arising from the generation of bodhicitta,\nAnd in all actions performed for beings' benefit,\nI rejoice.",
    "With palms joined in reverence and offering, I supplicate\nAll the Buddhas throughout every direction:\nFor beings who fall into suffering due to ignorance's darkness,\nPlease kindle the lamp of Dharma teachings.",
    "When the Conquerors wish to pass into nirvana,\nWith palms joined I offer this prayer:\nMay you not leave this world in blindness,\nI beseech you to remain for countless eons.",
    "Having thus performed all these practices,\nThrough whatever virtue I have accumulated,\nMay all sentient beings'\nSufferings be completely dispelled.",
    "For as long as sentient beings are afflicted by illness,\nUntil they completely recover from their suffering,\nMay I become healing medicine and skilled physician,\nAnd serve as their devoted attendant.",
    "By showering down exquisite food and drink with their hundred flavors,\nI shall completely dispel the suffering of hunger and thirst.\nDuring the intermediate kalpa of famine with its phases of scarcity,\nMay I myself become nourishment for all beings—an offering worthy of merit.",
    "For sentient beings impoverished and destitute,\nMay I become an inexhaustible treasure for them.\nManifesting as various necessities of every kind,\nMay I remain directly present before them.",
    "The body, likewise enjoyments,\nAnd all virtues of the three times,\nFor the sake of accomplishing the welfare of all sentient beings,\nShould be given away without miserliness.",
    "Through complete renunciation, nirvana is attained\nMy mind strives to accomplish this liberation\nWhen everything must be relinquished simultaneously\nSupreme is offering it to beings",
    "Since I have already given this body\nTo all sentient beings as they please,\nLet them at all times kill me, criticize me,\nOr beat me—I accept whatever they choose.",
    "Let them play with my body\nLet them laugh, mock, and make it an object of ridicule\nI have already given this body to all sentient beings\nWhy should I concern myself with protecting it?",
    "Let them engage in actions \nThat bring them well-being without causing harm\nBy the power of my dedication, may no being who focuses on me\nEver experience anything without purpose or benefit",
    "When sentient beings take me as their object of mind,\nWhether with anger arising or devoted faith,\nMay that very mental state forever become\nThe cause fulfilling all their worldly and ultimate aims.",
    "Those who verbally criticize me\nThose who inflict harm\nLikewise those who mock\nMay all have the fortune of awakening.",
    "I am the protector for those without protection,\nand the guide for travelers on the path.\nFor those wishing to cross over, I serve as a boat,\nand I become both a ship and a bridge for them.",
    "For those who seek an island of refuge from life's turbulent waters, may I become an island\nFor those who desire a lamp in darkness to discern the righteous path, may I become a lamp\nFor those who need a dwelling place, may I become their shelter and resting place\nI, for all embodied beings who require a servant\nMay I become a servant to all, fulfilling whatever they need",
    "The wish-fulfilling jewel and excellent vase\nThe accomplished knowledge mantra and great medicine\nThe wish-fulfilling tree\nMay I become for all embodied beings",
    "Like the great elements earth, water, fire, wind\nAnd space that constantly pervades all,\nMay I become the foundation for immeasurable beings\nThe basis for their diverse needs and sustenance.",
    "Thus, to the vast realm of beings that extends\nThroughout all ways to space's farthest reach,\nUntil all have attained perfect nirvana,\nMay I become their sustaining source indeed.",
    "Just as the ancient Sugatas,\nGenerated the awakening mind,\nAnd trained in the bodhisattva's disciplines,\nSo I shall also follow in proper sequence.",
    "Just as the Buddhas before me, for the welfare of the world, I too shall generate this awakening mind of bodhicitta.\nLikewise, I shall progressively train in all the disciplines\nAccording to their proper sequence.",
    "Thus the wise bodhisattva\nHaving firmly grasped the awakening mind\nTo systematically prevent its decline\nShould uplift the mind with joy.",
    "Today my life has become fruitful\nI have excellently obtained this human existence\nToday I have been born into the Buddha's family\nAnd I have now become a child of the Buddha",
    "Now I must act in accordance with my lineage's ways,\nPracticing diligently as Buddha's heirs have done,\nSo this flawless, noble lineage throughout all time\nMay never be stained or sullied by my misconduct.",
    "Just as a blind person might find a precious jewel\nAmong heaps of discarded refuse,\nSo too, by mere chance and through the Buddha's blessing,\nThis bodhicitta has arisen in me.",
    "This bodhicitta is the supreme nectar\nThat conquers the lord of death for all beings, bestowing deathlessness.\nThis awakening mind is indeed the inexhaustible treasure\nThat completely dispels both material and spiritual poverty for beings.",
    "This is the supreme medicine of enlightened mind\nThat pacifies all diseases of sentient beings.\nFor those exhausted from wandering the long pathways of saṃsāra,\nThis is the sheltering tree where all weary beings find true rest.",
    "A common platform for all beings.\nIt liberates them from the lower realms.\nThe moon of mind has risen\nTo dispel the torment of afflictions.",
    "The great sun that thoroughly uproots\nthe cataracts of ignorance in the world,\n\nThe butter essence that emerges\nfrom churning the milk of the sublime Dharma.",
    "For wandering guests upon existence's path\nWho yearn to taste the pleasures of delight,\nThis stands as supreme bliss, unfailing,\nSatisfying all beings as great guests.",
    "Today, before all Protectors,\nI have invited all sentient beings to the Sugata state of enlightenment\nAnd, meanwhile, to be guests to happiness along the path.\nMay gods, asuras, and all others rejoice in this invitation!",
    "Thus concludes the third chapter entitled 'Thoroughly Adopting the Bodhicitta' (Bodhicittaparigraha) from 'Engaging in the Bodhisattva's Conduct' (Bodhisattvacaryāvatāra)."
  ],
  [
    "Thus, having firmly grasped bodhicitta with unwavering resolve,\nThe Child of the Victorious Ones who has taken the sacred vows\nMust constantly remain vigilant without the slightest negligence,\nAnd strive diligently never to transgress the bodhisattva trainings.",
    "Whatever is rashly begun\nOr that which has been insufficiently investigated,\nEven though one has firmly committed oneself to such action,\nIt is proper to thoroughly analyze whether to accept or reject it.",
    "That which the Buddhas and their spiritual heirs\nHave thoroughly examined with their great wisdom,\nAnd which I too have carefully analyzed through reasoning,\nWhat excuse could there be to postpone its practice?",
    "If, after making this solemn vow,\nI fail to fulfill it through practical actions,\nHaving deceived all these sentient beings,\nWhat shall become of my destiny?",
    "Even for the most trivial of objects,\nWhen one mentally resolves 'I shall give this,'\nYet fails to fulfill that intention,\nIt is taught that such a person becomes a hungry ghost.",
    "Having sincerely aspired to supreme unsurpassed bliss\nAnd invited all beings as honored guests through bodhicitta intention\nIf I then deceive all wandering beings\nHow could I possibly journey to higher realms?",
    "How even those who abandon bodhicitta\nAre still delivered to liberation.\nThis inconceivable workings of karma:\nOnly the Omniscient One truly knows.",
    "For a bodhisattva, this transgression stands as the gravest downfall above all others.\nWhen one abandons the awakened resolve.\nThe foundation for benefiting all beings is destroyed.\nThis diminishes one's ability to help all sentient beings.",
    "Whoever, even for a moment, obstructs\nThe meritorious actions of this bodhisattva, \nWill face limitless suffering in lower realms,\nHaving impeded one who works for beings' welfare.",
    "If destroying even one being's happiness\nCauses one to fall from higher to lower realms,\nThen what need to mention the karmic consequences\nOf destroying the well-being of countless embodied beings throughout limitless space?",
    "Thus, by the power of transgressing through abandonment of bodhicitta\nAnd subsequently by the power of regenerating this awakening mind,\nOne oscillates in saṃsāra, swinging between realms due to these actions,\nAnd long delays attainment of the bodhisattva bhūmis.",
    "Therefore, as I have solemnly vowed,\nI must respectfully fulfill my bodhisattva training.\nIf from today I fail to make diligent effort,\nI will descend to lower realms.",
    "Innumerable Buddhas have come and gone\nWho diligently sought the welfare of all sentient beings\nYet due to my own faults alone, I have not become\nA suitable recipient of their healing ministrations.",
    "If I continue to act in this same manner still,\nI shall experience again and again exactly thus:\nLower rebirths, disease, bondage in iron chains,\nCutting by swords, dismemberment by axes, and such sufferings.",
    "The advent of a Tathāgata in this world,\nFaith in the Buddha's Tripitaka teachings, this precious human form with its eighteen freedoms and advantages,\nAnd circumstances suitable for practicing virtue,\nWhen will I ever again obtain these rare conditions?",
    "Though we enjoy this day free from illness.\nWith food to eat and no harm befalling us.\nLife is momentary and deceptive.\nThis body, like something borrowed briefly.",
    "With such conduct as mine,\nI will not again obtain a precious human body.\nWithout attaining a human form,\nOnly negative actions will prevail, with no opportunity for virtue.",
    "When, though endowed with leisure and fortune for virtuous action,\nI fail to perform good deeds,\nWhat shall I do when, in the lower realms' torment,\nCompletely deluded?",
    "For one who neither performs virtuous deeds\nAnd instead accumulates evil actions,\nEven after hundreds of millions of eons,\nThe very word 'fortunate rebirth' will not be heard.",
    "For this very reason the Blessed One declared\nHuman birth is exceedingly difficult to obtain\nEven rarer than a blind turtle surfacing once every hundred years\nWhose neck might chance upon a yoke's hole in the vast ocean",
    "From a single moment's sin,\nOne dwells in Avīci hell for an entire eon.\nWith sins accumulated since beginningless saṃsāra,\nWhat need is there to mention the uncertainty of reaching higher realms?",
    "Merely by experiencing that suffering alone,\nOne will not attain liberation from the lower realms.\nFor while undergoing the ripening of previous deeds,\nNew evils arise—anger and malice perpetuating the cycle.",
    "Having obtained this precious human rebirth,\nIf I have not cultivated virtue,\nThere exists no greater deception than this,\nNor greater delusion than this ignorance.",
    "If, having realized this precious opportunity,\nI later falter through delusion,\nWhen the time of death arrives,\nI shall be overcome with great sorrow.",
    "The unbearable fires of hell will burn\nMy body for a long, long time to come.\nThen the flames of remorse, equally torturous,\nWill surely consume my mind that abandoned bodhicitta vows.",
    "Having by rare coincidence obtained this extremely difficult-to-find human body—a precious foundation for spiritual benefit—\nThough I possess the wisdom to distinguish virtue from non-virtue,\nIf I lead myself back to those same hell realms from which I once came,\nIt is as though I've been bewitched, forsaking my connection to the Buddha.",
    "Like one bewildered by mantras,\nI am here bereft of mental discernment.\nI do not know by what affliction I am deluded;\nWhat dwells within me causing this loss of control?",
    "Enemies of hatred, craving, and the rest,\nHave no limbs, legs, and so forth,\nNot brave nor wise, yet somehow\nThey have made me their servant.",
    "While dwelling within my mind as unwelcome intruders,\nThese enemy afflictions joyfully inflict their harm on me;\nTo show patience toward such destroyers without anger\nIs misplaced tolerance, condemned by the Buddhas and noble ones.",
    "Even if all the gods and demigods\nWere to rise against me as enemies,\nEven they would not be capable\nOf dragging me into the fires of Avīci hell.",
    "When these powerful enemies—my afflictions—arise,\nEven Mount Meru would leave not a trace of ash when consumed by them;\nI am cast in a single instant by these mighty foes of afflictions,\nInto that terrible Avīci hell.",
    "My affliction-enemies endure\nWithout beginning or end through boundless time;\nUnlike them, no other adversaries,\nHowever powerful, can last so long.",
    "When served with respect and provided what they need,\nEven ordinary enemies bring benefit and happiness.\nBut when inner afflictions are indulged,\nThey only cause repeated suffering and harm.",
    "Thus, when these continuous and ancient foes—afflictions that have been enemies since beginningless time without a moment's interruption, the sole source producing all streams of suffering—fearlessly dwell in my heart, how could I possibly find joy in saṃsāra?",
    "These afflictions, guardians of saṃsāra's three realms' prison,\nAct as executioners in the Reviving Hell and lower states.\nIf they dwell in my mind, trapped in improper thought's attachment net,\nHow could I find any physical or mental well-being?",
    "Therefore, until I have decisively conquered these enemies—the afflictions—\nIn direct perception, I shall not abandon my diligence in this practice.\nJust as those inflated with pride and filled with anger at even slight offenses\nWill not sleep until they have defeated their adversary.",
    "Those afflictions—our enemies since birth, pitiable in their suffering from impermanence and death\nWhen confronting them in battle, we must firmly resolve to destroy them\nEnduring the pain of countless arrows, spears, and weapon strikes\nWe never turn back until we accomplish our goal, no matter the hardships we face",
    "The constant causes of all suffering since beginningless time.\nWhen I strive to conquer these innate afflictions—my natural enemies.\nHow could I possibly fall into despair over past failures or grow disheartened,\nEven when wounded by hundreds of hardships in this spiritual battle?",
    "If people proudly bear wounds inflicted by enemies without purpose\nAs if they were ornaments adorning their bodies,\nThen why should hardships not be welcomed as purifying aids\nBy me, who strives diligently to achieve the supreme goal?",
    "Fishermen, butchers of low caste, farmers, and others like them,\nWith minds fixed solely on their own meager livelihood,\nEnduring cold, heat, and other torments,\nWhy then should I not bear suffering for the sake of establishing all beings in ultimate bliss?",
    "I vowed to liberate all beings throughout the ten directions\nTo the farthest reaches of space from afflictions and karma\nYet at the time of making this solemn pledge I myself\nRemain not freed from these afflictions",
    "Not knowing the measure of my own capabilities\nHow could such speech not be that of a madman\nTherefore, to conquer afflictions that bind me\nI shall remain forever unwavering in this battle",
    "Here I shall deliberately cling to the antidotes\nAnd harbor enmity toward afflictions engaging them in battle\nSuch affliction-like mental states as these\nAre exempt from abandonment when they serve to destroy afflictions.",
    "Let my intestines spill out, let my head fall to the ground—\nI would rather endure this bodily death than submit.\nBut in no way shall I ever bow down\nTo the enemies of afflictions, which lead to endless suffering.",
    "Even if an enemy is banished from one's land,\nThey may dwell in other regions, establish themselves there,\nAnd return once they've gathered strength anew—\nBut the foe of afflictions works not in this way.",
    "Afflictions are abandoned by the eye of wisdom.\nWhen removed from my mind, where would they go?\nWhere could they abide, then return to harm me?\nMy dull intellect alone fails to make effort.",
    "Neither in objects, sense faculties, nor between them do afflictions dwell,\nNor elsewhere—yet where do these beginningless foes reside that torment the entire world?\nThese are mere illusions; dispel fear from your heart and directly confront them with wisdom's discerning effort.\nWhy needlessly harm yourself in hell realms when understanding their empty nature sets you free?",
    "Having thus firmly resolved, I strive diligently \nTo accomplish the trainings as they have been taught.\nHow can one afflicted with disease find freedom from illness\nIf they disregard the physician's instructions about their medicine?",
    "This concludes the fourth chapter entitled 'Vigilance' (apramāda) from the Introduction to the Bodhisattva's Way of Life (Bodhicaryāvatāra)."
  ],
  [
    "One who wishes to protect the training\nShould guard the mind with vigilance.\nIf this mind remains unguarded,\nThe training cannot be maintained.",
    "When the elephant of the mind is left unrestrained,\nIt causes harm like the torments of Avīci hell;\nBut even a wild, intoxicated elephant\nDoes not inflict such suffering in this world.",
    "When the elephant of mind\nIs firmly bound with mindfulness' rope,\nAll fears shall vanish,\nAnd every wholesome virtue shall come to hand.",
    "Tigers, lions, elephants and bears.\nSnakes and all who threaten as foes.\nHell's guardians who bring future terror.\nWitches (ḍākinīs) and demons (rākṣasas).",
    "Through binding this single mind,\nAll sources of harm become restrained.\nThrough taming this single mind,\nAll dangers become pacified.",
    "Thus all fears and immeasurable sufferings\nArise from the deluded mind alone,\nSo taught the Buddha,\nWho speaks only truth.",
    "Who has purposefully created these weapons in the hells?\nWho has made the blazing iron ground?\nFrom where have those hosts of women arisen?\nAll these arise from one's own negative mind alone.",
    "The Sage declared that all these various harms\nArise from the evil mind itself;\nTherefore, in all three worlds,\nThere exists no fear more terrifying than the mind.",
    "If liberating all beings from poverty\nIs truly the perfection of generosity,\nYet many remain destitute even today\nHow could the former Buddhas have perfected such giving?",
    "With all possessions including their fruits,\nTo every sentient being with generous mind,\nThe perfection of giving is declared;\nTherefore, this perfection is indeed mind itself.",
    "Where could fish and other beings be driven\nSo that they would not be killed\nFrom attaining the mind of renunciation\nThe perfection of ethical discipline is explained.",
    "Ill-mannered sentient beings are as vast as space,\nIt is impossible to subdue them all.\nBut when the angry mind is conquered,\nIt is as if all enemies have been vanquished.",
    "Where would one find enough leather to cover the entire surface of the earth.\nIt would be impossible.\nHowever, with just the leather of a shoe sole,\nIt is as if the whole earth has been covered.",
    "Just as I cannot ward off external things,\nI shall instead restrain my angry mind.\nWhat need have I for controlling others?\nWith patience, my mind alone must be tamed.",
    "What fruit comes from a single, intense mind of clarity?\nRebirth in the Brahma realm and similar states.\nBody and speech actions yield many fruits.\nWith weak practice, this is not the case.",
    "All recitations and austerities,\nThough practiced over long spans of time,\nWhen performed with a mind distracted elsewhere,\nThe Knower of Reality declares them purposeless.",
    "The supreme essence of Dharma. If one does not know this secret of the mind.\nThough seeking to attain happiness and overcome suffering.\nThey wander pointlessly without purpose.",
    "Therefore, this mind of mine,\nI must well grasp with mindful awareness and carefully guard.\nApart from the discipline of protecting the mind,\nWhat purpose do numerous external vows and practices serve?",
    "Just as one who dwells among the unrestrained,\nVigilantly protects their wound with great care,\nLikewise, when living among those who provoke afflictions,\nOne must always protect this vulnerable wound of the mind.",
    "If frightened by the slightest wound's pain,\nI guard that wound with diligent concern.\nWhen fearing mountains crushing in the hell of Saṃghāta,\nwhy wouldn't I protect my mind's wound from its outward-leaking harm?",
    "If one maintains such conduct,\nWhether dwelling among evil people,\nOr residing among women,\nThe steadfast practitioner of discipline will not falter.",
    "Let my gains and honors freely perish\nMy body and livelihood likewise fade\nOther virtuous deeds may also decline\nBut never shall my awakened mind deteriorate",
    "To those who wish to guard their minds,\nI join my palms in earnest supplication:\n'With every effort, safeguard mindfulness,\nAnd introspective awareness'—I join my hands thus.",
    "Just as one afflicted by illness\nIs powerless in performing all tasks,\nSo too a mind disturbed by confusion\nLacks capacity for all virtuous activities.",
    "For one whose mind lacks vigilant awareness,\nKnowledge gained through hearing, contemplation, and meditation,\nLike water in a leaking vessel,\nNeither remains in memory nor yields spiritual virtue.",
    "Even many who are learned and faithful,\nAnd who diligently apply effort to practice,\nDue to the fault of lacking mindfulness and introspective awareness,\nBecome defiled with the stains of moral downfalls.",
    "When the thief of non-vigilance (asamprajanya)\nFollows in the wake of diminished mindfulness (smṛti),\nEven though virtuous merits have been accumulated,\nThey are stolen away, leading one to unfortunate realms.",
    "This band of kleśa-thieves lies in constant ambush,\nSeeking vigilantly for every vulnerable opening;\nFinding entrance, they rob our accumulated virtue,\nAnd destroy even the life-force of higher rebirth.",
    "Therefore, mindfulness—which guards the doorway of the mind\nShould never, at any time, be removed from its post.\nIf it has departed, recall the sufferings of lower realms\nAnd swiftly reestablish it to protect against the thieves of afflictions.",
    "Through dwelling in the company of spiritual teachers\nFollowing the preceptor's instructions\nAnd for the fortunate ones who show respect out of fear\nMindfulness arises easily and naturally.",
    "Buddhas and Bodhisattvas possess unhindered vision everywhere.\nTheir perfect sight misses nothing, like the sighted among the blind.\nBefore all of them I constantly abide.\nAlways visible within their all-knowing gaze.",
    "Having contemplated thus that Buddhas and Bodhisattvas\nAbide with inner shame, deep respect, and fear;\nThus Buddha-recollection will effortlessly arise\nWithin you again and again.",
    "When mindfulness stands guard at the door of mind's dwelling,\nFor the purpose of protection against afflictive objects,\nThen introspective awareness naturally arises to discern,\nAnd even when it has departed, it will return again.",
    "First I must examine my mind before any action\nDiscerning whether these thoughts are virtuous or flawed\nWhen I recognize such afflicted mental states arise\nI should remain like wood unmoved in body speech and mind",
    "I shall never engage in purposeless wandering gazes\nThis I firmly commit to avoid at all times\nWith decidedly contemplative awareness\nI'll keep my eyes lowered looking downward as in constant meditation",
    "To rest one's eyes from visual strain occasionally.\nOne should mindfully look toward various directions.\nIf someone appears within one's field of view.\nGreet them welcomingly after properly observing them.",
    "On roads and paths, one should vigilantly scan\nAll four directions to detect potential dangers.\nWhen resting, with composed demeanor\nTurn fully to examine what lies behind.",
    "Having examined for dangers ahead and behind.\nOne should mindfully decide whether to proceed or return.\nThus in all situations and bodily postures.\nOne should act only after understanding what benefits oneself and others.",
    "I shall position my body thus\nFirst establish this intent, then having restrained unnecessary physical motion\nAt intervals, with vigilant awareness examine\nIn what manner is this body now positioned",
    "The intoxicated elephant of the mind\nTo the mighty pillar of Dharma contemplation\nThat it may never break free and escape\nWith constant vigilance examine with all effort.",
    "One should diligently strive in samādhi practice,\nNot abandoning its discipline even for a moment,\nThinking: 'Where is my mind currently engaged?'\nThus one must vigilantly scrutinize the mind.",
    "In dangers and festivals and such situations,\nIf one cannot maintain all precepts, act as circumstances demand;\nFor during acts of generous giving,\nMoral discipline may be set aside, it is taught.",
    "When contemplating and beginning a dharma practice\nDirect not your mind toward other pursuits\nWith one-pointed attention fixed on that task\nFirst bring that very practice to full completion",
    "Thus indeed, with focused intentional practice, free from distraction, all is well accomplished\nOtherwise, neither foundational nor advanced practices reach completion\nThe secondary affliction of non-introspection, among the twenty afflictions\nWill not increase when this sequential path is followed, guarding both mind and body from decline",
    "When myriad forms of idle talk arise in various ways,\nAnd wondrous spectacles of many kinds appear before all,\nThough one may engage with compassion where duty requires,\nOne should dispel attachment whenever it emerges in the mind.",
    "When pointlessly digging soil, cutting plants,\nOr drawing lines in the soil without purpose,\nRecalling the Tathāgata's training precepts with mindfulness,\nOne should, fearing karmic consequences, abandon such acts immediately.",
    "When desiring to move about,\nOr wishing to speak,\nFirst examine your own mind,\nThen, with steadfastness, act with reasoned discernment.",
    "When you recognize your mind captivated by attachment\nOr overcome by anger toward perceived objects,\nAct not, speak not—apply the proper antidotes;\nRemain like a piece of wood, realizing all phenomena lack inherent existence.",
    "Wild and full of mocking laughter\nFilled with pride and intoxicated with arrogance\nHarboring intentions to expose others' faults\nSeeking to reopen settled disputes with deceit",
    "When faced with self-praise and vain boasting,\nOr when disparaging others with criticism,\nAmid abusive speech and heated conflicts,\nThen one should remain still as a log of wood.",
    "Should I desire gain, honor, and fame,\nOr wish for an entourage to serve my call,\nIf my mind seeks personal service or care,\nThen like wood I shall remain.",
    "When my mind desires to neglect others' welfare,\nPursue self-interest,\nOr engage in unnecessary speech,\nIn those moments I shall remain still as a piece of wood.",
    "When intolerance arises, laziness, and fear,\nLikewise reckless boldness and meaningless chatter,\nWhen biased attachment to one's own side arises,\nThen I remain like a log.",
    "Thus perceiving the mind thoroughly afflicted by defilements,\nOr engaged in fruitless, meaningless pursuits,\nThe bodhisattva-hero must, through proper antidotes,\nFirmly grasp and establish it in virtue, unwavering.",
    "With unwavering certainty in preparation, practice, and conclusion, deep faith in the Three Jewels\nSteadfast through all hardships, respectful and reverent in conduct\nRestrained by inner shame and mindful of how actions appear to the enlightened ones\nPeaceful through restraint of the five senses, wholly dedicated to bringing joy to all beings",
    "Mutually contradictory childish beings'\nDesires do not discourage, and\nWhen afflictions arise, these\nMinds arise – with compassion.",
    "In blameless activities I engage with purpose each day\nGuided by concern for both myself and all sentient beings\nLike a magical emanation with wisdom that sees no self\nI shall always maintain this mind—conscientious yet free from ego",
    "After long ages, having obtained this supreme moment of leisure,\nI contemplate this rare treasure again and again.\nLike Mount Meru, I hold my mind unmoved by afflictive emotions,\nTraining in moral discipline with this body that cannot sustain even itself.",
    "Vultures consumed by their craving for flesh.\nDrag here and there in all directions.\nIf your mind feels no displeasure toward them.\nWhy now do you give advice?",
    "Why, mind, do you grasp this physical form as 'mine'\nAnd protect it with food and clothing?\nIf you and this body are truly separate entities,\nWhat possible benefit could this transient vessel have for you?",
    "O deluded mind why do you not accept\nThis clean wooden figure as your self\nYet guard this foul mechanism of thirty-six impurities\nThat leaks filth from nine orifices what essence does it contain",
    "First, with your discerning intellect,\nSeparate this skin's covering completely.\nFrom the skeleton's framework, extract the flesh\nWith wisdom's sharp blade—find nothing inherently desirable.",
    "Having separated the bones into their parts,\nLook all the way to the marrow within,\nExamine what essence exists in this,\nInvestigate this yourself thoroughly.",
    "Having thus diligently searched with effort,\nIf you have found no essence therein,\nWhy now, through your manner of attachment,\nDo you still protect this body?",
    "O mind, consume not this impure body, |\nNor drink its blood, nor feed upon its entrails and fluids. |\nSince these parts are wholly unfit for consumption, |\nWhat real purpose can this body serve for you? |",
    "For vultures and jackals, their future food,\nIs it proper to guard this impure frame?\nThis precious human form, for all alike,\nIs merely an instrument for extracting virtue.",
    "Thus, even as you, the mind, zealously protect this body,\nWhen the merciless Lord of Death ruthlessly snatches it away\nAnd surrenders it to vultures and dogs as food,\nWhat will you, powerless, be able to do at that time?",
    "For a servant unfit for work,\nClothing and necessities are not provided.\nThough you nourish this body, it will ultimately depart elsewhere,\nWhy then do you, the mind, exhaust yourself with such pointless expense?",
    "Having given this body moderate payment in necessities,\nNow let it fulfill its purpose: studying, contemplating Dharma, and benefiting others. One should not give everything to this hired servant\nWithout receiving the sublime benefits of spiritual practice in return.",
    "View your body merely as a boat\nFor going to liberation and returning to benefit others\nTo accomplish the welfare of all sentient beings\nTransform it into a wish-fulfilling Buddha-form",
    "Thus, with mind as master of oneself complete,\nAlways maintain a face adorned with smiles.\nAbandon frowning and all contracted features,\nSpeak with honest openness, a loving friend to all the world.",
    "Never drop chairs and other objects with noise carelessly;\nDo not forcefully open doors with a slam;\nAlways delight in humble, stealthy conduct.",
    "Like heron, cat, and thief who move\nWith silent stealth and gentle tread,\nThus bodhisattvas reach their aims\nFor self and others' good—so should they always act.",
    "Of those skilled in offering virtuous counsel\nWho provide beneficial guidance without being asked with reverence, place upon your crown the words\nAlways be a student to all",
    "For all well-spoken Dharma teachings,\nOne should say 'Well spoken!' with joy.\nWhen seeing those creating merit,\nGenerate delight with praise.",
    "Praise others' virtues when they are not present\nAnd when their qualities are lauded affirm with consent\nWhen your own merits others recognize\nExamine them with humble truthful eyes",
    "All endeavors aim at happiness,\nYet such joy remains rare even when bought.\nThus, one should experience the bliss of joy\nThrough virtues accomplished by others.",
    "For me there is no loss whatsoever in this life\nIn the future great happiness awaits\nThrough hatred and jealousy comes displeasure and suffering\nIn the future life great suffering awaits",
    "When speaking, use words that are trustworthy and coherent,\nClear in meaning and pleasing to the mind,\nFree from attachment and aversion,\nAnd speak with a gentle, measured voice.",
    "May I gaze upon all beings with straightforward, loving eyes,\nRelying upon these very beings as fields of merit and generosity,\nThrough them alone—by cultivating bodhicitta and perfections—I shall attain Buddhahood,\nDrinking them in deeply, like one quenching spiritual thirst.",
    "Great merit arises from continuous intense dedication\nOr when employing antidotes to opposing traits\nWhen directed toward fields of quality, benefactors, or the suffering\nThese deeds yield magnificent results, as do their opposites",
    "Having become skilled and filled with joyful enthusiasm,\nI shall always personally undertake all virtuous activities.\nRegarding all such deeds and toward anyone whatsoever,\nI should not rely on others for their accomplishment.",
    "The perfections (pāramitās), beginning with generosity,\nProgress in order of increasing excellence.\nDo not abandon the greater for the sake of the lesser—\nPrimarily consider the welfare of others.",
    "Having thus understood, one should always\nBe fully engaged in working for others' welfare;\nFor the compassionate one with far-seeing wisdom,\nEven what is prohibited becomes permitted when done with farsighted compassion.",
    "Share with those fallen into misfortune,\nAnd those maintaining ascetic discipline.\nConsume a moderate portion,\nAnd give away all possessions except the three sacred robes.",
    "One should not harm the body that serves the sublime Dharma\nFor trivial purposes or minor gains\nBy caring for it thus in this manner\nOne will swiftly fulfill the aspirations of all beings.",
    "One should not relinquish one's life\nWhen compassionate motivation is impure.\nBut when free from miserliness and regret, one should give this body\nAs a cause for accomplishing great purpose in this and future lives.",
    "Do not teach the Dharma to those showing disrespect.\nTo one with wrapped head when not ill.\nTo those bearing umbrellas, staffs, or weapons.\nTo anyone with covered head.",
    "Humble and profound and vast\nWithout men do not teach women\nToward both lesser and supreme teachings\nWith equal reverence always practice",
    "A vessel for the vast Mahāyāna Dharma\nShould not be directed toward Śrāvaka or lesser paths\nOne must not abandon ethical discipline and vows\nOne should not entice with sūtras and mantras while neglecting proper conduct",
    "One should cover tooth-cleaning sticks and spittle when discarding them.\nThe disposal of urine and other bodily wastes\nIn water used for consumption or on common pathways\nIs condemned by the wise and righteous.",
    "One should not eat with a mouth overfilled with food.\nNor eat while making noise or with mouth gaping open.\nOne should not sit with legs stretched out.\nNor when washing hands should one rub both hands simultaneously.",
    "One should not share vehicles, beds, seats, or dwelling places\nalone with women who are not one's relatives.\nAll actions that cause worldly people to lose faith\nshould be identified, whether through direct observation or by inquiring from others, and such behaviors should be abandoned.",
    "Never point with a single finger.\nWith reverence use your right hand.\nAll should use their hands this way.\nThe path should likewise be shown.",
    "Do not wave your hands excessively when handling objects\nWhen making slight movements, produce a signal sound\nUse proper gestures like finger snaps with the right hand, all fingers extended\nOtherwise, you will become unrestrained and face the fires of hell realms",
    "Like the Protector in the nirvāṇa-bed's lion posture\nLie down facing your preferred direction properly covered\nWith full awareness resolved to rise swiftly for virtuous acts\nFrom the very beginning apply this intention with certainty",
    "The conduct of bodhisattvas\nIs taught to be immeasurably vast;\nYet these mind-purifying practices\nMust be steadfastly pursued until the mind is trained.",
    "Three times by day and three times by night\nRecite the Three Sections confession practice\nThrough reliance on the Victorious Ones and bodhicitta mind completing the four powers\nThe remnants of downfalls will thereby be pacified.",
    "Whether by one's choice or others' power,\nIn whatever situation one engages,\nThe trainings Buddha taught that apply to each circumstance,\nOne should practice these with diligent effort.",
    "There is nothing whatsoever that the children of the Conquerors should not learn in any field of knowledge.\nFor the wise one who abides in this way,\nThere is no action that does not become meritorious.\nThere is no merit that will not be attained.",
    "Whether directly or through indirect means,\nEngage in nothing but the welfare of sentient beings.\nSolely for the benefit of these beings alone,\nDedicate all virtuous roots toward supreme enlightenment.",
    "Never abandon the virtuous spiritual friend\nSkilled in the meaning of the Great Vehicle\nUpholding the supreme ethical discipline of bodhisattva conduct\nEven for the sake of your own life.",
    "From the liberation story of Śrīsaṃbhava,\nOne should learn the proper way of serving the guru.\nThis and other teachings proclaimed by the Buddha\nShould be understood through studying the sūtras.",
    "The trainings of bodhisattvas are seen in the sūtras;\nTherefore, one should study the Mahāyāna sūtras.\nAs for the Ākāśagarbha Sūtra,\nOne should examine it at the very beginning.",
    "The Śikṣāsamuccaya must certainly be studied time and again.\nFor therein is extensively displayed.\nThe constant conduct.\nWith its thirty-two ways.",
    "Or alternatively, for now, one should study\nThe Sūtrasamuccaya, a concise compilation.\nOne should also, with diligent effort, examine\nThe two works composed by noble Nāgārjuna.",
    "Whatever is not prohibited in the Buddha's teachings,\nThat very thing should be properly practiced by bodhisattvas.\nTo protect worldly minds from losing faith and to prevent wrong views,\nHaving studied the trainings, practice them with mindfulness.",
    "The repeated examination of the states of body and mind\nAgain and again—this alone\nIs what it means to guard introspective awareness, in brief,\nThis is the characteristic of introspective awareness.",
    "With my body I shall practice these teachings.\nWhat benefit comes from merely reciting words?\nBy only reading medical treatises,\nHow will the patient's illness be healed?",
    "From the Introduction to the Bodhisattva's Way of Life (Bodhicaryāvatāra).\nThis is the fifth chapter entitled 'Guarding Introspective Awareness' (saṃprajanya-rakṣaṇa)."
  ],
  [
    "A thousand kalpas' accumulated merit\nGenerosity, offerings to Sugatas, and other virtuous deeds\nOne moment of intense anger can overwhelm it all\nDelaying, though not destroying, their fruition",
    "There is no sin like hatred.\nNo austerity equals patience.\nTherefore, with concentrated effort, cultivate patience diligently.\nThrough various methods.",
    "When the thorn of hatred lodges within the heart\nThe mind cannot attain peace or meditative concentration\nNeither mental joy nor bodily pleasure is experienced\nSleep eludes, while equanimity and mental stability are lost.",
    "Even those whom the master honors with wealth and rewards\nAnd who depend upon his generous kindness,\nWhen anger takes possession of this hateful, unfortunate lord,\nThey grow disillusioned and seek to kill him.",
    "Even friends recoil from an angry person.\nThough they may be drawn through generous giving, they will not serve him.\nIn brief, there exists absolutely nothing by which\nan angry person can abide in happiness.",
    "Thus anger, the great enemy\nBrings forth forms of suffering.\nOne who, with disciplined effort, overcomes\nAttains happiness here and hereafter.",
    "Arising from the performance of unwanted actions\nand the obstruction of what is desired,\nanger—having found nourishment in mental unhappiness—\ngrows powerful and destroys me.",
    "Therefore I shall utterly destroy\nThe nourishment of mental displeasure\nThat sustains my enemy\nFor this foe has no other purpose\nThan to harm me\nBy destroying my virtue\nIn this life and beyond",
    "Whatever may befall me,\nI shall not disturb my joyful mind.\nUnhappiness fulfills no desires,\nWhile virtue diminishes.",
    "If a remedy exists for a situation,\nWhat purpose is there in feeling displeasure?\nIf no remedy exists for a situation,\nWhat benefit comes from being displeased?",
    "For myself and those dear to me,\nSuffering, contempt, harsh words,\nAnd ill repute are unwanted;\nFor enemies, the opposite applies.",
    "The causes of happiness arise but rarely,\nWhile suffering's causes abound and many.\nWithout suffering, no renunciation emerges.\nTherefore, mind, be steadfast.",
    "The devotees of goddess Uma and the people of Karnataka\nEndure the pain of burning, cutting, and other torments\nThey bear such meaningless suffering for empty aims\nSo why should I, who seeks liberation, be faint-hearted",
    "There exists no phenomenon whatsoever\nThat cannot become easy through habituation.\nTherefore, by becoming accustomed to minor harms first,\nOne can transform even great suffering into pleasant experience.",
    "From snakes and flies with painful stings\nFrom hunger, thirst, and such sensations\nFrom itching and afflictions great\nWhy not see these meaningless sufferings as chance for growth?",
    "Through cold and heat, rain, wind's harsh path,\nThrough illness, bondage, beatings cruel,\nI must not cultivate a fragile sensitivity;\nSuch weakness makes my suffering grow unbearable.",
    "Some, upon seeing their own blood,\nGrow more valiant with strengthened resolve.\nOthers, at the sight of another's blood,\nGrow faint and collapse—their minds overcome.",
    "This arises from steadfastness of mind,\nAnd from the manner of fearlessness.\nTherefore, regard all harm with equanimity,\nAnd remain unmoved when suffering befalls.",
    "Though suffering arises, the wise\nShould not disturb the clarity and joy of their mind.\nThe battle against afflictions requires antidotes—\nIn this combat, many hardships arise, yet herein lies true victory.",
    "Those who face suffering head-on and vanquish inner foes like anger\nThey alone are the truly victorious heroes\nThe rest are merely killers of corpses\nStriking what is already destined to perish.",
    "Another virtue of suffering is this:\nThrough disillusionment, it dispels pride.\nIt gives rise to compassion for those in samsara,\nIt makes one fearful of wrongdoing and joyful in virtue.",
    "I do not feel anger toward bile and such,\nThough they cause tremendous suffering.\nWhy then be angry at sentient beings?\nThey too are driven by conditions.",
    "Just as unwanted illnesses arise\nWithout our consent,\nSo too do afflictions like anger\nArise with forceful intent.",
    "Without thinking 'I shall become angry,'\nPeople spontaneously become angry nonetheless.\nWithout conditions thinking 'We shall produce anger,'\nAnger arises through dependent origination just the same.",
    "Whatever faults\nAnd various kinds of misdeeds\nAll come into being through the power of conditions\nThey have no independent nature",
    "Neither does the collection of conditions think, 'I shall generate this effect,'\nNor does that which is generated possess the thought, 'I was produced.'\nNor does the effect think, 'I am produced by those conditions.'\nNor does it exist with any such conscious awareness.",
    "What the Sāṃkhyas accept as primordial nature \nWhat others imagine as the permanent self\nThe thought I shall come into being cannot arise\nIntentional emergence never occurs",
    "That which has never arisen simply cannot exist.\nWho would desire such Prime Principle or permanent self to arise.\nBeing constantly fixated on objects it cognizes.\nIt would never cease nor shift its attention.",
    "If this self is permanent,\nit is clearly without activity, like space.\nEven when it encounters various conditions,\nwhat function could there be for something that undergoes no change?",
    "If at the time of action it remains just as before,\nWhat has the action done to benefit that permanent self?\nWhen claiming 'this is the action belonging to that self,'\nWhat connection could exist between the unchanging and causal conditions?",
    "Thus all things are under others' control,\nAnd those controlling causes themselves have no freedom.\nUnderstanding this, one does not grow angry at phenomena\nThat appear like magical emanations without inherent existence.",
    "Who could eliminate what? one objects,\nSuch elimination lacks inherent existence.\nYet through empty, conventionally designated remedies,\nThe cessation of suffering's stream—including hells—remains perfectly reasonable.",
    "Therefore, whether enemy or friend\nWhen you see them engaging in improper acts\nThink they act thus from conditions\nReflecting thus remain at ease",
    "If accomplishments arose from mere desire alone,\nNo suffering would befall any being whatsoever.\nFor no embodied creature throughout existence\nEver wishes to experience suffering.",
    "Through heedlessness and afflictive emotions, people harm themselves with thorns, abysses, and self-inflicted pains.\nSome driven by passion for women and worldly gains hard to attain.\nOthers for misguided liberation—they fast, mortify their flesh, and in vain.\nBecome their own worst enemies through lack of self-control.",
    "Some, overcome by afflictions, hang themselves and leap from precipices\nConsume poison and unwholesome food\nAnd through non-virtuous conduct\nInflict harm upon themselves.",
    "When under afflictions' control they harm\nEven their own beloved, precious self;\nHow then could we expect such persons\nTo refrain from harming others' bodies?",
    "When those possessed by mental afflictions \nEngage in harming themselves and others,\nIf compassion fails to arise in my mind,\nWhat possible justification could there be for anger?",
    "If harming others\nIs the inherent nature of childish beings,\nThen becoming angry at them is not reasonable,\nJust as it would be unreasonable to be angry at fire for having the nature to burn.",
    "Although these faults are merely adventitious,\nAnd sentient beings are gentle by their nature,\nStill, it remains unreasonable to become angry,\nJust as when rare acrid smoke appears in the open sky.",
    "Forsaking material instruments like sticks\nIf anger rises toward one who drives their action\nThey too are propelled by anger's blinding force\nBetter to direct my wrath at anger itself the true source",
    "In previous lifetimes, I have inflicted\nexactly this kind of suffering upon other sentient beings.\nTherefore, it is entirely appropriate that I,\nwho have caused harm to beings, should now experience this suffering in return.",
    "Both the assailant's weapon and my own body\nare equally causes of suffering.\nWhen that person takes up a weapon against my body,\nat whom should I be angry?",
    "This body, like a boil in human form,\nUnbearable to touch, filled with suffering.\nIf I, blinded by craving, grasp onto it,\nWhen harm comes to it, at whom should I be angry?",
    "Although I, like a foolish person, do not desire suffering\nI am greedy for the very causes of suffering\nWhen suffering arises due to my own faults\nWhy then do I become angry at others?",
    "Like hell's guardians and\nForests with razor-edged leaves,\nThese manifestations arise solely from my own karma.\nAt whom, then, should anger be directed?",
    "Prompted by my own past karma,\nThose who harm me come into being.\nBy their harmful actions they go to the hell realms.\nHave I not effectively destroyed these beings myself?",
    "By relying on these enemies,\nThrough patience, my negative karmas are purified.\nYet by directing their actions toward me,\nThey fall to hell for countless suffering.",
    "I am the one who harms these adversaries,\nWhile they benefit me,\nWhy then, completely reversing the truth,\nDo you, evil mind, erupt in anger?",
    "If I possess the quality of patience in my mind,\nI will not fall into hell realms.\nIf I have protected myself through this practice,\nWhat benefit has accrued here to those who caused harm?",
    "Even if I were to retaliate harm with harm,\nThose beings would not be protected but would escalate in anger and negativity,\nAnd my bodhisattva conduct would deteriorate,\nTherefore, patience would be destroyed.",
    "The mind, being formless by nature,\nCannot be destroyed by anyone anywhere.\nYet due to its grasping attachment to the body,\nThe body is afflicted by sufferings.",
    "Contemptuous looks, harsh words,\nAnd unpleasant speech,\nSince these cannot harm your body,\nWhy then, O mind, do you become so angry?",
    "If others are displeased with me,\nThey will not devour me in this or future lives,\nThey cause me no actual harm,\nWhy should I object to this?",
    "Since others obstruct my gains through their contempt,\nIf I dislike this disrespect shown toward me,\nMy possessions will perish here when I depart empty-handed,\nWhile the negative karma alone will firmly remain in my mindstream.",
    "Better for me to die today with virtue intact\nThan prolong life through wrong livelihood's path\nEven if I should dwell for ages in this realm\nDeath's suffering awaits, then karma's burden follows",
    "One who dreams of happiness for a hundred years and then awakens,\nAnd another who experiences happiness for just a moment before awakening,\nFor both, when they awaken from their dreams,\nTheir happiness is equally gone, leaving no trace behind.",
    "For both who wake from dreams of joy,\nThat happiness never returns.\nJust so at death's hour are alike—\nThose who lived long and those who lived briefly.",
    "Though I acquire many riches\nAnd enjoy abundant pleasures for a lengthy time,\nLike one robbed by thieves, I must depart to the next life\nNaked and empty-handed.",
    "If through wealth acquired I should live long,\nAnd think, I'll cleanse past sins and merit gain,\nYet anger rises when my wealth pursuit meets wrongs,\nWon't merit built through countless aeons drain?",
    "If the purpose for which I live\nIs destroyed,\nWhat use is such a life\nThat accomplishes nothing but negativity?",
    "If, because they cause harm to sentient beings,\nYou become angry at those who speak unpleasantly,\nThen why do you not similarly\nBecome angry at those who speak unpleasantly about others?",
    "Since faith's absence depends on others,\nYou show patience to the faithless ones.\nSince harsh words depend on afflictions' power,\nWhy not show patience to unpleasant speech?",
    "Toward Buddha images, stupas, and sacred Dharma texts,\nEven those who mock and destroy them,\nI should not generate anger or hatred,\nFor the Buddha and the Three Jewels cannot truly be harmed.",
    "When harm befalls your guru, relatives, and those dear to you.\nEven toward those who injure your friends.\nSee how they act from conditions, as previously explained.\nRecognizing their transformation by karma, dispel your anger completely.",
    "When embodied beings experience harm,\nWhether from conscious beings or mindless things,\nWhy selectively blame those with consciousness?\nTherefore, practice patience toward all harm.",
    "Some commit wrongdoings through delusion,\nSome become angry through delusion.\nWho among these can we declare faultless?\nAnd whom can we truly pronounce guilty?",
    "Why did I previously create karma\nThat now causes others to harm me?\nSince everything depends on karma,\nWhy should I harbor resentment?",
    "Having thus understood that suffering comes from karma,\nI shall diligently strive in meritorious deeds,\nSo that all beings may, toward one another,\nDevelop minds of loving-kindness and friendship.",
    "Just as when a house is ablaze,\nAnd fire travels to another dwelling,\nWhatever grass or such it might ignite,\nIs seized upon and cast away.",
    "When the mind becomes attached to objects of desire,\nAnd anger's flames ignite,\nFearing merit will burn away,\nOne must abandon such attachment instantly.",
    "If a condemned man's hand is cut off\nIf he's set free, what could be wrong with that?\nIf through human trials\nOne escapes the torments of hell, what could be wrong with that?",
    "If today I cannot endure even this much suffering,\nThen why do I not restrain anger,\nWhich is the cause\nOf the torments of hell?",
    "For the sake of desires, I have endured burning and countless torments,\nIn the hells for thousands of eons through my craving and anger.\nYet through all this suffering, I have accomplished nothing for myself,\nNor have I achieved even the slightest benefit for others.",
    "This suffering is not so severe\nAnd will accomplish purposes of great value\nIn suffering that removes the afflictions of beings\nOne should feel nothing but joy",
    "When others praise those rich in virtues\nEven your rivals—and find joy thereby\nWhy, O mind, will you not praise them too\nAnd share this mudita the Buddhas praise?",
    "This joyful happiness from praising others' qualities\nIs a blameless source of true bliss\nApproved by those endowed with noble qualities\nAnd supreme in attracting others to your spiritual circle",
    "If thinking, 'This will make my enemy happy.'\nYou refuse them joy through envy's grip.\nThen by withholding wages and gifts from servants.\nYou destroy both visible and future karmic benefits.",
    "When your own qualities are being praised,\nYou desire others to share in this happiness too.\nWhen others' qualities are being praised,\nYou refuse even your own happiness in doing so.",
    "All sentient beings desire happiness,\nHaving generated bodhicitta,\nWhen sentient beings find happiness by themselves,\nWhy then do you become angry?",
    "You aspire for beings to attain Buddhahood,\nWorthy of veneration in all three worlds.\nYet seeing them receive even modest respect,\nWhy do you burn with such jealousy toward them?",
    "One who you must nourish and support\nWhen they provide for themselves they give to you\nYet when a dependent finds their own livelihood\nInstead of rejoicing do you grow angry",
    "If one does not wish even worldly gain for beings,\nYet claims to desire their enlightenment,\nHow can bodhicitta possibly exist\nIn one who burns with jealousy at others' prosperity?",
    "Whether they received from that patron,\nOr remained within the donor's home,\nIf you possess none of these things,\nWhy care what was given or not given?",
    "Why through jealousy would you abandon merit and faithful patrons\nOr discard your own virtuous qualities that naturally attract offerings\nWhen others receive gains but you fail to maintain these worthy causes\nTell me for what reason would you not be angry with yourself",
    "Not only do you fail to feel remorse for the negative actions you have committed,\nBut you even desire to compete with\nOthers who have accumulated merit \nThrough proper conduct.\nEnd of the second volume.",
    "If your enemy suffers misfortune,\nWhat benefit could you derive from rejoicing?\nYour mere wishful thinking and desires\nCannot become a cause of their harm.",
    "Even if, by your will, that suffering befalls your enemy,\nWhat joy could this possibly bring to you?\nAnd if you claim your desires are fulfilled by this,\nWhat greater ruin exists than this hatred?",
    "This terrible hook of malice, cast by the fishermen of afflictions.\nIs indeed an unbearable barb.\nWhen caught by it, in the cauldrons of hell.\nThe hell guardians will surely boil one.",
    "Praise, fame, and honorific treatment do not generate merit.\nPraise, fame, and honorific treatment do not increase longevity.\nPraise, fame, and honorific treatment do not enhance my strength, nor prevent illness.\nPraise, fame, and honorific treatment do not bring physical comfort to my body.",
    "If I were truly wise about my own self-interest\nWhat benefit would there be for me in praise and fame\nIf merely mental pleasure is what I desire\nThen I might as well resort to alcohol, gambling, ornaments and the like",
    "For the sake of fame, wealth is given away,\nAnd even one's self is killed,\nWhat use are these syllables?\nWhen dead, who does this bring happiness to?",
    "When a sand house crumbles apart\nChildren wail in anguished grief\nLikewise when praise and fame diminish\nThe mind behaves just like a child.",
    "Since sound itself possesses no consciousness,\nIt cannot possibly conceive of praising me.\n'Others find joy in praising me'—a mere illusion;\nHow could their pleasure, forever theirs alone, truly benefit me?",
    "Whether it concerns others or myself,\nwhat benefit does another's joy bring to me?\nThat joy and happiness belongs solely to them;\nI cannot obtain even the slightest portion of it.",
    "If I am happy because of another's happiness,\nThen I should feel this same joy for all beings,\nWhy then, when others experience happiness,\nAm I not happy for them?",
    "Therefore, when one thinks 'I am being praised,'\nJoy arises within oneself;\nYet this too is baseless—mere sound without substance;\nIt is nothing but childish behavior, binding one to cyclic suffering.",
    "Praise and such things cause me to become distracted;\nThey destroy any disillusionment with saṃsāra I might have;\nThey breed jealousy toward those endowed with good qualities;\nThey destroy all excellence and prosperity.",
    "Therefore, those who stand before me\nto destroy my praise and such worldly things\nare they not truly engaged in my protection\nguarding me from falling into the realms of suffering?",
    "I seek liberation as my aim.\nI need not be bound by gain and praise.\nThose who free me from my bondage,\nHow could I feel anger toward them?",
    "I desire to enter suffering.\nJust as blessed by the Buddha.\nThose who become gates barring my passage.\nHow could I feel anger toward them?",
    "This person obstructs my merit.\nEven toward such, anger is not fitting.\nNo austerity equals patience's worth.\nThrough enemies, should I not firmly dwell therein.",
    "If I, due to my own faults, do not practice patience\nToward those who cause me harm,\nThen when the cause of merit stands readily before me,\nI alone am creating the obstacle to my spiritual progress.",
    "That which cannot arise without something,\nand which exists when that thing is present—\nthat very thing is its cause.\nHow then can it be called an obstacle?",
    "When the mendicant arrives at the proper time,\nHe is not an obstacle but the very cause that enables giving.\nWhen those who confer ordination appear,\nThey are not impediments but essential causes of the monastic path.",
    "In this world beggars are plentiful indeed\nWhile those who harm rare\nFor when I cause no offense to others first\nRarely does anyone arise to harm me without cause",
    "Therefore, like a treasure appearing in one's home\nWithout having been acquired through any labor,\nSince they serve as companions in my bodhisattva practice,\nI should cherish my enemies as supporters of my path.",
    "Since both this foe and I have accomplished patience together\nTherefore this fruit of patience\nMust first be offered to this very adversary\nFor they are the primary cause of patience itself",
    "If you say, 'The enemy is not worthy of veneration\nbecause he has no intention to help establish patience,'\nthen why do you venerate the sublime Dharma?\nJust like the enemy, the Dharma too can function as a cause for spiritual accomplishment, yet it also lacks any conscious intention.",
    "If an enemy with harmful intent\nIs not worthy of veneration, as you say,\nThen how could I cultivate the perfection of patience\nWhen faced with one who, like a physician, strives only for my benefit?",
    "Therefore, since patience arises\nIn dependence upon that very ill-intentioned person,\nThat same one, being the cause of patience,\nShould be venerated just like the sacred Dharma.",
    "Therefore, the Sage has taught: 'Sentient beings' field and\nVictorious Ones' field.'\nBy pleasing both, many have \nThus crossed to perfection's abundant shore.",
    "From sentient beings and Victorious Ones alike,\nThe sublime qualities of Buddhahood equally arise in us.\nWhy then do we revere the Victors\nBut not sentient beings—what manner of reasoning is this?",
    "The greatness of intention is not inherent in itself\nBut is established by its results leading to Buddhahood\nSimilarly sentient beings possess the potential for enlightenment\nTherefore they are equal to Buddhas as fields of merit",
    "When offerings are made to one possessing loving-kindness meditation,\nThis merit stems from the profound greatness of sentient beings themselves.\nWhatever merit arises from devotion and faith in the Buddha,\nThat likewise manifests from the Buddha's own greatness.",
    "Through inherent Buddha-nature that fulfills dharma qualities,\nThus they are considered equal in this regard.\nYet none can match the Buddhas\nWith their infinite ocean of excellences.",
    "One who possesses the unique collection of supreme qualities.\nEven a tiny fraction of qualities seen in someone.\nFor the purpose of honoring such a being.\nEven offering the three realms would be insufficient.",
    "The portion of causes for the supreme Buddha-dharma's arising\nExists within all sentient beings as well.\nFor this reason alone, in accordance with this aspect,\nSentient beings should properly be objects of veneration.",
    "Furthermore, to those who have become our true friends without pretense,\nWho bestow immeasurable benefits upon all beings,\nOther than pleasing sentient beings,\nWhat greater way could there be to repay their kindness.",
    "Those for whose sake the Sage would sacrifice his body and enter the Avīci hell,\nto benefit them is to repay his kindness.\nTherefore, even toward those who cause great harm,\none should perform only excellent deeds in all circumstances.",
    "Since even my own Lord himself\nDisregards even his own body for others' sake,\nHow could I, in my delusion, show pride\nRather than adopt a servant's nature toward these various masters.",
    "When the happiness of sentient beings brings joy to the Lords of Sages,\nAnd when harm to these beings causes the Perfect Ones to feel displeasure,\nBy bringing joy to these beings, one makes the supreme offering that pleases all Lords of Sages.\nBy causing harm to these beings, one has precisely and equivalently harmed the Sages themselves.",
    "Just as one whose body is ablaze on all sides\nCannot find joy in any pleasures however desirable,\nSo too when harm is done to sentient beings,\nThe greatly compassionate ones cannot possibly be pleased.",
    "Therefore, I who have harmed beings,\nAnd thus displeased all those of great compassion,\nToday I openly confess each sin individually,\nFor all displeasure caused, I beseech the Mighty Sages for patience.",
    "To please the Tathagatas,\nFrom this day forward, I firmly commit myself to becoming a servant of the world.\nWhether the masses strike me on the crown of my head with their feet,\nOr even kill me, I shall not be provoked; may the Protector of the World be pleased.",
    "All beings in this world have been made their own by those whose nature is compassion.\nThere is absolutely no doubt about this.\nIndeed, these beings who appear in the form of sentient beings are none other than the protectors themselves.\nWhy then should one not show reverence to them?",
    "This practice of patient endurance and showing respect toward beings truly pleases the Tathagatas (Buddhas).\nThis same practice accomplishes one's own purpose by accumulating merit.\nThis patience and kindness toward beings dispels worldly suffering by enabling them to engage in virtuous actions.\nTherefore, I shall always diligently practice these three types of patience, pleasing all beings.",
    "Just as a royal official may oppress the common people, the far-sighted multitude, who discern future consequences, though fully capable, wisely choose not to retaliate.",
    "Since none from royal ranks acts alone,\nThe king's power serves as their strength and force.\nLikewise, even the feeblest wrongdoer\nShould never be despised, harmed, or ignored.",
    "Thus the guardians of hell and\nThose with compassion are their forces.\nJust like commoners to a fierce king,\nOne should please all sentient beings.",
    "What harm can an angry king truly inflict, |\nCan he cause the torments of hell, |\nThat one will experience in future lives, |\nFrom causing distress to sentient beings. |",
    "Even if a king is thoroughly pleased,\nBy delighting sentient beings,\nThat which is attained—\nNo king can bestow Buddhahood itself.",
    "That comes from pleasing sentient beings through patient care and benefit;\nLet alone future Buddhahood, why do you not see even in this very life\nThe prosperity that becomes a foundation for qualities, fame that spreads widely, and happiness arising from benefiting all?",
    "While wandering in saṃsāra, through patience one attains beauty with complete faculties and form,\nFreedom from illness, great renown, and abiding happiness,\nAn extremely long life with sustained well-being,\nAnd the abundant prosperity of a universal monarch establishing virtue.",
    "From the Bodhicaryāvatāra (Introduction to the Bodhisattva's Way of Life), this is the sixth chapter entitled 'Teaching on Patience' (Kṣānti-pāramitā)."
  ],
  [
    "Thus endowed with patience, one should strive with diligence\nFor upon diligence, enlightenment rests as if in one's palm\nJust as without wind there can be no movement\nWithout diligence, neither merit nor wisdom can arise",
    "Diligence is enthusiasm toward virtue.\nLet me explain its contrary aspects.\nLaziness is attachment to idleness and engagement in negative pursuits.\nAnd self-deprecation that undermines confidence in one's spiritual capacity.",
    "From savoring the pleasure of idle relaxation\nAnd the craving that seeks refuge in sleep\nFrom not being disheartened by saṃsāra's suffering\nLaziness arises",
    "Ensnared by the net of afflictions,\nAnd fallen into the trap of birth,\nYou have entered the jaws of the Lord of Death.\nWhy do you still not recognize this and act?",
    "Do you not see your own kind\nBeing slain, one after another?\nYet still you sink into sleep\nLike an outcast and a buffalo.",
    "With all paths blocked completely from every direction,\nWhile under the vigilant gaze of Yama, Lord of Death,\nHow can you take pleasure in eating?\nHow can you sleep and how can you find delight?",
    "Since death will swiftly strike in this degenerate age\nGather well the twin accumulations while you still can\nThough at the Lord of Death's approach you cast off sloth\nWhat provisions for the journey can you secure when time has run out",
    "This task remains unbegun though conceived in mind,\nThat one barely started, this half-complete stands,\nWhen suddenly the Lord of Death arrives,\n'Alas! I am destroyed!' one thinks, virtues neglected while evils done.",
    "With face swollen by grief's force,\nTears streaming from blood-red eyes, one sees hopeless relatives mourning the impending loss,\nWhile gazing upon the terrifying faces of Yama's messengers,\nWho come to lead one's soul to judgment based on karmic deeds.",
    "When tormented by memories of your own misdeeds,\nAnd hearing the hellish cries of torment,\nYour body soiled with filth as terror overwhelms you,\nWhat can you possibly do when bewilderment seizes your mind?",
    "Like a living fish writhing desperately on hot sand,\nYou are gripped by fear even in this present life.\nWhat need is there even to speak of the inconceivable\nTorments of hell that await those who commit negative actions.",
    "When touched by hot water,\nYou with tender, youthful skin cannot endure even this burning sensation.\nYet having committed deeds that lead to hell realms,\nWhy do you remain lazily at ease?",
    "Those lacking effort yet craving spiritual fruits\nThe delicate ones who suffer countless harms\nThough seized by death yet distracted like gods\nAlas! They are crushed by sufferings",
    "Having reached the vessel of human birth with its freedoms and advantages,\nCross over the great river of suffering of the three realms of existence.\nThis boat will be exceedingly difficult to find again.\nO deluded one, this is not the time for slumber.",
    "Having abandoned the supreme joy of the sublime Dharma,\nBoundless source of bliss,\nWhy do you delight in worldly concerns that cause suffering,\nIn frivolity, agitation, and laughter?",
    "Undiscouraged with armor-like resolve །\nWith fourfold forces gathered like a king's might །\nMaster body speech mind through potent antidotes །\nEqualize self and other then exchange for supreme awakening །",
    "I should not think 'How could I attain enlightenment?'\nI must never fall into discouragement.\nFor the Tathāgata speaks only truth.\nHe has proclaimed this truth: that all beings will awaken.",
    "Even mosquitoes, flies, bees,\nAnd those who have become worms,\nIf they too generate the power of diligence,\nThey will attain supreme enlightenment, so difficult to reach.",
    "Born human in this supreme realm\nI discern what helps and harms\nIf I practice the bodhisattva path without wavering\nWhy would I not certainly attain awakening",
    "Yet if I fear that I must give away\nMy hands, feet, and other bodily parts,\nWithout discerning between heavy and light,\nThrough ignorance alone, I am merely afraid.",
    "Through countless billions of eons,\nRepeatedly cut, pierced, burned, and torn apart,\nThrough innumerable violent dismemberments,\nYet enlightenment was never attained.",
    "This suffering of mine for attaining awakening\nIs limited in measure;\nLike pain from surgery removing a piercing thorn,\nIt dispels greater suffering when that harm is gone.",
    "All physicians cure disease through treatments that cause discomfort;\nThough painful, these procedures create freedom from illness.\nTherefore, to eliminate the numerous sufferings of the three realms of samsara,\nOne should endure minor discomforts of spiritual practice and austerities.",
    "The Supreme Physician does not employ\nSuch harsh treatments as bloodletting or cauterization;\nThrough exceedingly gentle methods instead,\nHe heals immeasurable great diseases.",
    "At first, the Guide instructs those who struggle\nTo practice giving vegetables and simple gifts.\nThrough steady practice, mental resistance fades,\nUntil gradually, one offers even one's own flesh.",
    "When toward one's own body\nOne develops a perception as if it were mere vegetables,\nThen in giving away one's flesh and so forth,\nWhat difficulty indeed could there be?",
    "The Bodhisattva feels no suffering, having abandoned negative deeds.\nAnd knows no mental distress, having realized selflessness.\nFor it is wrong conceptualization that clings to 'I' and 'mine'.\nAnd negative actions that bring affliction to both mind and body.",
    "Through merit, the body experiences comfort,\nThrough wisdom, the mind finds happiness.\nThough they remain in saṃsāra for the benefit of others,\nWhy would the compassionate ones ever become weary?",
    "Through the power of the awakening mind (bodhicitta),\nPrevious sins are exhausted completely,\nAnd oceans of merit are gathered within—\nThus, one is taught to surpass the śrāvakas in swiftness.",
    "That dispels all weariness and toil,\nMounted on the steed of bodhicitta\nWhen moving from joy to greater joy,\nWho, with discerning mind, would lose heart?",
    "To accomplish sentient beings' welfare, like a Dharma monarch's might, four powers form the army against sloth: aspiration's zeal for right,\nSteadfastness that completes all tasks with care, joy like a child at play, and relinquishment—wise rest before return to virtuous way.\nGenerate aspiration—root from which these powers spring—by contemplating both the suffering that non-virtue brings\nAnd liberation's benefits; this dual reflection breeds the firm conviction for the path that bodhisattva heirs most need.",
    "Having thus uprooted adverse factors,\nThrough devotion, confident resolve, \nJoy, renunciation, and wholehearted practice,\nStrive to increase diligence with mastery and strength.",
    "The countless faults of myself and others\nI must overcome\nWhere for even a single fault\nOceans of eons would be exhausted",
    "When I see not even a trace\nOf my efforts to eliminate faults,\nThe place of immeasurable suffering,\nWhy does my heart not break.",
    "I must cultivate countless virtues and qualities\nFor both myself and others' mindstreams;\nFor each single virtue to be mastered\nWould oceans of eons suffice?",
    "I have never developed familiarity\nwith even a portion of excellent qualities.\nSomehow I obtained this human birth,\nyet wasted it to no purpose—how astonishing!",
    "I have not worshipped the Blessed One,\nNor bestowed the happiness of great festivals.\nI have not performed service to the doctrine,\nNor fulfilled the wishes of the poor.",
    "I have not given fearlessness to the frightened,\nNor bestowed happiness upon the suffering.\nI merely became a painful burden in my mother's womb—\nMy birth has served no purpose but to cause suffering.",
    "In both my previous lives and at present.\nDue to my separation from devoted interest in the Dharma.\nSuch spiritual destitution has befallen me.\nWhat rational person would abandon their conviction in the Dharma?",
    "The Sage proclaimed that devotion to the Dharma\nIs the root of all virtuous qualities.\nAnd the constant foundation of that devotion\nIs meditation on the definite ripening of karma's fruits.",
    "Physical sufferings like sickness and mental distress,\nVarious fears from humans and non-humans throughout all realms,\nSeparation from what one desires while encountering the unwanted,\nAll arise from negative actions, not from evil people.",
    "Wherever the aspirations of those who do good deeds lead them,\nThere, by their merit,\nThey are honored with the fruits \nOf their virtue.",
    "Though evil-doers crave for happiness,\nWherever they may journey, realm to realm,\nTheir deeds pursue them there like shadows cast,\nBy karmic law, their ripening misdeeds strike them down with suffering's weapons, sharp and merciless.",
    "Within vast, fragrant, cool lotus hearts they dwell\nTheir radiant forms nourished by the nectar of Buddha's sixty-toned melodious speech\nFrom lotuses painlessly opened by the Sage's illuminating light they emerge with sublime bodies\nThrough pure virtuous deeds alone they become Sugata's children directly taught before Buddha Amitābha",
    "With skin completely flayed by Yama's henchmen, wailing in agony,\nTheir bodies drenched with molten copper liquefied by intense heat,\nTheir flesh struck and scattered into hundreds of pieces by blazing swords and spears,\nThey fall repeatedly onto scorching iron grounds—fruit of heinous deeds done without remorse.",
    "Therefore, reflecting on cause and effect, aspire to virtue\nAnd meditate with single-minded reverence and faith\nThrough the Vajra-banner ritual method, as taught in the sutra\nHaving begun, cultivate the confidence to persevere to completion",
    "First, one should carefully examine one's resources and capabilities.\nBased on this assessment, one should decide whether to undertake the action or not.\nIt is indeed superior not to begin something at all if one lacks the necessary capacity.\nHowever, once having started an endeavor, one should never turn back or abandon it before completion.",
    "In future lives one grows habituated to this\nNon-virtuous actions and suffering will multiply\nOther endeavors and their time of fruition \nWill degrade in quality and remain unaccomplished",
    "One should cultivate noble confidence in three domains.\nActions, afflictions, and one's capacity to overcome them.\nThinking, 'I alone must accomplish this.'\nThis constitutes the proper pride in action.",
    "This world, enslaved by afflictions, is incapable\nOf accomplishing even its own aims.\nSince beings cannot practice virtue as I can,\nTherefore I myself shall undertake this task.",
    "When others perform lowly tasks,\nHow can I remain here idle? If I don't act thus out of pride,\nBetter that my pride be destroyed.",
    "When encountering a dead snake,\nEven a crow behaves like mighty Garuda;\nIf my mind becomes weak and feeble,\nEven minor downfalls cause grievous harm.",
    "When, with dejection, one abandons efforts,\nIs there any escape from suffering?\nBy generating pride and diligent effort,\nEven great ones find it difficult to overcome.",
    "Therefore, with a steadfast mind,\nI shall defeat all downfalls.\nIf I am defeated by these downfalls,\nMy aspiration to conquer the three realms will become a matter of ridicule.",
    "I shall conquer all\nBy none shall I be overcome\nI, child of the Victorious Lion\nShall maintain this pride.",
    "Beings conquered by pride suffer,\nNot those with noble pride.\nThe nobly proud resist enemies,\nOthers fall to pride's power.",
    "Filled with the affliction of pride\nPride leads one to lower realms of existence\nEven in human rebirth, one's celebrations are destroyed\nBecoming a servant subsisting on others' food\nA fool like a pig, unsightly as a frog, weakly emaciated",
    "Everywhere one becomes despised.\nThose ascetics practicing austerities, yet puffed up with pride.\nIf even such practitioners are counted among the arrogant ones.\nWhat can be said of these pitiable beings.",
    "They alone are truly proud, victorious, and heroic\nWho bear the antidote-pride to vanquish the enemy of afflictive pride\nWho, having thoroughly conquered even the stirring foe of 'I am' pride that seeks to rule the three realms\nBestow upon all sentient beings exactly as they wish the fruit of victory: complete enlightenment.",
    "When dwelling amidst conditions that trigger afflictions\nApply antidotes with a thousandfold intensity  \nLike a lion untroubled by packs of smaller beasts\nLet your mind remain unmoved by hosts of passions",
    "Even amid great dangers,\nAs one protects the eye,\nSo too when facing hardship,\nOne should never fall under the power of afflictions.",
    "I would rather be burned and killed,\nOr even have my head cut off;\nBut in no way whatsoever\nWill I bow to afflictions as my enemies.\nLikewise, in all circumstances,\nI will practice only what accords with reason.",
    "Like children delighting in the joy of play\nSo should bodhisattvas be drawn to their virtuous deeds\nDevoted to these actions never satisfied\nYet finding inherent happiness in this spiritual joy",
    "Though actions are performed for the sake of happiness,\nWhether they will bring happiness remains uncertain,\nFor bodhisattvas whose virtuous deeds themselves become sources of immediate and lasting joy,\nHow can one find happiness without performing such actions?",
    "Like honey on a razor's edge that severs the tongue,\nIf worldly desires never satisfy, just increasing thirst like salt water,\nHow could one ever be satiated by meritorious nectar of the bodhisattva path,\nWhich brings both sweet ripening happiness in higher realms and the peaceful bliss of nirvana?",
    "Therefore, to perfect this third power,\nJust as an elephant scorched by midday heat,\nWhen meeting a lake, plunges in,\nOne should likewise engage in these deeds.",
    "When strength is depleted through spiritual exertion,\nSet it aside with joy, intending to resume when restored.\nThough a practice may be well accomplished,\nRelinquish it, yearning for ever more excellent pursuits.",
    "Like skilled warriors in sword combat with a trained foe,\nDefend against the blows of afflictions with vigilance,\nWhile striking forcefully at these enemy passions,\nFight this dual battle with mindful determination.",
    "Just as one terrified in battle quickly retrieves\nA sword that has fallen,\nSo too, when your weapon of mindfulness slips away,\nSwiftly reclaim it, remembering the terrors of hell.",
    "Just as poison, having entered the blood,\nSpreads throughout the entire body,\nLikewise, when afflictions find an opening,\nThey completely pervade the mind.",
    "Like one who carries a vessel filled with mustard oil;\nWatched by men with drawn swords standing nearby;\nWho proceeds with intense focus, fearing death should it spill;\nSo should the disciplined practitioner.",
    "Just as one springs up instantly in terror\nWhen finding a serpent coiled upon one's lap,\nSo too when drowsiness and sloth arise,\nOne should swiftly dispel them.",
    "For each and every fault that arises,\nI shall thoroughly reproach myself and,\nReflecting long on past harmful outcomes\nBy all means, I must ensure this fault never returns.",
    "How shall mindfulness become thoroughly habituated\nIn these various states of practice?\nWith this cause as motivation, one should seek\nEither association with virtuous Mahāyāna teachers \nor engagement in appropriate spiritual activities.",
    "To ensure one's virtuous deeds have power from the beginning,\nOne should recall the teachings on mindfulness,\nAnd make oneself light and ready to rise;\nJust as before, one remains prepared for all actions.",
    "Just as cotton is controlled by the wind's\nComing and going movements,\nLikewise, through joyful effort one masters,\nThus prosperity and accomplishment arise.",
    "Thus concludes the seventh chapter, called 'The Perfection of Diligence,' from 'Entering the Bodhisattva's Conduct.'"
  ],
  [
    "Having thus generated diligence,\nPlace the mind in meditative concentration. One\nWhose mind is completely distracted\nDwells within the jaws of afflictions.",
    "Through seclusion of body and mind,\nDistractions cannot possibly arise;\nTherefore, abandon worldly engagements entirely,\nAnd completely discard all conceptual thoughts.",
    "Due to attachment to beings and craving for gains and such,\nOne does not renounce the worldly entanglements;\nTherefore, having completely abandoned these inner and outer attachments,\nThe discerning sage should contemplate thus.",
    "Understanding that insight, when endowed with calm abiding,\nThoroughly destroys the afflictions,\nFirst seek calm abiding,\nWhich is accomplished through genuine delight in isolated places, free from attachment to worldly concerns.",
    "What impermanent being could rightfully form attachment to that which is impermanent?\nThrough such attachment, across thousands of births,\nOne will find neither joy nor their beloved again.",
    "Not seeing the desired object, one finds no joy.\nThe mind cannot rest in meditative concentration.\nEven upon seeing it, one remains unsatisfied.\nJust as before, tormented by craving's thirst.",
    "If one becomes attached to sentient beings, \nit completely obscures one from seeing reality as it truly is. \nSuch attachment destroys the mind of renunciation \nand ultimately leads to being tormented by grief.",
    "By obsessing over these transient friends,\nThis precious human life wastes away in vain.\nThrough attachment to impermanent companions,\nThe eternal Dharma leading to supreme liberation is destroyed.",
    "If one engages with ordinary beings (bāla) through body, speech, and mind,\nOne will certainly descend to the lower realms of existence.\nWhen they lead one away from the noble lineage's path of few desires, contentment, and renunciation,\nWhat benefit is there in relying on such unwise beings?",
    "In an instant they become friends,\nIn an instant they become enemies.\nWith fickle minds, they grow angry at what should bring joy and virtue—\nThese childish, ordinary beings are impossible to please.",
    "When I speak what benefits them in dharma they respond with anger\nThey actively create obstacles to turn me away from virtuous deeds that bring benefit\nIf I do not heed their discouraging words and distractions\nAngered at being ignored these childish beings accumulate karma for unfortunate rebirths",
    "From the superior, one feels jealousy; with equals, one competes in rivalry.\nTowards the inferior, one displays pride; when praised, one becomes arrogant.\nWhen criticized with unpleasant words, anger arises.\nWhen will one ever obtain benefit from childish people?",
    "When associating with the childish—unless one is a noble being—\nSelf-praise, disparagement of others, \nAnd talk that fosters attachment to cyclic existence—\nFrom such company, non-virtue will certainly emerge.",
    "Thus, associating with childish persons\nOnly leads to mutual destruction\nThey have not acted for my spiritual benefit\nNor shall I become beneficial to them",
    "From childish people—friends and kin—flee far away\nIf you must meet them, please them briefly with kind speech\nAvoid developing any deep familiarity\nRemain neutral and detached, like meeting strangers anew.",
    "Like a bee taking honey from flowers without harm\nI shall extract merely the essence of Dharma\nMaintaining distance as if meeting all for the first time\nI shall dwell everywhere without becoming familiar.",
    "I have gained many possessions and honors\nAnd many people are drawn to me with affection\nIf I harbor such conceited pride\nAfter death, fear of the hell realms will arise",
    "Wherever the deluded mind, bound by self-clinging,\nBecomes attached to objects of pleasure and worldly gain,\nThose very attachments, combined and multiplied thousandfold,\nRise up like an awakening old bear as intense suffering.",
    "Therefore the wise should not become attached.\nFrom attachment arises fear.\nSince these things will by their nature be abandoned.\nEstablish your mind firmly and thoroughly investigate.",
    "Many have gained wealth and possessions,\nAnd though fame and praise have come about,\nWith these accumulations of riches and renown,\nThere is no certainty where one will go.",
    "If others exist who criticize me,\nWhat reason is there to rejoice in praise?\nIf others exist who praise me,\nWhat reason is there to be troubled by criticism?",
    "Sentient beings with diverse karmic dispositions,\ncannot be pleased even by the Victorious Buddhas,\nhow much less by an inferior ignorant one like myself,\ntherefore, abandon all concern with worldly thoughts.",
    "Childish beings disparage those lacking possessions\nAnd speak ill of those who have wealth\nBy nature difficult to associate with\nHow could joy arise from such beings",
    "Since childish persons are incapable of joy\nUnless it serves their self-interest\nThe Tathagatas have proclaimed\n'No childish person can truly be anyone's friend.'",
    "In the forest, wild animals, birds,\nAnd trees never utter unpleasant words.\nWhen will I dwell with these pleasant companions,\nAmong whom life is peaceful?",
    "In caves or empty temples\nDwelling at the foot of a tree\nWhen will I no longer look backward\nBecoming completely free from attachment",
    "When will I dwell in places that no one claims as their own,\nIn naturally spacious and open areas,\nMoving about freely at will without attachment -\nWhen will I dwell?",
    "Having just a begging bowl and the like\nWearing clothes that no one would steal\nEven without concealing this body\nWhen will I become one who dwells without fear?",
    "Having gone to the charnel ground,\nWhen shall I equalize my own body\nWith the skeletal remains of others,\nRecognizing both as equally subject to destruction?",
    "This very body of mine\nWill certainly become so putrid\nThat even jackals repelled by its stench\nWould not dare approach it.",
    "Even this single body of mine\nIts bones, born together as inseparable parts\nWill fragment and scatter in separate ways.\nWhat need to mention other beloved ones\nWho've converged through separate karmic conditions?",
    "Alone one is born into this world\nAnd in absolute solitude one dies\nSince none can bear another's burden of suffering\nWhat purpose do dear ones serve who create obstacles to virtue.",
    "As travelers on journeys seize and leave each dwelling place,\nJust as they hold onto their stopping places along the way,\nLikewise, those who travel the path of existence,\nFully grasp and cling to each birthplace.",
    "While the world laments with tearful eyes,\nAs long as the four pallbearers,\nHave not yet lifted the body from its place,\nUntil then, retreat to the forest.",
    "Without attachments or enmities,\nDwelling alone with just this body in a secluded hermitage,\nHaving already considered oneself dead to the world,\nWhen one actually dies, there is no cause for others to lament.",
    "In mountain solitude, no attendants near.\nCause sorrow or distress through grieving here.\nNone disturb one's Buddha recollection.\nOr Dharma thoughts upon death's liberation.",
    "Therefore, I shall dwell alone in delightful solitude\nEffortless, conducive to peace, and bringing joy\nWhere all distractions are naturally pacified\nSuch solitude I shall always cultivate",
    "Abandoning all worldly thoughts,\nWith single-pointed attention examining only my own mind,\nI shall strive for the meditative equipoise of mind,\nAnd for its discipline, cultivating both aspects of bodhicitta.",
    "In this world and the beyond,\nDesires indeed produce calamities.\nHere, they cause killing, binding, and severing;\nBeyond, they generate hell, hungry ghost, and animal realms.",
    "For whose sake, in the past, male and female messengers.\nMaking numerous supplications with joined palms.\nFor whose sake, without concern for grave sins or ill reputation.\nWithout hesitation risking dangers and exhausting resources.",
    "Though I plunge myself into gravest dangers,\nAnd exhaust my wealth in wasteful spending,\nThose very women's bodies I embrace with passion,\nAre but flesh-wrapped bones yielding false, fleeting joy.",
    "Female bodies are but skeletons nothing more\nNeither independent nor constituting a self\nThough you intensely desire and thoroughly cling to them\nWhy not proceed to nirvana",
    "That face, when lifted with effort, yet downcast through shyness.\nWhether previously seen or unseen before marriage.\nNow veiled with cloth according to regional custom.\nWill one day be unveiled by vultures in the charnel ground.",
    "Behold that face which once inflamed your passion\nNow plainly exposed where once it shyly turned away\nSee how the vultures have laid bare what you jealously guarded\nWhy do you now flee in terror from what you once claimed as yours?",
    "That which you jealously guarded from even others' gazes.\nThat body you so completely protected.\nNow when it is being consumed by scavengers.\nWhy, O possessive one, do you not protect it.",
    "Seeing this mound of flesh,\nDevoured by vultures and other creatures,\nFood for others adorned with flower\nGarlands, sandalwood and ornaments.",
    "You tremble at a motionless skeleton,\nMere bones seen in the charnel ground;\nYet why not fear when these same bones stir,\nAnimated by inner winds, like a vetāla-possessed corpse you cherish?",
    "If attachment persists even for what is covered,\nWhy would the same uncovered not be desired?\nIf it serves no purpose in its natural state,\nWhy then is this covered form caressed?",
    "From a single source of food\nFeces and saliva emerge;\nWhile you find feces repulsive,\nWhy do you delight in saliva?",
    "Soft as cotton to the touch,\nRejecting pillows with delight,\nClaiming: 'They do not ooze with foul smell'—\nThose filled with desire, deluded by impurity.",
    "The lustful, wicked, and deluded ones,\ntouch cotton, feeling its softness,\nsaying, 'One cannot engage in sexual intercourse with this,'\nthey become angry at it.",
    "If you have no passion for the impure,\nThis is merely a skeletal cage bound together by tendons,\nSmeared with the muddy filth of flesh.\nWhy then do you embrace another person in your lap?",
    "You yourself contain many impurities\nYet constantly enjoy this very vessel of filth\nAnd toward other sacks of impurity\nYou crave and desire with longing for impurity",
    "I am fond of this flesh,\nAnd wish to see and touch it eagerly.\nIf flesh by nature lacks consciousness,\nWhy do you not desire corpse-flesh equally?",
    "The mind that you desire,\nCannot be touched nor seen.\nWhat can be touched is not consciousness.\nWhat purpose does meaningless embracing serve?",
    "That you see not another's body as impure\nNo wonder in that\nBut that you perceive not your own body's manifest filth\nThat truly is astonishing",
    "Having abandoned the young lotus flower\nthat blossoms in the cloudless sun's rays,\nwhy would one whose mind is fixated on impurity\nfind it reasonable to delight in a mere cage of filth?",
    "If you refuse to touch ground\nThat is defiled by impurities,\nHow then can you desire to touch\nThe body from which they emerge?",
    "If you claim no attachment to impurity,\nThat body, born from an impure field,\nWas developed from seed,\nWhy do you embrace another in your lap?",
    "You reject the tiny impure worm born of filth.\nToo foul for your desire.\nYet eagerly crave the body—vessel of many impurities.\nItself a product of the same defilement you despise.",
    "You do not feel revulsion for your own impure body.\nNot only that, but moreover,\nYou, an impure vessel, toward the impure,\nWith craving, desire others as well.",
    "Even pleasant substances like camphor and other delights,\nRice dishes and savory vegetables too,\nWhen put in the mouth, then removed and discarded,\nRender even the ground impure and defiled.",
    "If even this impure body, though directly perceived,\nYou still doubt its nature,\nThen observe other corpses cast in charnel grounds\nThe impure remains that reveal truth beyond question.",
    "When the skin is peeled away,\nGreat terror arises,\nYet knowing this truth about the body,\nHow can desire repeatedly arise?",
    "The fragrance applied upon the body\nComes from sandalwood and such, not from itself.\nWhy then are you attached to others' bodies\nFor a scent that truly belongs elsewhere?",
    "Since the body is naturally foul-smelling,\nWould it not be better to remain unattached to it?\nWorldly people with their meaningless cravings,\nWhy do they anoint it with external fragrances?",
    "What of fragrant sandalwood's sweetness\nHas truly come to this inherently foul body?\nWhy are beings drawn to others through scents\nDeliberately applied to incite attachment?",
    "If with long hair and nails, teeth blackened and yellowish-gray,\nThe naked body reeking with filth and mud's foul stench,\nIn its natural state appears demon-like and terrifying—\nWhy do we meticulously polish this weapon that only harms ourselves?",
    "Like weapons that inflict self-harm when polished,\nWhy labor to cleanse and adorn this form?\nThrough efforts born of delusion,\nMadmen fill this earth with chaos.",
    "Having seen mere skeletons in the cremation ground\nYou turn away with disgust and revulsion\nYet do you delight in the village cremation ground\nFilled with moving skeletons animated by mind and wind",
    "Thus, even this impure female form cannot be obtained without payment.\nGold, horses, or lesser means are required for the price.\nThe toil of pursuing that purpose exhausts one completely.\nLeading to sufferings in hell and other such realms.",
    "In childhood, one cannot gather wealth\nIn youth, without such wealth, how can one find pleasure\nIf life is wasted in travel and trade merely accumulating riches\nWhat use are sensual desires when old age renders them impossible",
    "Some evil men, consumed by sensual desires,\nExhausted from toiling the entire day,\nReturn home with depleted bodies,\nAnd lie like corpses in sleep.",
    "Some tormented by journeys for trade or plunder\nSuffer both mental anguish and physical pain in distant lands\nThough yearning for their children and wives denied even basic touch\nFor years they cannot glimpse these beloved ones despite their longing",
    "Those deluded by desires sell themselves or their kin for promised gains,\nYet obtaining nothing, their precious human birth is wasted in vain,\nDriven helplessly by the winds of others' karma,\nCreating present suffering and future obstacles to liberation.",
    "Some sell their own bodies,\nAnd powerlessly are controlled by others.\nTheir wives, when children are born,\nMust give birth beneath trees in wilderness.",
    "Fools deceived by desire, believing they'll sustain their lives;\nThough fearing death, enter battles, for profit's sake they submit to servitude.",
    "Some, driven by sensual desires like moths to flames, have their bodies cut apart.\nOthers who transgress through craving are impaled on stakes as royal punishment, like deer lured by sounds.\nSome are pierced by short spears and weapons, caught by attachment as fish by hooks.\nWhile others burn in great fires, struggling with wealth—its accumulation, protection, and loss—sinking deeper like elephants in mud.",
    "Through the anguish of acquiring, guarding, and losing wealth,\nKnow it as an endless source of suffering in this life and beyond.\nThose whose minds are scattered by attachment to possessions\nHave no opportunity for liberation from samsara's torments.",
    "For those consumed by sensual desires\nCountless faults abound while pleasures remain fleeting\nLike oxen pulling carts\nSnatching mere mouthfuls of grass.",
    "For the sake of trivial pleasures, which even animals can readily obtain,\nThis precious human life with leisures and endowments, so rare to find,\nIs squandered by those afflicted\nBy their karmic confusion.",
    "Desires, which inevitably perish,\nLead to falls through hell and lower realms;\nBecause they yield no lasting value,\nAll this endless toil exhausts through time.",
    "With a mere fraction of that effort,\nOne could attain the state of Buddhahood.\nThose bound by desires pursue awakening practices,\nYet find great suffering and no enlightenment.",
    "When one contemplates the torments of hell and lower realms,\nNeither weapons, poison, fire, precipices,\nNor enemies can serve\nAs worthy comparisons to sense desires.",
    "Thus, having grown weary of desires,\nCultivate joy in solitude.\nEmpty of conflict and afflictions,\nIn peaceful forest lands.",
    "The blessed bodhisattvas pace upon wide stone terraces of delightful mansions.\nCooled by moonlight and sandalwood more sublime than any royal comfort.\nSilent, soothing forest breezes gently caress without disturbance.\nThey walk in meditation, contemplating ways to benefit all limitless beings.",
    "In empty houses, beneath trees, or in caves,\nOne stays wherever and however long desired.\nFreed from the suffering of possessing and protecting belongings,\nOne moves about independently, without expectations from others, exactly as one wishes.",
    "One moves freely without attachment\nBound to no one high or low friend or foe\nThe bliss of contentment with life simple necessities\nEven Indra lord of gods finds such happiness hard to attain",
    "Through these various forms of solitude,\nBy thoroughly contemplating the qualities of seclusion,\nWith discursive thoughts pacified,\nOne should develop the awakening mind.",
    "Equality of self and others,\nFirst, diligently practice meditation.\nSince happiness and suffering are equal,\nProtect all just as you would yourself.",
    "Just as one body with its many parts like hands \nIs protected as a single entity, though merely parts conventionally labeled as one\nSimilarly, though beings in the world appear diverse\nAll share in suffering and joy alike—all should be regarded as oneself.",
    "Though my suffering does not afflict the bodies of others,\nThat very same suffering is unbearable to me,\nDue to my attachment to myself as 'I',\nThis pattern, through training, can extend my concern to all beings.",
    "Similarly, although the suffering of others does not directly befall me in experience,\nNevertheless, that suffering becomes my own suffering;\nThrough clinging to others as self,\nIt becomes unbearable.",
    "I shall eliminate the suffering of others,\nFor it is suffering just like my own suffering.\nI shall benefit others as I would myself,\nFor they are sentient beings, just as I am one.",
    "When both myself and others equally desire happiness,\nwhat difference is there between myself and others?\nFor what reason\nshould I strive for happiness for myself alone?",
    "When suffering is equally unwelcome\nTo myself and others alike\nWhat special distinction exists between us\nThat I protect myself but not others",
    "If I don't protect others from suffering\nBecause their pain doesn't harm me now,\nThen who will protect me from future suffering\nThat likewise doesn't afflict me at present?",
    "The thought 'I will experience that suffering'\nIs indeed a mistaken conceptualization.\nFor the one who dies is a different entity,\nAnd the one who is born is likewise different.",
    "When one's suffering must be protected by oneself,\nThe foot's suffering should not concern the hand.\nSince their pains are distinct,\nWhy then does the hand protect the foot?",
    "If it's argued, 'Though unreasonable, one still acts\nDue to ingrained self-grasping'—\nWhether about self or other—continuums or collections—\nMust be abandoned according to one's capacity.",
    "Continuum and collection like garlands and armies\nAre illusory designations with no inherent existence\nSince the one who would experience suffering does not truly exist\nWho then could possibly claim this suffering as their own?",
    "All suffering has no owner,\nWithout distinction whatsoever.\nBecause it is suffering, it should be eliminated.\nWhat purpose does certainty serve here?",
    "If suffering should be eliminated, why speak of 'all beings'?\nThis itself is beyond dispute.\nIf elimination is proper, then all suffering should cease;\nIf not, then just like other sentient beings, neither should mine.",
    "Since compassion makes one bear sufferings,\nWhy deliberately cultivate such pain?\nWhen contemplating the agonies of beings,\nHow can compassion's suffering be too great?",
    "If through one person's suffering\nMany sufferings in saṃsāra would cease,\nThen one endowed with loving-kindness should indeed\nWillingly accept that suffering for self and others.",
    "Therefore, Supuṣpacandra (Flower-Moon-Beautiful),\nAlthough foreseeing the king would take his life,\nDid not seek to escape his own suffering,\nTo liberate countless beings from their pain.",
    "Having thus habituated their mindstream,  \nThose who delight in pacifying others' suffering,\nLike swans entering a lotus lake,\nWill enter even Avīci hell without anguish.",
    "When sentient beings are being liberated,\nThose oceans of immense joy arise.\nIs this alone not entirely sufficient?\nWhat use is flavorless liberation for oneself?",
    "Therefore, even when working for others' benefit,\nNeither pride nor wonder arises in one's mind;\nWith joy directed solely toward others' welfare,\nOne expects no fruits of karmic ripening for oneself.",
    "Therefore, just as I protect myself\nFrom even the slightest unpleasant words,\nSo too for others I shall cultivate\nA mind of protection and compassion.",
    "Just as through habituation, regarding\nThe drops of semen and blood from one's parents,\nThough no real entity exists there,\nOne cognizes 'This is I.'",
    "Similarly why not grasp another's body as 'self'\njust as one identifies with a body formed from parents' elements despite its lack of inherent selfhood\nto establish one's own body as belonging to others \nis indeed not difficult",
    "Having recognized oneself as flawed\nAnd others as oceans of virtues that bring every happiness\nOne should cultivate the complete abandonment of self-clinging\nAnd the thorough embracing of others through systematic exchange practice",
    "Just as hands and other limbs\nAre considered parts of one's body,\nLikewise, as limbs of the world,\nWhy are sentient beings not accepted?",
    "Just as through habituation, the notion of 'I' arises\nIn this body that inherently lacks a self,\nSimilarly, toward other sentient beings as well,\nWhy wouldn't the same sense of selfhood arise through habituation?",
    "Thus, even when working for others' benefit\nNo pride or wonder arises through habituation\nJust as after feeding oneself\nNo expectation of reward emerges.",
    "Therefore, just as one protects oneself\nFrom even the slightest harm like unkind words,\nIn the same way, toward all beings,\nOne should habitually cultivate minds of protection and compassion.",
    "Therefore, Lord Avalokiteśvara,\nWith great compassion for all beings,\nTo dispel the fears of cyclic existence,\nBlessed even his own name with sacred power.",
    "One should not turn away from difficult spiritual practices.\nFor through the power of prolonged habituation.\nThose very practices whose names once caused terror when heard.\nWill, when absent, become a source of unhappiness.",
    "Whoever wishes swiftly to protect\nOneself and all sentient beings\nShould practice that supreme secret,\nThe exchange of self and other.",
    "When to this body, deeply cherished through attachment\nEven tiny threats like gnats and snakes cause fearful dread\nThis form that breeds all fears now and in future lives\nWhat wise one would not view it as a foe, and self for other trade",
    "Whoever, seeking remedies for bodily weakness, hunger, thirst, and other ailments,\nKills birds, fish, and wild animals for food and personal needs,\nAnd lies in wait along the roads to ambush and rob travelers.",
    "One who, for profit and ritual offerings,\nWould even murder their own father and mother,\nAnd steal the sacred treasures belonging to the Three Jewels,\nWill consequently burn in the unrelenting fires of Avīci hell.",
    "What wise person would desire, protect, and worship\nthis body?\nWho would not view it as an enemy,\nAnd who would not treat it with contempt?",
    "'If I give, what shall I have to enjoy?'—\nThis self-concerned thinking is the way of demons.\n'If I enjoy, what shall I have to give?'—\nThis mindset of prioritizing others is the dharma of gods.",
    "One who harms others for selfish gain\nWill be tormented in hell and other lower realms\nOne who sacrifices oneself for others' sake\nWill attain all excellent prosperities.",
    "Through desire to elevate oneself above others\nOne falls to lower realms, becomes degraded and foolish\nWhen this very desire for elevation is directed toward others instead\nOne attains higher rebirth and receives perfect honor and service",
    "When one commands others for one's own purpose,\nOne experiences the ripened result as servant, slave, and alike in future lives.\nWhen one dedicates oneself for others' purpose,\nOne experiences the result as master, lord, and alike.",
    "Whatever happiness exists in the world,\nAll of it arises from desiring others' well-being.\nWhatever suffering exists in the world,\nAll of it arises from desiring one's own well-being.",
    "What need is there for many words?\nThe childish who pursue only their own benefit,\nAnd the sage who, acting solely for others' welfare,\nObserve this crucial difference between these two.",
    "Without truly practicing exchanging\nOne's happiness for others' suffering,\nNeither is Buddhahood ever attainable,\nNor can happiness be found within cyclic existence.",
    "Setting aside the matter of future lives,\nwhen servants, cherishing themselves, neglect their work,\nAnd masters, from self-interest, withhold fair payment,\nEven the objectives of this present life cannot be accomplished.",
    "Achieving happiness seen and unseen,\nForsaking all perfect well-being and blissful prosperity,\nThrough causing suffering to others,\nDeluded beings take upon themselves unbearable anguish.",
    "Whatever harms exist in this world,\nAnd however many fears and sufferings there may be,\nAll these arise from grasping at a self,\nWhat purpose, then, does this great demon serve for me?",
    "Without completely abandoning self-grasping\nOne cannot eliminate the suffering\nJust as without discarding fire\nOne cannot avoid being burned",
    "Therefore, to pacify my own suffering's harm\nAnd to quell the suffering of others\nI give myself fully to other beings\nAnd embrace others exactly as I do myself.",
    "I am now under others' control\no mind firmly establish this understanding\nexcept for serving all beings' welfare\nyou must think of nothing else from now on",
    "It is not proper to use eyes and other faculties\nFor selfish aims, as they belong to other beings\nTheir eyes and other senses serve their purposes alone\nTheir hands and other limbs should never harm those same beings.",
    "Therefore, prioritizing sentient beings' welfare,\nWhatever you see on your body,\nTake these away from yourself,\nAnd use them to benefit others.",
    "Having placed oneself in the position of those inferior and others\nAnd similarly having placed others in the position of oneself\nWith a mind free from conceptual elaboration\nMeditate on jealousy, competitiveness, and pride.",
    "That one is honored, not I;\nThat one has gained, while I have not;\nThat one is praised, while I am criticized;\nThat one is happy, while I suffer.",
    "I perform laborious tasks [gathering roots and cutting wood],\nWhile this one remains comfortably established without work.\nThis one indeed is renowned as great in the world,\nWhile I am considered lowly and devoid of qualities.",
    "What use is being without virtues?\nI must actively cultivate the virtues of my inherent buddha-nature.\nThere are those compared to whom I am inferior—merely in relative terms,\nAnd there are those compared to whom I am superior—likewise by comparison alone.",
    "My moral discipline, views, and other virtues deteriorate\nDue to afflictions' power, not under my control\nI must be healed according to your ability\nI willingly accept whatever hardships this treatment brings",
    "If I am not one to be healed by this bodhisattva,\nWhy then do you show such contempt toward me?\nWhat purpose do your qualities serve for me?\nTrue worth lies in qualities that benefit others.",
    "Standing at the precipice of lower realms,\nThey show no compassion for beings,\nYet outwardly they boast of virtues,\nAnd challenge the truly wise.",
    "When comparing oneself to equals in birth and status,\nOne seeks to exceed them for personal superiority\nStriving to secure material gain and veneration\nThrough conflict and strife.",
    "May my own good qualities indeed\nBecome evident to the entire world\nAnd furthermore may whatever good qualities this other person possesses\nNot be heard by anyone at all.",
    "My faults should remain hidden from view.\nI shall receive honor, not this person.\nToday I have gained excellent rewards.\nI shall be respected, not this one.",
    "For those who have committed harmful deeds\nI shall joyfully observe for a long time\nHow they become the laughter of all people\nAnd the target of criticism from every direction",
    "This miserable affliction (kleśa) of pride within me \nMakes me perceive others as my competitors. Am I comparing myself based on \nTheir learning and wisdom? Or through physical appearance, family lineage, and wealth?",
    "Thus, hearing my superior qualities \nProclaimed and renowned throughout all realms,\nWith hair bristling and heart delighted,\nI shall fully partake in the festival of happiness.",
    "Even if this person should obtain gains despite efforts to prevent it,\nIf they perform my work of alleviating suffering with respect and without arrogance,\nHaving given them just the bare necessities for survival,\nI should take all their remaining gains by my authority, leaving nothing behind, as justified by the commentaries.",
    "This enemy my self-cherishing mind must be stripped of all pleasures\nAnd constantly subjected to suffering and harm\nFor in hundreds of ways throughout countless cycles\nIt has brought me nothing but misery while wandering in saṃsāra",
    "O mind, countless kalpas have passed while you've sought your own benefit\nThrough such enormous, exhausting efforts\nYou have accomplished nothing but suffering",
    "At my request, act without hesitation\nFor the benefit of others.\nThe Sage's words never prove false;\nYou'll see its merits later.",
    "Had you diligently cultivated in former times\nThis practice of exchanging self for others as your habit,\nInstead of the perfect Buddha-bliss with its sublime attributes,\nYou could not possibly remain in this uncertain state of suffering.",
    "Therefore, just as you have developed a sense of 'I'\nToward the drops of semen and blood from others,\nSimilarly, habituate yourself to regard\nAll other beings as yourself and work for their welfare.",
    "Having transformed from envious observer to watchful guardian,\nWhatever wealth, garments, or treasures appear on your body,\nSeize these very things from your attachment-bound self,\nAnd employ them for the welfare of others.",
    "I have found true happiness through dharma, others remain in suffering.\nI am elevated as an object of veneration, others remain burdened by worldly obligations.\nI benefit myself through virtuous actions for this life and the next, others pursue harmful deeds.\nWhy should I not transform envy into appreciation for my own fortunate position on the spiritual path?",
    "I shall deprive myself of happiness\nAnd take upon myself the suffering of others\nWhat is this one doing now? I must ask\nAnd thoroughly examine my own faults",
    "Place the faults of others upon your own head\nTransform them into your responsibility \nEven your own minor wrongdoings\nOpenly confess before many people",
    "By lavishly praising others' fame and glory,\nOvershadow and diminish your own reputation.\nLike the lowest of servants,\nEmploy yourself in all virtuous tasks for others.",
    "This self is inherently full of faults\nDo not seek praise for temporary virtues\nWhatever good qualities you possess\nEnsure that no one comes to know of them",
    "In brief, whatever harm you have inflicted on others\nFor your own self-interest,\nLet that harm fall upon yourself\nFor the purpose of benefiting sentient beings.",
    "One should not encourage this mind\nto become haughty or stiff-necked\nmaintain it like a new bride\nwith proper shame, mindful fear, and restraint",
    "Do this—act with downcast eyes for others' benefit.\nRemain thus—in disciplined walking, sitting, like a well-tamed horse.\nDo not do this—avoid the twenty-seven gateways to misconduct and self-interest.\nThus with mindfulness and clear comprehension control the mind—for transgressions, impose stern disciplines on yourself.",
    "Even if thus repeatedly admonished,\nIf you, mind, refuse to abandon self-cherishing,\nSince all faults depend upon you,\nI shall forcefully subdue you.",
    "That former time when you destroyed me has passed;\nThat former era was different;\nI see where you are going;\nI shall demolish all your pride.",
    "Abandon now the thought that thinks\n'I still have my own purpose to fulfill.' I have sold you to others,\nso without becoming discouraged, offer your labor and flesh wholeheartedly to them.",
    "If, through heedlessness, I do not give you\nTo sentient beings,\nYou will certainly deliver me\nTo the guardians of hell.",
    "Thus, look at yourself.\nYou've made me suffer for long.\nI now remember all grievances.\nI will destroy your self-interest.",
    "If one desires happiness for oneself,\nOne should not be attached to pleasing oneself,\nIf one desires to protect oneself,\nOne should always protect others instead.",
    "The more one cherishes and pampers this body\nThe more one provides it with complete care\nTo that very same degree it becomes\nIncreasingly delicate and falls into weakness",
    "For one who has fallen thus to craving's sway,\nNot even all Earth's treasures—gold and land—\nCan satisfy desires that toppled kings from thrones.\nWho then could fulfill such boundless longing?",
    "Desiring the impossible breeds afflictions\nAnd corrupts one's virtuous intentions.\nOne who remains free from attachment to all things\nTheir excellence and happiness are inexhaustible.",
    "Therefore, one should not give opportunity\nFor increasing the body's desires;\nThat which is not grasped despite its appeal—\nThis non-attachment is truly the excellent wealth.",
    "In the end, this body will be reduced to mere ashes,\nInert by itself, moved only by others' hands,\nAn unbearable figure of impurities, repulsive and dreadful,\nWhy do I stubbornly cling to this mechanical assembly as 'myself'?",
    "Whether alive or dead, it's better for me;\nWhat use is this machine to me?\nWhat difference is there between this and a donkey?\nAlas! Why not dispel this pride?",
    "By laboring to maintain this body,\nOne uselessly accumulates suffering across lives;\nWhat purpose is there in attachment or aversion\nToward this ungrateful thing akin to rotten wood?",
    "Whether I care for this body thus,\nOr vultures and others devour it,\nSince it feels neither attachment nor aversion,\nWhy should I become attached to it?",
    "If one becomes angry when criticized,\nAnd if one feels pleased when praised,\nIf that very body has no awareness,\nThen for whose sake have I exerted myself?",
    "If those who desire this body of mine\nAre truly counted as my friends,\nSince all beings—down to the smallest—cherish their own forms,\nWhy should I not delight in their bodies as my own?",
    "Therefore I relinquish attachment to this body\nFor the benefit of all sentient beings\nThough laden with many faults\nI maintain it like a craftsman's tool for virtuous work",
    "Therefore, I have had enough of worldly pursuits.\nI shall follow the wise.\nRecalling the discourse on mindfulness.\nI shall dispel dullness and sleepiness.",
    "Like the great compassionate bodhisattvas,\nOne should establish firm reasoning to cultivate virtuous remedies.\nIf one does not ceaselessly strive day and night,\nWhen will one's suffering ever come to an end?",
    "Therefore, to dispel all obscurations,\nI shall withdraw my mind from wrong paths,\nAnd continuously keep it fixed\nOn ultimate reality through meditative concentration.",
    "From the Bodhicaryāvatāra\nThe Eighth Chapter entitled 'The Perfection of Meditation'"
  ],
  [
    "All these branches of the path\nThe Buddha, the Sage, taught as supports for wisdom.\nTherefore, those who wish to pacify \nAll sufferings should cultivate wisdom that realizes truth.",
    "Conventional and ultimate—\nThese are accepted as the two truths.\nUltimate truth is beyond the domain of dualistic intellect;\nIntellect itself is said to exist within the conventional.",
    "In this regard, the world is seen as twofold:\nThe yogic and the ordinary.\nTherein, the ordinary world\nIs invalidated by the yogic world.",
    "Even yogis, through distinctions in their understanding,\nAre refuted by those of progressively higher realization;\nThrough examples accepted by both sides—like dreams and illusions—\nThey engage in practices for results without ultimate analysis.",
    "Worldly beings perceive phenomena before their eyes,\nAnd conceptualize them as inherently real,\nNot as illusions—appearing yet empty of essence—\nHere lies the dispute between yogis and the worldly.",
    "Even form and other objects directly perceived\nAre established through convention not valid cognition\nThis perception is false just as impure things\nAre conventionally seen as pure and so forth",
    "For the purpose of guiding worldly beings,\nThe Protector taught phenomena as momentary,\nIn ultimate reality, these are not momentary,\nIf one objects this contradicts conventional truth as well.",
    "Through yogic conventional perception there is no fault\nCompared to worldly understanding they see true reality\nOtherwise when yogis realize women's bodies as impure\nTheir understanding would be contradicted by worldly views",
    "From an illusion-like Buddha, how can merit arise\nJust as it would from one truly existent?\nIf sentient beings are merely like illusions,\nHow then, after death, could they possibly be reborn?",
    "As long as the assembly of causal conditions remains intact,\nTo that extent magical illusions will continue to appear.\nHow could sentient beings, merely because of a long continuum,\nTruly exist when their nature is like illusions?",
    "When killing magical forms and such acts,\nNo sin of the deed arises, as they lack a mind that experiences.\nBut with beings who possess minds—though themselves like illusions—\nBoth merit and negativity truly arise.",
    "Since mantras and such lack generative power,\nNo illusory mind arises in magical displays.\nFrom various conditions arise\nThose very diverse magical illusions.\nA single condition having power to produce everything\nDoes not exist anywhere at all.",
    "If from ultimate view one has attained nirvāṇa\nYet cycles in saṃsāra conventionally\nEven Buddhas would cycle\nWhat purpose then would bodhisattva conduct serve",
    "When the stream of conditions remains unbroken,\nEven magical illusions will not cease;\nBut when the continuity of conditions is severed,\nEven at the conventional level, no return to samsara is possible.",
    "When there is not even deluded consciousness [with inherent existence], by what means could the magical illusion be apprehended?\nWhen for you [Cittamātrins], turning your own objection back at you, if the appearing magical illusion-like object itself does not exist [as you claim external referents do not],\nwhat then is being apprehended at that time?",
    "If something else truly exists as such,\nThat aspect is mind itself alone.\nWhen mind itself is like an illusion,\nThen what could be seen, and by what?",
    "Even the Protector of the World has declared:\n'The mind cannot see the mind.'\nJust as a sword's edge cannot cut itself,\nSo too the mind cannot perceive itself.",
    "Just as a lamp supposedly\nIlluminates its own nature clearly,\nSo too a lamp cannot be its own object of illumination,\nFor it is never shrouded in darkness to begin with.",
    "Just as crystal's blue appearance depends on external factors,\nBlue lapis lazuli is claimed not to depend on others for its blueness.\nLikewise, in this world, some phenomena are observed to depend on others,\nWhile some appear to exist independently—though this distinction warrants scrutiny.",
    "That which is not [inherently] blue cannot become blue by itself;\nHow could something blue make itself blue through its own agency?",
    "How could something blue possibly make itself blue by itself? Who would turn oneself blue through oneself? If it were not blue to begin with, then it could not make itself blue through itself—just as blue lapis lazuli is not inherently blue like crystal appears blue only by external influence, but depends on causes and conditions. This refutes the opponent's theory that distinguishes mutual illumination from self-illumination (svaprakāśa), showing the logical impossibility of consciousness knowing itself without subject-object duality.",
    "When we say 'the lamp illuminates'\nThis is known by consciousness and then expressed\nBut when consciousness itself is said to be self-illuminating\nBy what is this known that enables such an assertion",
    "When dependent consciousness is not seen by itself or by others,\nWhether it is manifest or unmanifest,\nLike the graceful movements of a barren woman's daughter,\nThough described, it remains utterly meaningless.",
    "If self-awareness does not exist,\nHow could consciousness be remembered?\nIt is remembered through its relationship \nWith other experiences, just as rat poison.",
    "When endowed with other conditions\nOne claims consciousness reveals itself because it is perceived,\nBut when through magical eye ointment treasures buried afar are seen,\nThe jar that is perceived never becomes the ointment itself.",
    "What is seen, heard, and cognized\nIs not what is refuted here;\nRather, here the conception of inherent truth,\nWhich is the cause of suffering, must be reversed.",
    "Illusions are not different from the mind,\nAnd not-different cannot be established either,\nHow could they not be different in reality?\nIf not-different, they have no real existence.",
    "Just as an illusion, though unreal,\nSo too the mind is both the seen and seer,\nIf saṃsāra depends on substantial reality,\nOtherwise it would become like empty space.",
    "How could non-existence, dependent on the truly existent\nEver possess the capacity to act or produce effects?\nYour mind is without companion\nBecoming a completely solitary entity.",
    "When mind is freed from grasping objects,\nAt that time, all are thus-gone ones.\nYet even so, in the 'mind-only' view,\nWhat benefit is gained in such conceptualization?",
    "Even if one understands that all things are like illusions,\nHow would afflictive emotions be reversed,\nWhen toward an illusory woman,\nEven her creator himself generates desire.",
    "For one who creates illusion\nAfflictive tendencies toward objects of knowledge remain unabandoned\nTherefore, when perceiving his own creation\nHis latent tendency toward emptiness remains weak",
    "Through cultivating the imprint of emptiness,\nThe imprint of grasping at entities is dispelled;\nThrough practicing that 'nothing whatsoever exists,' \nEven that notion itself is subsequently abandoned.",
    "When an entity under examination cannot be found\nAnd is conceived as 'this does not exist'\nThen how can such non-existence lacking any basis\nStand before the mind as an object of cognition?",
    "When neither entity nor non-entity stands before the intellect,\nThen, with no alternative path remaining,\nWithout support, the mind is thoroughly pacified.",
    "Just as the wish-fulfilling gem and wish-granting tree\nThough without thought, fulfill desires exactly as hoped\nSo through both disciples' readiness and the Buddha's past aspirations\nThe Conqueror's form manifests effortlessly to those to be tamed.",
    "Just as the Brahmin Shangku, a master of Garuda mantras,\nHaving empowered a ritual pillar, passes away,\nEven though long time has elapsed since his death,\nThat pillar continues to pacify poisons and other harmful influences.",
    "Through practices aligned with enlightenment,\nHaving established the Buddha's victory pillar,\nEven when the Bodhisattva has passed beyond,\nAll beneficial purposes are fulfilled.",
    "How could offerings made to one without consciousness\nBear fruit and bring results?\nBecause it is taught that [merit] is equal\nWhether [the Buddha] abides or has passed into nirvāṇa.",
    "Whether conventionally [as we Mādhyamikas hold] or ultimately [as you Realists claim],\nThe fruit in that case comes from scripture.\nFor example, just as offerings to the truly existing Buddha [in your view]\nBear fruit, so too [in our view, where Buddha exists like a magical apparition].",
    "Through seeing the sixteen aspects of the Four Noble Truths, one attains liberation.\nSo what need is there for seeing emptiness?\nFor according to our scriptural tradition, it is declared that\nWithout this conventional path, there is no awakening whatsoever.",
    "If Mahāyāna is not established [as Buddha's word],\nHow then is your āgama [scripture] established?\nBecause it's established for both [traditions],\nBut initially, it wasn't established for you through reasoning either.",
    "By whatever means you trust those teachings—Buddha's words, Arhat compilation, Commentarial clarification, lineage transmission, and reasoned analysis—\nApply those same validation standards to Mahāyāna scriptures too.\nIf truth were merely established by two parties' mutual acceptance,\nThen even the Vedas and similar non-Buddhist texts would necessarily be true.",
    "If Mahāyāna is rejected for being disputed,\nThen abandon āgamas too—for tīrthikas dispute them;\nJust as your own and others' Śrāvaka schools contest each others' scriptural traditions.",
    "The root of the Dharma is Arhat bhikṣuhood,\nYet even this perfect monastic state is difficult to sustain.\nFor those whose minds grasp at phenomena as inherently existent,\nEven nirvāṇa remains impossible to attain.",
    "If liberation comes from afflictions' end alone,\nIt should occur forthwith—this much is clear;\nYet even arhats free from afflictions,\nStill face karma's power.",
    "If it is definitively claimed\nThat craving, which serves as the appropriator, is absent,\nWhy would non-afflictive craving not exist,\nJust as non-afflictive ignorance remains?",
    "Craving arises from the condition of sensation.\nThese sensations exist even in those [Arhats with non-afflictive ignorance].\nTheir minds, still operating with reference points,\nWill dwell in particular states, bound by dualistic perception.",
    "A mind devoid of emptiness realization\nWill cease but arise again with conceptual grasping,\nJust as in the absorption of non-perception.\nTherefore, one should cultivate the emptiness that liberates.",
    "If you accept as Buddha's word\nAny discourse that accords with the Sūtra Piṭaka's three trainings,\nThen aren't most Mahāyāna teachings, despite their emphasis on emptiness,\nEquivalent to your own sūtras? Why then reject them?",
    "If by excluding a single [scripture],\nall [scriptures] would become flawed,\nwhy wouldn't a single [scripture] matching the sūtras\nestablish that all were spoken by the Victor?",
    "That speech which even the great Mahākāśyapa and other senior disciples\ncould not fathom the depths of—\nbecause you have not realized it yourself,\nwho could rightfully declare it as something not to be accepted?",
    "For the benefit of those suffering through delusion—\nFreed from extremes of attachment and fear,\nOne establishes dwelling in saṃsāra\nThis is the fruit of śūnyatā.",
    "Thus, objections against the doctrine of emptiness\nCannot be established as valid through reasoning.\nTherefore, with unwavering certainty,\nOne should diligently cultivate meditation on emptiness.",
    "Emptiness is the antidote to the darkness\nOf afflictive and cognitive obscurations.\nHow could one desiring swift omniscience\nPossibly neglect to cultivate this wisdom?",
    "What things produce suffering,\nFrom these fear will arise.\nEmptiness pacifies suffering,\nSo why fear it at all?",
    "If there were a self existing inherently when examined,\nFear would arise toward any phenomenon whatsoever.\nBut when analyzed through aggregates, no trace of self is found\nSo who remains to experience fear and be bound to samsara?",
    "I am not teeth, hair, or nails;\nI am not bones, nor am I blood;\nI am not mucus, nor phlegm;\nI am not lymph nor pus.",
    "I am not fat nor dust;\nThe lungs and liver are not me;\nOther internal organs are not me either;\nI am not excrement or urine;",
    "I am neither flesh nor skin\nNeither warmth nor vital air am I\nThe bodily apertures are not myself in any way\nNor are the six consciousnesses my self in any respect",
    "If consciousness of sound were permanent,\nOne would apprehend sound at all times without fail.\nWhen no object of knowledge exists, what could it possibly know?\nBy what relation could it then be called 'consciousness'?",
    "If that which does not cognize were deemed cognition,\nThen absurdly, even wood would become a cognizer.\nThus, without the presence of an object to be known,\nNo cognition exists—this is definitively established.",
    "If that same consciousness knows form,\nWhy would it not also hear at that time?\nIf you claim it's because sound is not proximate,\nThen the consciousness of that sound would also not exist.",
    "How can that which has the nature of grasping sound\nSimultaneously grasp visual form with contrary nature\nOne as both father and son is merely conceptual\nTemporally, such dual identity cannot truly exist",
    "Neither sattva, rajas, nor tamas qualities—\nAs the Sāṃkhyas claim—can be father nor son.\nThat faculty which apprehends sound\nIs never observed to possess the nature of visual perception.",
    "Like an actor who appears in different forms,\nWhen the same entity is perceived differently, it cannot maintain permanence.\nIf that which has a different nature could still be that very same entity,\nSuch a concept of identity would be unprecedented—a logical impossibility.",
    "If appearances aren't true\nthen what inherent nature must you now construe\nif 'mere consciousness' you maintain\nall persons merge as one distinction none remain",
    "The conscious (ātman) and unconscious (pradhāna) principles\nWould merge as one since both equally exist as entities;\n\nWhen their supposed distinctions are proven false,\nWhat basis for similarity could possibly remain?",
    "The self cannot be an unconscious entity,\nSince like pots and similar things, it would lack consciousness.\nIf one argues it becomes knowing through association with consciousness,\nThen the non-knowing self would absurdly be destroyed in the process.",
    "If the self is inherently unchangeable,\nWhat effect could mental activity have upon it?\nSuch unconscious, actionless entity is pointless\nLike space itself, falsely presumed a 'self' without purpose.",
    "If there exists no self,\nThe bond between karma and its fruits is not logical.\nOnce an action perishes after being performed,\nWhose karma will it be when its result ripens?",
    "Since both of us accept that karma\nAnd its fruit rest on different aggregates,\nAnd that the self is without agency in these states,\nIs not your objection against me pointless?",
    "That one possessing causes simultaneously bears results\nSuch a thing cannot exist\nBased upon the single continuum\nOne is conventionally designated as 'doer' and 'experiencer.'",
    "The mind of past and future times\nIs not the self, for they no longer exist or have not yet arisen;\nIf the present arising mind were the self,\nWhen it ceases in the next moment, the self would likewise cease to exist.",
    "Just as a banana tree's trunk, when separated into parts, no essence can be found;\nSimilarly, when sought through analytical examination;\nOf past, present, and future consciousness, the self proves not truly existent.",
    "If sentient beings do not exist,\nToward whom would compassion be shown?\nToward those who, fabricated by ignorance, are accepted conventionally for the sake of the goal—\nThe result of liberation.",
    "Sentient beings lack true existence, this is the result.\nIndeed true, yet from delusion arises aspiration.\nSuffering's complete pacification is the purpose.\nThe non-afflictive confusion about the result should not be dispelled.",
    "The pride that causes cyclic suffering\nIncreases through delusion about self\nIf one objects 'This grasping at inherent self cannot be reversed'\nSupreme is the meditation on selflessness that sees true nature",
    "Neither the feet nor the calves are the body.\nThe thighs and waist are not the body.\nThe abdomen and back are not the body.\nNor are the chest or shoulders the body.",
    "Neither the hands nor sides are the body,\nNeither armpits nor shoulders constitute the body.\nIf the internal organs are not the body,\nAnd neither head nor neck is the body,\nThen what indeed is this 'body' here?",
    "If this body exists within all its parts\nThrough partial presence in each region\nThen parts would dwell in parts\nWhere, then, does the body itself abide",
    "If the body were to exist in entirety\nWithin each part such as hands and the like,\nThen there would exist as many bodies\nAs there are parts such as hands and so forth.",
    "If the body exists neither externally nor internally,\nHow could a body be found in hands and such parts?\nIf it has no separate essence from hands and other parts,\nHow indeed could such an entity intrinsically exist?",
    "Therefore, there is no inherently existing body.\nDue to ignorance, one develops the conception of a body regarding the hands and other parts.\nThis happens due to their particular arrangement,\nJust as one mistakenly perceives a scarecrow as a person.",
    "For as long as the collection of conditions is assembled,\nThe body appears like a scarecrow mistaken for a person.\nSimilarly, for as long as hands and other parts remain interdependent,\nFor that duration the body appears there.",
    "Similarly, as a hand is merely a collection of fingers,\nWhich among them could possibly be called a hand?\nSince fingers too are but an aggregation of joints,\nAnd joints themselves, when divided into their parts.",
    "Even parts when analyzed divide into particles small\nAnd those particles too by six directional parts dissolve\nSince directional divisions lack any parts of their own\nLike space itself no particle truly can be",
    "Thus, what discerning person would feel attachment\nTo forms that are like dreams upon examination?\nWhen the body exists merely by convention,\nWhat woman is there, and what man is there?",
    "If suffering inherently existed by its own nature,\nWhy would it not impede those experiencing great joy?\nIf pleasure had inherent existence,\nWhy wouldn't delicious foods and other pleasantries delight those afflicted by grief and anguish?",
    "If, due to being overpowered by something stronger,\nThat sensation remains unexperienced,\nHow can that which lacks the inherent nature as an experience\nBe considered a true sensation (vedanā) at all.",
    "Suffering exists in subtle form indeed,\nIs not its gross aspect merely removed?\n'If it's merely experienced as slight joy, different from that [pleasure],'\nThen that subtle [form] too belongs to pleasure itself.",
    "If when contradictory conditions arise,\nSuffering fails to manifest due to incomplete causes,\nIsn't it established that 'feeling' (vedanā) itself\nIs merely conceptual imputation and fixation?",
    "For this very reason, \nThis analytical investigation is cultivated as the antidote;\nFrom the field of discriminative examination arise\nThe meditative absorptions that nourish yogis.",
    "If sense faculties and objects have space between,\nThese partless entities can never truly meet.\nWithout space between, as one they merge complete.\nThen which distinct thing could connect with which?",
    "There is no entry of one atomic particle into another.\nThese particles are without space and equal in nature.\nWhere there is no penetration, there can be no mixing.\nWhere there is no mixing, there can be no contact.",
    "How can 'contact' be reasonably maintained\nFor that which is utterly without parts?\nIf you've seen something both partless and in contact,\nDemonstrate it.",
    "Consciousness, being formless, cannot logically have contact [with objects].\n[If it could, absurdities would follow, like contact between space and a hand, or with a barren woman's child.]\nEven collections [of sense faculty, object, and consciousness] lack true existence,\nAs previously examined [when analyzing collections of parts and gross objects formed from particles].",
    "Thus, if contact has no inherent existence,\nHow could feeling truly arise from anywhere?\nWhy this exhaustion?\nWho could be harmed, by what, and how?",
    "When there is no inherently existing experiencer,\nAnd sensation too has no intrinsic existence,\nHaving seen this state of emptiness,\nO craving, why do you not shatter?",
    "Seeing and touching\nPossess a nature like dreams and illusions.\nSince they arise simultaneously with mind,\nFeelings cannot truly be perceived by it.",
    "Feelings from past or future moments\nAre remembered only, not directly experienced\nA feeling cannot experience its own nature—a contradiction \nNor can another truly experience it—all sensations lack inherent existence",
    "There is no experiencer whatsoever,\nTherefore, sensation itself cannot truly exist.\nIn this selfless collection of five aggregates,\nHow could such a sensation cause harm?",
    "The mind does not abide in the sense faculties.\nNor in forms and other objects nor in the space between.\nNeither within the body's core nor in its outer parts is consciousness found.\nNowhere else can it be discovered at all.",
    "That which exists neither within the body nor elsewhere,\nNeither mixed with nor separate from it anywhere,\nSuch a mind is utterly non-existent in essence empty yet luminous.\nTherefore sentient beings are by their very nature primordially in parinirvāṇa.",
    "If consciousness exists prior to its object of knowledge,\nUpon what object does it inherently focus to arise?\nIf consciousness exists simultaneously with its object of knowledge,\nUpon what object does it inherently focus to arise?",
    "If the object of knowledge were to exist after,\nThen from what would cognition arise?\nThus, the arising of all phenomena\nCannot be ascertained.",
    "If conventional reality with its births, cessations, comings, and goings lacks inherent existence,\nHow then could the two truths possibly exist?\nIf conventional reality exists merely through others' mental imputations,\nHow could sentient beings ever transcend conceptual elaboration and pass beyond sorrow?",
    "This conceptual fabrication belongs to others' minds\nBut in one's own conventional reality it does not exist\nIf after attaining nirvana one ascertains it exists then it exists\nIf not then conventional reality itself is entirely non-existent",
    "Conceptualization and the conceptualized object—\nThese two mutually depend on one another.\nBased on what is conventionally renowned in the world,\nAll analytical examinations are expressed.",
    "When, by means of analytical wisdom,\nOne examines phenomena for inherent existence,\nThen that very analytical wisdom itself,\nBecause it too requires examination, leads to infinite regress.",
    "When one thoroughly examines what is to be analyzed,\nThe analyzing mind finds no inherent basis to rest upon;\nWithout foundation, it does not arise—\nThis is what is declared nirvana.",
    "For one who maintains both object and cognition truly exist,\nTheir position is indeed extremely untenable.\nIf objects are established through cognition's power,\nWhat grounds cognition's own existence?",
    "If knowledge depends on objects known,\nWhat basis have these objects on their own?\nIf both exist through mutual dependence,\nNeither can be established.",
    "If without a son one cannot be a father,\nFrom where, prior to the father, would a son arise?\nWithout a son, there is no father;\nThus both lack inherent existence.",
    "A sprout arises from a seed,\nThat very seed is understood through it,\nConsciousness arises from objects of knowledge,\nWhy is their existence not understood?",
    "Through a cognition distinct from the sprout,\nOne understands that 'a seed exists.'\nBy what means is the existence of that cognition known,\nBy which that object of knowledge is comprehended?",
    "Through perception and valid means, the world directly observes\nThat all effects arise from their particular causes;\nThe diverse forms of lotus stems and similar things\nEmerge at specific times from corresponding causal distinctions.",
    "What creates these diverse distinctions among causes? From the patterns established by prior causes alone.\nWhy does each cause produce its specific effect?\nFrom the intrinsic power of its causal lineage.",
    "If Īśvara is the cause of the world,\nThen pray tell, who exactly is this Īśvara?\nIf you say 'the elements,' indeed, we agree,\nBut why exhaust oneself over mere names?",
    "However, elements like earth are multiple entities,\nimpermanent, devoid of conscious movement, not divine,\nthings that can be trampled upon, and impure.\nFor these reasons, they cannot be Īśvara.",
    "Neither space nor God can be the creator,\nsince space is inert and lacks agency.\nNor can it be the Self, as this has already been refuted previously.\nAnd what is the use of claiming that the inconceivable is the creator?",
    "What exactly does he wish to create?\nIf the self—surely that is eternal,\nAs are earth and such elements, and Īśvara's own nature.\nKnowledge arises from its objects.",
    "From beginningless time, suffering and joy arise from karma alone.\nSpeak what specific effect has been created by Ishvara.\nIf the cause itself has no beginning whatsoever,\nHow could the results ever have a point of origin.",
    "Why does [Ishvara] not constantly produce effects?\nSince he does not depend on other conditions.\nIf nothing exists that is not created by him,\nUpon what could this [creator] possibly depend?",
    "If [Īśvara/God] depends on a collection of causes and conditions,\nit is this collection that is the true cause, not Īśvara himself.\nWhen the collection of causes and conditions is present, Īśvara has no power to prevent the result from arising.\nAnd without those causes and conditions, Īśvara has no power to produce the result.",
    "If Īśvara creates unwillingly,\nHe falls under others' power.\nIf willingly, he's caught by desire's hook.\nHow can one who acts dependently be the Supreme Lord?",
    "Those who maintain that atoms are permanent,\nThey, too, have been refuted before.\nThe Sāṃkhyas assert primordial nature (pradhāna)\nIs eternal and the cause of the world.",
    "Sattva, rajas, and tamas—the three guṇas—\nWhen in perfect equilibrium,\nAre declared to be pradhāna, the singular permanent unconscious primordial causal substance\nWhen in disequilibrium, they produce transformations through mahat, ahaṃkāra, and the sixteen categories.",
    "For one primordial substance (pradhāna) to possess three distinct natures\nIs logically impossible; therefore, such a singular entity cannot exist.\nSimilarly, the qualities (guṇas) themselves cannot truly exist either,\nFor each quality individually manifests threefold as 'quality containing qualities.'",
    "Without the three guṇas, sound and other sense-elements\nWould be impossible to exist, far removed from reality\nAnd in insentient objects like clothing\nPleasure and similar experiences cannot possibly arise.",
    "If things exist as having happiness as their cause,\nHaven't such entities been proven ultimately non-existent?\nYour view makes happiness itself the cause,\nYet from this, cloth cannot arise, nor can happiness from cloth.",
    "From cloth and such pleasure and such sensations arise\nIn their absence such pleasures cannot exist\nAnd the permanence of pleasure and other qualities\nAt no time is it ever observed by any valid means",
    "If pleasure and such truly manifest as inherently existent,\nWhy is their experience not continuously apprehended?\nIf that very same [pleasure] transforms to become subtle,\nHow can a single entity be both coarse and subtle?",
    "When gross form transforms to subtle,\nSuch gross and subtle states are impermanent.\nLikewise, for all phenomena in existence,\nWhy not accept their impermanence as evident?",
    "If corporeality is not distinct from pleasure,\nThen clearly pleasure is impermanent.\nIf you hold Nothing arises from non-existence,\nFor what doesn't exist lacks causal power.\nEven against your will, you've already conceded\nThat manifestation arises newly from non-existence.",
    "If effects dwell within their causes, |\nOne who eats food would be consuming impure substances. |\nWith the price paid for cloth, |\nPurchase cotton seeds and wear them. |",
    "If the world fails to see due to delusion,\nThen even those who know reality",
    "That knowledge exists in worldly beings as well,\nYet why don't they see effects hidden in their causes?\nIf worldly perception is deemed to lack validity,\nThen even clear perception of manifested forms cannot be true.",
    "If valid cognition is not truly valid,\nWould not what it measures prove false?\nTherefore, in the ultimate sense, emptiness of phenomena\nBecomes untenable.",
    "Without engaging with a fabricated entity,\nOne cannot apprehend its non-existence.\nTherefore, whatever entity is false and impossible,\nIts non-existence too is clearly false.",
    "Therefore, when in a dream one's son has died\nThe conceptual fabrication 'he does not exist'\nObstructs the conceptual fabrication 'he exists'\nYet that too is utterly false",
    "Therefore, through thorough analysis,\nNothing whatsoever exists without a cause;\nNor does anything inherently abide\nIn conditions, whether separate or combined.",
    "It neither comes from elsewhere,\nnor does it abide, nor does it go.\nHow is that which the deluded take to be real\nany different from an illusion?",
    "Examine what is conjured by magical illusion,\nAnd what is manifested through causal factors,\nFrom where do they come,\nAnd where do they go? Investigate this thoroughly.",
    "Whatever appears in the presence of certain causes\nAnd is not seen when those causes are absent\nIs artificially constructed similar to a reflection\nHow could such a thing possess inherent existence",
    "For an inherently existent entity,\nWhat need is there for a cause?\nAnd if that entity is utterly non-existent,\nWhat need is there for a cause?",
    "Even with a hundred million causes assembled,\nThat which is non-existent cannot be transformed into causal existence.\nHow could something, while in a state of non-existence, become an entity?\nAnd what other thing could transform into a real entity?",
    "If when non-existent an entity lacks inherent capacity to exist.\nAt what moment could this entity ever manifest as real.\nWithout an entity first arising into existence.\nIt cannot separate from its contradictory state of non-existence.",
    "If not free from non-existence,\nNo possibility for existence can arise.\nNor does what exists transform to non-existence\nFor this would entail the absurd consequence of dual intrinsic nature.",
    "Thus there is no cessation\nNor are there inherently existing phenomena\nTherefore all these worlds\nAre eternally unborn and unceased",
    "All beings and existences are like dreams in nature;\nWhen analytically examined, they resemble plantain trees;\nBetween nirvana and samsara,\nIn ultimate reality, there exists no difference whatsoever.",
    "Thus, in all phenomena that are empty of essence,\nWhat could truly be gained? What could truly be lost?\nBy whom could one be honored?\nWhat could truly be despised?",
    "From where do happiness and suffering truly arise?\nWhat inherently exists to be liked or disliked?\nWhen investigating their ultimate nature,\nWho is the one who craves, and what could be craved?",
    "Upon analysis, this world of living beings.\nWho truly dies here.\nWho will come to be, who has ever been.\nWhat relative or friend exists.",
    "All phenomena are like space\nThis I and those like myself should fully grasp\nThose who seek merely their own happiness\nThrough causes of fighting and attachment",
    "Agitated by conflicts yet delighting in fleeting joys,\nEnduring grief, exhaustion, and disputes,\nMutually cutting and piercing each other,\nThose survive with great hardship through misdeeds.",
    "Coming time and again to fortunate rebirth,\nHaving enjoyed numerous pleasures,\nUpon death they fall into the lower realms,\nWhere intense, prolonged, and unbearable suffering endures.",
    "In cyclic existence's three realms precipices of suffering abound\nThere ultimate reality is not found only false conceptions unsound\nSince mutual contradiction between emptiness-insight and entity-grasping stands\nThroughout samsara's ocean of pain true reality makes no demands",
    "There, incomparable and unbearable\nOceans of suffering extend beyond limits.\nThere, beings possess such little strength,\nAnd there, life itself is indeed brief.",
    "Even in this life, our time is consumed by\nMaintenance of survival and health, hunger and exhaustion,\nSleep and various afflictions, and likewise\nAssociation with childish people—all meaningless pursuits.",
    "Life swiftly passes without virtuous purpose\nDiscriminating wisdom that perceives emptiness is exceedingly rare\nAnd even with fortunate conditions the samsaric habits of distraction flow\nHow could there be a method to reverse what has been practiced?",
    "There, too, into the great lower realms,\nMāra strives to cast beings down.\nThere, wrong paths abound,\nAnd doubt is difficult to overcome.",
    "Again, precious leisure is exceedingly difficult to find.\nThe arising of a Buddha is most rare to encounter.\nThe flowing rivers of afflictions are nearly impossible to overcome.\nAlas, how beings move endlessly from one suffering to another.",
    "Alas! How utterly pitiable are these beings who, swept in suffering's flood of karma and afflictions,\nFail to see their own desperate plight, mistaking pain for joy,\nAnd cling to samsara even while mired in such extreme distress!",
    "Some repeatedly bathe\nAnd repeatedly enter fire,\nThus in extreme suffering\nThey dwell, yet delude themselves with happiness.",
    "Thus, for those who live in careless indulgence,\nUnlike true Arhats, acting as if exempt from aging and death,\nFirst death strikes—inevitable, without escape or remedy—\nThen unbearable torments await in the lower realms, perpetuating the cycle of suffering.",
    "When will I bring peace to those tormented by the fires of suffering\nWith showers of provisions and happiness-giving resources\nBorn from the clouds of my merit\nPacifying their pain",
    "When shall I, through wisdom free from all reference points,\nWith reverence accumulate merit beyond conceptualizing doer, deed, and object,\nThen teach emptiness—the ultimate antidote—with compassion \nTo those who suffer in saṃsāra through grasping at inherent existence?",
    "Thus concludes the ninth chapter on the Perfection of Wisdom (Prajñāpāramitā) from the 'Introduction to the Bodhisattva's Way of Life' (Bodhicaryāvatāra)."
  ],
  [
    "Through the virtue of my contemplation on\nThis 'Entering the Bodhisattva Way,'\nMay all beings throughout space\nBe adorned with Bodhisattva conduct.",
    "In all directions, wherever they may be,\nThose afflicted with bodily and mental suffering,\nMay they, through my merit,\nObtain oceans of happiness and joy.",
    "Throughout the endless expanse of saṃsāra\nMay these beings never fall from happiness\nMay all wandering beings attain without interruption\nThe supreme bliss of bodhisattvas in non-abiding nirvāṇa",
    "In all the world systems throughout existence,\nWhatever hell realms may be found therein,\nMay all embodied beings there,\nBe reborn in Sukhāvatī and rejoice in its perfect bliss.",
    "May those suffering from cold attain warmth. Through the boundless rivers of water\nThat flow from the great clouds of bodhisattvas,\nMay those suffering from heat be cooled.",
    "May forests of razor-leaf trees\nBecome for them a Nandana garden's splendor\nAnd may the cotton trees of Mount Śālmali\nTransform into wish-fulfilling trees that grant all dharma desires.",
    "May blue teal, ruddy shelduck, swans, and other birds,\nBecome beautiful with their melodious calls!\nWith lakes rich in lotus fragrance,\nMay regions of hell become delightful!",
    "May those heaps of burning coals become piles of precious gems.\nMay the scorching earth transform into a crystal floor.\nMay the crushing mountains that tear apart beings' flesh\nBecome magnificent offering palaces filled with Sugatas.",
    "May the rain of burning embers, heated stones, and weapons' downpour\nFrom this day forward transform into showers of blossoms.\nMay the mutual combat with weapons\nFrom today onward become merely flower-play.",
    "Submerged in the deceptive, fathomless burning river,\nWith flesh dissolved, their bones white as kunda flowers,\nBy the power of my merit, may they attain divine embodiment,\nAnd dwell with heavenly maidens in the gently flowing waters.",
    "Why do Yama's minions, crows, and terrifying vultures suddenly become frightened here?\nAs darkness disperses in all directions and joy arises, may they wonder, 'Whose benevolent power is this?'\nLooking upward into the sky, may they behold the blazing Vajrapani wielding his vajra,\nAnd may they be freed from negativities through devotion's power and accompany him.",
    "A shower of lotus blossoms mixed with fragrant waters falls,\nInstantly quenching hell's burning coals with hissing sounds,\n'What is this?' wonder the beings, suddenly filled with unexpected bliss,\nMay those suffering in hell behold the Lotus-Handed Lord of Compassion.",
    "Come quickly, brothers! Cast aside your fears and hasten here to us!\nBy his power, all our hellish sufferings have vanished, and powerful waves of joy now flow within us.\nThe awakened mind of bodhicitta has arisen in him, along with compassion that protects all beings without exception—the mother of universal salvation.\nFor a radiant youth with five topknots adorned with a jeweled crest has arrived among us—some fearless-making Mañjuśrī.",
    "Behold him, his lotus feet worshipped by the crowns of hundreds of gods.\nHis eyes moist with compassion, his head showered with blossoms.\nDwelling in magnificent multi-storied palaces, with thousands of goddesses singing hymns.\nUpon seeing such a Mañjuśrī before them, may the agonizing cries of hell beings now transform.",
    "Thus, through my virtuous roots, may Samantabhadra and other\nBodhisattva clouds free from obscurations, with their bliss and\nCooling, sweet-scented rain showers falling down to be seen,\nCause those beings in the hells to truly rejoice.",
    "May animals be free from the fear\nOf eating one another.\nLike the humans of Uttarakuru,\nMay all hungry ghosts experience happiness.",
    "From noble Avalokiteshvara, Lord of Compassion's\nFingers, toes, and every pore flows sweet cooling nectar streams.\nMay hungry ghosts be satisfied,\nAnd bathing in this nectar, be forever cooled.",
    "May the blind see forms with their eyes,\nMay the deaf always hear sounds.\nLike the goddess of illusion,\nMay pregnant women give birth without harm.",
    "May the naked receive divine garments of finest quality,\nMay the hungry obtain nourishing food of a hundred flavors,\nMay the thirsty find pure water of eight excellent qualities,\nMay the parched enjoy divine nectar and sweet, delicious drinks.",
    "May the poor obtain wealth.\nMay those in grief and suffering find joy.\nMay the despondent be revived in spirit,\nAnd attain perfect, unwavering stability.",
    "May all sentient beings afflicted with illness\nSwiftly be freed from their suffering\n\nMay all maladies—both physical and mental—without exception\nNever arise again throughout all world systems by the power of this virtue.",
    "May those terrified become fearless.\nMay those bound be liberated.\nMay the weak become endowed with strength.\nMay hearts grow tender toward one another.",
    "May all travelers, wherever they may journey,\nFind every direction—east, west, north, and south—auspicious and filled with good fortune! Whatever purpose drives them forward—be it wealth, trade, or spiritual quest—\nMay it be accomplished without effort, as if the goal itself dissolves distance to meet them!",
    "May those embarking on boats and great ships\nFulfill their quests for precious gems and treasures\nSafely reach the shore, free from stormy winds and water perils\nAnd rejoice with parents, relatives, and friends in festive celebration.",
    "May those who wander lost on sorrowful paths astray,\nFind companions who will guide them on their way,\nMay they journey free from thieves, tigers and all fears,\nProceeding onward without weariness or tears.",
    "In remote monasteries and wild perilous places,\nFor children, the elderly and those without protection,\nFor those asleep, intoxicated or thoroughly overcome by drink,\nMay the divine guardians offer their vigilant safekeeping.",
    "Freed from the eight states without leisure for Dharma\nEndowed with steadfast faith, discerning wisdom, and loving compassion\nPerfected in pure sustenance and virtuous conduct\nMay beings always remember their previous lives.",
    "May all possess inexhaustible treasuries like the sky-treasury meditation.\nFree from disputes and the toil of vigilance, may all beings—even the marginalized—enjoy their resources with perfect autonomy,\nUnharmed by enemies and spirits, using their abundance with wisdom and compassion\nFor dharma practice and others' welfare.",
    "May beings of little splendor who are overshadowed by others\nBecome endowed with great majesty, free from others' contempt. May ascetics whose forms have grown ill-shaped through austerities\nBe blessed with the perfection of beautiful physical appearance.",
    "May all women in the world,\nAttain the masculine form. May those of lowly birth rise to higher status,\nAnd having attained elevation, may their pride be thoroughly vanquished.",
    "Through this merit of mine,\nMay all sentient beings without exception\nAbandon all negative actions completely,\nAnd always engage in virtuous conduct.",
    "May we never be separated from bodhicitta.\nBe devoted to bodhicarya, the conduct of enlightenment.\nBe thoroughly embraced by all the Buddhas.\nAnd abandon all Māra's activities.",
    "May all sentient beings\nPossess immeasurable, boundless lifespans.\nMay they continuously dwell in perfect happiness, abundant prosperity, and complete freedom from suffering,\nAnd may even the very concept of death disappear entirely from their existence.",
    "May these be wish-fulfilling trees' pleasure gardens.\nBuddhas and the Buddha's children (Bodhisattvas),\nWho captivate beings with the melodious proclamation of the Dharma,\nMay they fill all directions.",
    "May the ground in all directions remain free from gravel and other impediments,\nLevel like the palm of a hand, made of luminous, pure lapis lazuli,\nNaturally soft and smooth to the touch.",
    "Throughout all the maṇḍalas of assemblies—in monasteries, regions, and sacred places—\nMay numerous bodhisattvas, with their own excellences, adorn the surface of the earth, and long remain present.",
    "May all embodied beings and birds,\nAnd all trees and rays of light,\nAnd even from the vast sky itself, the sound of Dharma,\nContinuously hear the unceasing.",
    "May they continually meet with the Buddhas\nAnd with the Buddha's sons, the bodhisattvas.\nThrough infinite clouds of offerings,\nMay they make offerings to the supreme guides of all wandering beings.",
    "May the gods, through our virtuous deeds, send rain in due season,\nMay harvests be abundant, creating favorable conditions for Dharma practice. May the king rule righteously according to Dharma principles. May the world flourish—both the environment and all beings within it.",
    "May medicines of all types be endowed with power,\nMay the recitation of secret mantras yield their intended results.\nMay ḍākinīs, rākṣasas, and so forth,\nBecome filled with compassionate minds.",
    "May no sentient being suffer pain.\nMay none commit sinful actions or evil deeds.\nMay none experience fear or be despised by others.\nMay no one's mind ever fall into distress.",
    "May monasteries housing the Tripitaka flourish,\nadorned with study and memorized recitation. May the Sangha always remain harmonious,\nand may their aims be fully accomplished.",
    "May monks who seek the threefold training obtain outer, inner, and secret seclusion.\nHaving abandoned all distractions,\nMay they meditate with enthusiastic hearts on profound truth, cultivating minds of perfect pliancy and workability.",
    "May the bhikṣuṇīs be endowed with robes, food, and requisites,\nFree from quarrels among themselves and harm from others.\nLikewise, may all who have entered the renunciant path\nMaintain their moral discipline completely unbroken.",
    "May I, disheartened by my moral failings,\nAlways strive to exhaust negative deeds through confession and restraint.\nMay I attain fortunate rebirth,\nAnd there, may my spiritual vows remain unbroken and my heart free from pride.",
    "May the scholars, versed in the five fields of knowledge and three baskets of teachings, be honored; May they obtain alms food, robes, bowls, and other monastic necessities;\nMay their mental continuum be thoroughly purified of pride, jealousy, contempt, criticism of other traditions, and moral breaches; May their fame spread in all directions as learned and disciplined ones who discern what to adopt and abandon from the Victorious One's teachings that bring benefit and happiness.",
    "Without experiencing the suffering of lower realms,\nAnd without having to undertake difficult austerities,\nWith a divine body that surpasses even the gods,\nMay they attain the state of Buddhahood swiftly.",
    "May all sentient beings repeatedly make offerings\nTo all the perfectly Awakened Ones throughout the ten directions\nThrough the inconceivable bliss of Buddhahood, transcending worldly pleasure\nMay they always abide in abundant supreme happiness.",
    "May the aspirations of the bodhisattvas,\nFor the temporary and ultimate benefit of wandering beings be fulfilled exactly as they intend;\nMay whatever these compassionate protectors have in mind,\nBe bestowed upon all sentient beings, just as they envision.",
    "May the Pratyekabuddhas attain happiness,\nAnd may the Śrāvakas likewise be happy.",
    "Through the grace of Mañjuśrī,\nUntil I attain the Ground of Perfect Joy,\nMay I always remember my past lives,\nAnd obtain the perfect discipline of renunciation.",
    "May I sustain myself even with simple alms food, while maintaining strength and vitality for practice.\nIn all future lifetimes until attaining Buddhahood, may I obtain perfect conditions for dwelling in solitude—with outer, inner, and secret seclusion fully accomplished.",
    "Whenever I wish to behold,\nOr desire to ask even the smallest point,\nMay I see that very protector Mañjunātha,\nWithout any obstacles.",
    "Throughout the ten directions to the limits of space,\nFor the purpose of accomplishing the welfare of all sentient beings,\nJust as Mañjuśrī conducts himself with perfect wisdom,\nMay my conduct become exactly like that.",
    "For as long as space endures,\nAnd as long as sentient beings remain,\nUntil then, may I too abide,\nTo dispel the sufferings of all beings.",
    "Whatever suffering exists among beings in all realms including the hells,\nMay all of it ripen upon me.\nThrough the aspirations and accumulated merit of the noble bodhisattva sangha,\nMay all beings enjoy happiness and well-being.",
    "The sole medicine for all beings' suffering.\nThe source of all happiness.\nMay the Dharma—both scriptural and realized—\nLong endure with generous patronage and reverence.",
    "Through whose grace a virtuous mind arises,\nI bow to Mañjughoṣa (Gentle Voice).\nThrough whose kindness I have flourished,\nI pay homage to the Virtuous Friend (kalyāṇamitra).",
    "This concludes the tenth chapter, entitled 'Dedication of Merit,' from the Bodhicharyāvatāra (Entry into the Bodhisattva's Way of Life).\n\nHere ends the Bodhicharyāvatāra, composed by Ācārya Śāntideva.",
    "The Indian preceptor Sarvajñadeva and the great translator Bande Paltsegs collated the text with a Kashmiri manuscript and established a definitive edition.\n\nSubsequently, the Indian preceptor Dharmaśrībhadra and the great translators Bande Rinchen Zangpo and Śākya Lodrö corrected and retranslated [the text] in accordance with a manuscript from Central India and its commentary, thereby establishing an improved definitive edition.\n\nAt a later time, the Indian preceptor Sumatikīrti and the great translator monk Loden Sherab meticulously corrected and retranslated [the text], thereby establishing a superior and thoroughly refined definitive edition."
  ]
]